------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\stoehr\Dropbox\Data\Gallup\JDE Revision\replication_GWP_part.log
  log type:  text
 opened on:  16 Nov 2018, 15:08:30

. * For legal reasons, we are not allowed to share the Gallup data that would be needed to replicate these results. We therefore attach 
. use "$gallupreplication\replication_data_gallup.dta", clear

. xtset pair_id year
       panel variable:  pair_id (unbalanced)
        time variable:  year, 2004 to 2014, but with gaps
                delta:  1 unit

.  
. global basic="o_log_gdp o_log_pop d_log_gdp d_log_pop"

. global gallup="wmigdemand wmigplan wmigprep"

. 
. global sample1 "fwd_log_mig!=. & GTI_bil_1!=. & GTI1!=.  &  o_log_gdp!=. &  o_log_pop!=. &  d_log_gdp!=. & d_log_pop!=. & wmigprep!=.&wmigplan!=.&wmigdemand!=."
>          

. count if $sample1 
  21,855

. bys year: count if $sample1

------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year = 2004
  1,900
------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year = 2005
  1,956
------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year = 2006
  2,092
------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year = 2007
  1,703
------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year = 2008
  1,615
------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year = 2009
  1,562
------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year = 2010
  2,201
------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year = 2011
  2,335
------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year = 2012
  2,306
------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year = 2013
  2,292
------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year = 2014
  1,893

. 
. global bil_GTI_spec="GTI_bil_0 GTI_bil_1 GTI_bil_2 GTI_bil_3 GTI_bil_4 GTI_bil_5 GTI_bil_6 GTI_bil_7 GTI_bil_8 GTI_bil_9 GTI_bil_10 GTI_bil_11 GTI_bil_12 GTI_bi
> l_13 GTI_bil_14 GTI_bil_15 GTI_bil_16 GTI_bil_17 GTI_bil_18 GTI_bil_19 GTI_bil_20 GTI_bil_21 GTI_bil_22 GTI_bil_23 GTI_bil_24 GTI_bil_25 GTI_bil_26 GTI_bil_27 G
> TI_bil_28 GTI_bil_29 GTI_bil_30 GTI_bil_31 GTI_bil_32 GTI_bil_33 GTI_bil_34 GTI_bil_35 GTI_bil_36 GTI_bil_37 GTI_bil_38 GTI_bil_39 GTI_bil_40 GTI_bil_41 GTI_bil
> _42 GTI_bil_43 GTI_bil_44 GTI_bil_45 GTI_bil_46 GTI_bil_47 GTI_bil_48 GTI_bil_49 GTI_bil_50 GTI_bil_51 GTI_bil_52 GTI_bil_53 GTI_bil_54 GTI_bil_55 GTI_bil_56 GT
> I_bil_57 GTI_bil_58 GTI_bil_59 GTI_bil_60 GTI_bil_61 GTI_bil_62 GTI_bil_63 GTI_bil_64 GTI_bil_65 GTI_bil_66 GTI_bil_67 GTI_bil0_uni1 GTI_bil0_uni2 GTI_bil0_uni3
>  GTI_bil0_uni4 GTI_bil0_uni5 GTI_bil0_uni6 GTI_bil0_uni7 GTI_bil0_uni8 GTI_bil0_uni9 GTI_bil0_uni10 GTI_bil0_uni11 GTI_bil0_uni12 GTI_bil0_uni13 GTI_bil0_uni14 
> GTI_bil0_uni15 GTI_bil0_uni16 GTI_bil0_uni17 GTI_bil0_uni18 GTI_bil0_uni19 GTI_bil0_uni20 GTI_bil0_uni21 GTI_bil0_uni22 GTI_bil0_uni23 GTI_bil0_uni24 GTI_bil0_u
> ni25 GTI_bil0_uni26 GTI_bil0_uni27 GTI_bil0_uni28 GTI_bil0_uni29 GTI_bil0_uni30 GTI_bil0_uni31 GTI_bil0_uni32 GTI_bil0_uni33 GTI_bil0_uni34 GTI_bil0_uni35 GTI_b
> il0_uni36 GTI_bil0_uni37 GTI_bil0_uni38 GTI_bil0_uni39 GTI_bil0_uni40 GTI_bil0_uni41 GTI_bil0_uni42 GTI_bil0_uni43 GTI_bil0_uni44 GTI_bil0_uni45 GTI_bil0_uni46 
> GTI_bil0_uni47 GTI_bil0_uni48 GTI_bil0_uni49 GTI_bil0_uni50 GTI_bil0_uni51 GTI_bil0_uni52 GTI_bil0_uni53 GTI_bil0_uni54 GTI_bil0_uni55 GTI_bil0_uni56 GTI_bil0_u
> ni57 GTI_bil0_uni58 GTI_bil0_uni59 GTI_bil0_uni60 GTI_bil0_uni61 GTI_bil0_uni62 GTI_bil0_uni63 GTI_bil0_uni64 GTI_bil0_uni65 GTI_bil0_uni66 GTI_bil0_uni67"

. sort pair_id year

. 
. sum wmigdemand wmigplan wmigprep

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  wmigdemand |     28,040    54824.84    486890.1          0   2.53e+07
    wmigplan |     25,802     3693.53    35574.58          0    2805961
    wmigprep |     25,981    1414.651    13857.36          0   667769.3

. gen log_wmigdemand=log(wmigdemand+1) 

. gen log_wmigplan=log(wmigplan+1) 
(2,238 missing values generated)

. gen log_wmigprep=log(wmigprep+1)
(2,059 missing values generated)

. global gallup="log_wmigdemand log_wmigplan log_wmigprep"

. 
. * regxfe does not accept "c."-syntax, hence create interactions explicitly
. forval i=1/67{
  2.         gen GTI_bil0_uni`i'=GTI_bil_0*GTI`i'
  3.         }       

. 
. recast long iso3n_dXyear iso3n_oXyear iso3n_o iso3n_d year pair_id // for regxfe FEs indicators need to be byte, int or long, not float.

. 
. *Table 6: Bilateral model including Google Trends Indices and Gallup World Poll migration intentions
. //destination, origin, year FE (a la Mayda 2009)
. regxfe fwd_log_mig $gallup $basic if $sample1, fe(iso3n_o iso3n_d year)  cluster(pair_id)  
Transforming the data
........
Estimating redundant parameters
....
Number of redundant parameters: 2

                                                 Number of obs      =    21855
                                                 F_xb (    7, 21703)=   69.481
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.7530
                                                 R2-Within          =   0.0754
                                                 # redundant FE     =        2
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
log_wmigdemand |   .0703785   .0045514    15.46   0.000     .0614575    .0792994
  log_wmigplan |   .0346594   .0090225     3.84   0.000     .0169746    .0523442
  log_wmigprep |   .0711535   .0125778     5.66   0.000     .0465001    .0958068
     o_log_gdp |  -.9149036   .1246123    -7.34   0.000    -1.159153   -.6706544
     o_log_pop |    .280459   .3283112     0.85   0.393    -.3630549    .9239729
     d_log_gdp |    1.22962   .2422622     5.08   0.000     .7547683    1.704472
     d_log_pop |  -3.384492   .4333369    -7.81   0.000    -4.233864    -2.53512
         _cons |   6.447927   1.649511     3.91   0.000     3.214764    9.681091
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_Table6.xls", replace label excel tex ctitle("Benchmark, Mayda") adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.xls
dir : seeout

. regxfe fwd_log_mig $gallup $bil_GTI_spec $basic if $sample1, fe(iso3n_o iso3n_d year)  cluster(pair_id)
Transforming the data
.........
Estimating redundant parameters
....
Number of redundant parameters: 2

                                                 Number of obs      =    21855
                                                 F_xb (  141, 21569)=   45.739
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.8199
                                                 R2-Within          =   0.3257
                                                 # redundant FE     =        2
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
log_wmigdemand |   .0655037   .0039678    16.51   0.000     .0577266    .0732808
  log_wmigplan |   .0374551   .0080142     4.67   0.000     .0217466    .0531636
  log_wmigprep |   .0483834   .0105193     4.60   0.000     .0277648     .069002
     GTI_bil_0 |   .0900646   .0062479    14.42   0.000     .0778182     .102311
     GTI_bil_1 |   .0722293   .0910121     0.79   0.427    -.1061612    .2506198
     GTI_bil_2 |  -.0080426    .008128    -0.99   0.322    -.0239741    .0078889
     GTI_bil_3 |   -.014587   .0256904    -0.57   0.570    -.0649421    .0357681
     GTI_bil_4 |   .0191315   .0115591     1.66   0.098    -.0035253    .0417883
     GTI_bil_5 |   -.017576   .0096123    -1.83   0.067    -.0364169    .0012649
     GTI_bil_6 |   .0148369   .0058336     2.54   0.011     .0034027    .0262711
     GTI_bil_7 |   .0279379    .012928     2.16   0.031      .002598    .0532779
     GTI_bil_8 |   .0145753   .0073562     1.98   0.048     .0001565     .028994
     GTI_bil_9 |    .017761   .0343179     0.52   0.605    -.0495047    .0850267
    GTI_bil_10 |   .0165865     .00355     4.67   0.000     .0096283    .0235448
    GTI_bil_12 |    .016281   .0147158     1.11   0.269     -.012563     .045125
    GTI_bil_13 |   .0068059   .0181734     0.37   0.708    -.0288153    .0424271
    GTI_bil_14 |   .0051998   .0055676     0.93   0.350    -.0057131    .0161127
    GTI_bil_15 |  -.0313042   .0168686    -1.86   0.064     -.064368    .0017596
    GTI_bil_16 |   .0046794   .0084393     0.55   0.579    -.0118623    .0212211
    GTI_bil_17 |   .0104359   .0124932     0.84   0.404    -.0140516    .0349234
    GTI_bil_18 |  -.0017794    .006742    -0.26   0.792    -.0149942    .0114354
    GTI_bil_19 |  -.0294235    .018661    -1.58   0.115    -.0660005    .0071535
    GTI_bil_20 |  -.0187081   .0087013    -2.15   0.032    -.0357634   -.0016529
    GTI_bil_21 |   .0280104   .0207018     1.35   0.176    -.0125666    .0685875
    GTI_bil_22 |   .0276179   .0092509     2.99   0.003     .0094855    .0457504
    GTI_bil_23 |  -.0415138   .0150641    -2.76   0.006    -.0710405   -.0119872
    GTI_bil_24 |  -.0386435   .0100674    -3.84   0.000    -.0583764   -.0189107
    GTI_bil_25 |   .0007985   .0070144     0.11   0.909    -.0129503    .0145473
    GTI_bil_26 |  -.0145645   .0094421    -1.54   0.123    -.0330717    .0039428
    GTI_bil_27 |  -.0317053   .0101204    -3.13   0.002    -.0515421   -.0118685
    GTI_bil_28 |   .0490702    .032925     1.49   0.136    -.0154652    .1136056
    GTI_bil_29 |   .0046647   .0098419     0.47   0.636    -.0146261    .0239556
    GTI_bil_30 |  -.0145984    .010453    -1.40   0.163    -.0350872    .0058903
    GTI_bil_31 |  -.1812282   .0421345    -4.30   0.000     -.263815   -.0986414
    GTI_bil_32 |   .0010887   .0080218     0.14   0.892    -.0146347     .016812
    GTI_bil_33 |  -.0544258   .0703793    -0.77   0.439    -.1923745    .0835229
    GTI_bil_34 |   .2057342    .058357     3.53   0.000     .0913501    .3201183
    GTI_bil_35 |  -.0569509   .0624675    -0.91   0.362    -.1793919    .0654901
    GTI_bil_36 |   .0161992   .0043428     3.73   0.000      .007687    .0247114
    GTI_bil_37 |  -.0178383   .0097945    -1.82   0.069    -.0370362    .0013596
    GTI_bil_38 |  -.0162217   .0074935    -2.16   0.030    -.0309094    -.001534
    GTI_bil_39 |  -.0165657   .0091235    -1.82   0.069    -.0344485    .0013171
    GTI_bil_40 |  -.0037557   .0187355    -0.20   0.841    -.0404787    .0329673
    GTI_bil_41 |   .0128091   .0086784     1.48   0.140    -.0042013    .0298195
    GTI_bil_42 |  -.1731618   .1766379    -0.98   0.327    -.5193851    .1730615
    GTI_bil_43 |  -.0347237   .0113074    -3.07   0.002     -.056887   -.0125604
    GTI_bil_44 |   .0034878   .0081102     0.43   0.667    -.0124088    .0193844
    GTI_bil_45 |  -.0118703   .0077255    -1.54   0.124    -.0270127    .0032722
    GTI_bil_46 |   .0057366   .0084283     0.68   0.496    -.0107834    .0222566
    GTI_bil_47 |  -.0109333   .0100608    -1.09   0.277    -.0306532    .0087867
    GTI_bil_48 |  -.0174858   .0160401    -1.09   0.276    -.0489255     .013954
    GTI_bil_49 |   .0081861   .0115566     0.71   0.479    -.0144656    .0308379
    GTI_bil_50 |   .0395843   .0128208     3.09   0.002     .0144545    .0647141
    GTI_bil_51 |  -.0051817    .006756    -0.77   0.443    -.0184239    .0080606
    GTI_bil_52 |   .0321125   .0041986     7.65   0.000      .023883     .040342
    GTI_bil_53 |    .013132   .0142586     0.92   0.357    -.0148159    .0410799
    GTI_bil_54 |   -.028328   .0069585    -4.07   0.000     -.041967   -.0146889
    GTI_bil_55 |   .0145341   .0088364     1.64   0.100    -.0027859     .031854
    GTI_bil_56 |  -.0068613   .0244294    -0.28   0.779    -.0547447    .0410221
    GTI_bil_57 |  -.0015412   .0059373    -0.26   0.795    -.0131787    .0100963
    GTI_bil_58 |  -.0187324   .0111016    -1.69   0.092    -.0404923    .0030275
    GTI_bil_59 |    .013748   .0120976     1.14   0.256    -.0099642    .0374603
    GTI_bil_60 |  -.1450233    .050738    -2.86   0.004    -.2444735   -.0455731
    GTI_bil_61 |   .0274929   .0062179     4.42   0.000     .0153054    .0396804
    GTI_bil_62 |     .00804   .0058685     1.37   0.171    -.0034628    .0195427
    GTI_bil_63 |  -.0264228    .017091    -1.55   0.122    -.0599223    .0070768
    GTI_bil_64 |  -.0123347   .0052773    -2.34   0.019    -.0226786   -.0019908
    GTI_bil_65 |  -.0499589   .0190583    -2.62   0.009    -.0873146   -.0126032
    GTI_bil_66 |  -.0094672   .0059226    -1.60   0.110    -.0210758    .0021415
    GTI_bil_67 |   .0383049   .0255803     1.50   0.134    -.0118344    .0884442
 GTI_bil0_uni1 |   .0002626   .0001003     2.62   0.009     .0000659    .0004592
 GTI_bil0_uni2 |  -9.69e-06    .000086    -0.11   0.910    -.0001782    .0001589
 GTI_bil0_uni3 |    .000157   .0000843     1.86   0.063    -8.35e-06    .0003223
 GTI_bil0_uni4 |  -.0000402   .0001502    -0.27   0.789    -.0003345    .0002542
 GTI_bil0_uni5 |     .00002   .0000732     0.27   0.784    -.0001234    .0001634
 GTI_bil0_uni6 |   .0000675   .0000831     0.81   0.417    -.0000954    .0002304
 GTI_bil0_uni7 |  -.0001399   .0000939    -1.49   0.137     -.000324    .0000443
 GTI_bil0_uni8 |  -.0001887   .0000929    -2.03   0.042    -.0003709   -6.56e-06
 GTI_bil0_uni9 |   .0000348    .000075     0.46   0.643    -.0001123    .0001819
GTI_bil0_uni10 |  -.0001073   .0000828    -1.30   0.195    -.0002696     .000055
GTI_bil0_uni11 |   .0002762   .0000918     3.01   0.003     .0000963    .0004561
GTI_bil0_uni12 |  -.0002321   .0000874    -2.65   0.008    -.0004035   -.0000607
GTI_bil0_uni13 |  -.0001572   .0001023    -1.54   0.124    -.0003577    .0000433
GTI_bil0_uni14 |  -.0000498   .0000905    -0.55   0.582    -.0002272    .0001276
GTI_bil0_uni15 |   7.94e-07   .0000756     0.01   0.992    -.0001474     .000149
GTI_bil0_uni16 |  -.0000658   .0000755    -0.87   0.384    -.0002138    .0000823
GTI_bil0_uni17 |   .0002153   .0000898     2.40   0.016     .0000394    .0003912
GTI_bil0_uni18 |  -.0000218   .0000886    -0.25   0.805    -.0001954    .0001518
GTI_bil0_uni19 |   .0003098   .0000911     3.40   0.001     .0001312    .0004883
GTI_bil0_uni20 |   .0000264   .0001022     0.26   0.796     -.000174    .0002268
GTI_bil0_uni21 |  -.0001158   .0000977    -1.19   0.236    -.0003072    .0000756
GTI_bil0_uni22 |   .0001719   .0000853     2.01   0.044     4.66e-06    .0003392
GTI_bil0_uni23 |  -.0000322    .000073    -0.44   0.659    -.0001752    .0001108
GTI_bil0_uni24 |   .0000751   .0000866     0.87   0.385    -.0000946    .0002449
GTI_bil0_uni25 |  -.0000645   .0000719    -0.90   0.370    -.0002055    .0000765
GTI_bil0_uni26 |   .0002117   .0000863     2.45   0.014     .0000425    .0003809
GTI_bil0_uni27 |   1.22e-06   .0000866     0.01   0.989    -.0001685    .0001709
GTI_bil0_uni28 |   .0000509   .0001275     0.40   0.690     -.000199    .0003008
GTI_bil0_uni29 |   .0000271   .0000896     0.30   0.762    -.0001485    .0002027
GTI_bil0_uni30 |  -.0001045   .0000949    -1.10   0.271    -.0002906    .0000816
GTI_bil0_uni31 |  -.0000125   .0000748    -0.17   0.867    -.0001591     .000134
GTI_bil0_uni32 |   .0001298   .0000837     1.55   0.121    -.0000342    .0002938
GTI_bil0_uni33 |  -.0000622   .0000976    -0.64   0.524    -.0002536    .0001291
GTI_bil0_uni34 |  -.0001705   .0001049    -1.63   0.104    -.0003761    .0000351
GTI_bil0_uni35 |  -.0000144   .0001033    -0.14   0.889    -.0002169    .0001881
GTI_bil0_uni36 |  -.0000431   .0000817    -0.53   0.598    -.0002033    .0001171
GTI_bil0_uni37 |  -.0000377   .0000867    -0.44   0.663    -.0002077    .0001322
GTI_bil0_uni38 |  -.0001905   .0000989    -1.93   0.054    -.0003844    3.47e-06
GTI_bil0_uni39 |  -.0004773    .000106    -4.50   0.000     -.000685   -.0002695
GTI_bil0_uni40 |  -.0003261   .0000947    -3.44   0.001    -.0005117   -.0001405
GTI_bil0_uni41 |   .0001448   .0000982     1.47   0.140    -.0000476    .0003372
GTI_bil0_uni42 |   .0000739   .0000961     0.77   0.442    -.0001145    .0002623
GTI_bil0_uni43 |  -.0000267    .000098    -0.27   0.785    -.0002187    .0001653
GTI_bil0_uni44 |  -.0000553   .0000914    -0.61   0.545    -.0002346    .0001239
GTI_bil0_uni45 |   .0000345    .000082     0.42   0.674    -.0001261    .0001952
GTI_bil0_uni46 |   .0000547   .0000685     0.80   0.424    -.0000795    .0001889
GTI_bil0_uni47 |   .0000684    .000099     0.69   0.489    -.0001256    .0002625
GTI_bil0_uni48 |   .0001445   .0000792     1.82   0.068    -.0000108    .0002998
GTI_bil0_uni49 |   .0001307   .0000882     1.48   0.138    -.0000421    .0003035
GTI_bil0_uni50 |  -.0000895   .0000656    -1.36   0.173    -.0002181    .0000392
GTI_bil0_uni51 |  -.0000805   .0000637    -1.26   0.206    -.0002053    .0000443
GTI_bil0_uni52 |  -.0001405   .0000871    -1.61   0.107    -.0003112    .0000302
GTI_bil0_uni53 |  -.0001478   .0000779    -1.90   0.058    -.0003005    4.89e-06
GTI_bil0_uni54 |  -.0000627   .0000978    -0.64   0.521    -.0002543    .0001289
GTI_bil0_uni55 |  -.0000781   .0000909    -0.86   0.390    -.0002564    .0001001
GTI_bil0_uni56 |  -.0000156    .000069    -0.23   0.822    -.0001508    .0001197
GTI_bil0_uni57 |   -.000291   .0000772    -3.77   0.000    -.0004422   -.0001397
GTI_bil0_uni58 |   .0000211   .0000644     0.33   0.743    -.0001051    .0001473
GTI_bil0_uni59 |   .0002244   .0000633     3.55   0.000     .0001003    .0003484
GTI_bil0_uni60 |  -.0001172   .0000849    -1.38   0.167    -.0002836    .0000491
GTI_bil0_uni61 |   .0000274    .000105     0.26   0.794    -.0001785    .0002333
GTI_bil0_uni62 |  -.0001382   .0000801    -1.73   0.084    -.0002951    .0000187
GTI_bil0_uni63 |  -.0001912   .0000893    -2.14   0.032    -.0003662   -.0000161
GTI_bil0_uni64 |  -.0000944    .000076    -1.24   0.215    -.0002434    .0000547
GTI_bil0_uni65 |   3.38e-06   .0000753     0.04   0.964    -.0001441    .0001509
GTI_bil0_uni66 |    .000055   .0000808     0.68   0.496    -.0001033    .0002134
GTI_bil0_uni67 |  -.0001493   .0000792    -1.88   0.060    -.0003045    5.99e-06
     o_log_gdp |   -.503091   .1207227    -4.17   0.000    -.7397165   -.2664656
     o_log_pop |   .7350541   .3232903     2.27   0.023     .1013812    1.368727
     d_log_gdp |    .674661   .2385253     2.83   0.005     .2071337    1.142188
     d_log_pop |  -.7642912   .4248043    -1.80   0.072    -1.596939    .0683566
         _cons |   .3926052   1.613502     0.24   0.808    -2.769977    3.555188
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_Table6.xls", append label excel tex ctitle("GTI, Mayda")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.xls
dir : seeout

. test GTI_bil_0 GTI_bil_1 GTI_bil_2 GTI_bil_3 GTI_bil_4 GTI_bil_5 GTI_bil_6 GTI_bil_7 GTI_bil_8 GTI_bil_9 GTI_bil_10 GTI_bil_12 GTI_bil_13 GTI_bil_14 GTI_bil_15 
> GTI_bil_16 GTI_bil_17 GTI_bil_18 GTI_bil_19 GTI_bil_20 GTI_bil_21 GTI_bil_22 GTI_bil_23 GTI_bil_24 GTI_bil_25 GTI_bil_26 GTI_bil_27 GTI_bil_28 GTI_bil_29 GTI_bi
> l_30 GTI_bil_31 GTI_bil_32 GTI_bil_33 GTI_bil_34 GTI_bil_35 GTI_bil_36 GTI_bil_37 GTI_bil_38 GTI_bil_39 GTI_bil_40 GTI_bil_41 GTI_bil_42 GTI_bil_43 GTI_bil_44 G
> TI_bil_45 GTI_bil_46 GTI_bil_47 GTI_bil_48 GTI_bil_49 GTI_bil_50 GTI_bil_51 GTI_bil_52 GTI_bil_53 GTI_bil_54 GTI_bil_55 GTI_bil_56 GTI_bil_57 GTI_bil_58 GTI_bil
> _59 GTI_bil_60 GTI_bil_61 GTI_bil_62 GTI_bil_63 GTI_bil_64 GTI_bil_65 GTI_bil_66 GTI_bil_67 GTI_bil0_uni1 GTI_bil0_uni2 GTI_bil0_uni3 GTI_bil0_uni4 GTI_bil0_uni
> 5 GTI_bil0_uni6 GTI_bil0_uni7 GTI_bil0_uni8 GTI_bil0_uni9 GTI_bil0_uni10 GTI_bil0_uni11 GTI_bil0_uni12 GTI_bil0_uni13 GTI_bil0_uni14 GTI_bil0_uni15 GTI_bil0_uni
> 16 GTI_bil0_uni17 GTI_bil0_uni18 GTI_bil0_uni19 GTI_bil0_uni20 GTI_bil0_uni21 GTI_bil0_uni22 GTI_bil0_uni23 GTI_bil0_uni24 GTI_bil0_uni25 GTI_bil0_uni26 GTI_bil
> 0_uni27 GTI_bil0_uni28 GTI_bil0_uni29 GTI_bil0_uni30 GTI_bil0_uni31 GTI_bil0_uni32 GTI_bil0_uni33 GTI_bil0_uni34 GTI_bil0_uni35 GTI_bil0_uni36 GTI_bil0_uni37 GT
> I_bil0_uni38 GTI_bil0_uni39 GTI_bil0_uni40 GTI_bil0_uni41 GTI_bil0_uni42 GTI_bil0_uni43 GTI_bil0_uni44 GTI_bil0_uni45 GTI_bil0_uni46 GTI_bil0_uni47 GTI_bil0_uni
> 48 GTI_bil0_uni49 GTI_bil0_uni50 GTI_bil0_uni51 GTI_bil0_uni52 GTI_bil0_uni53 GTI_bil0_uni54 GTI_bil0_uni55 GTI_bil0_uni56 GTI_bil0_uni57 GTI_bil0_uni58 GTI_bil
> 0_uni59 GTI_bil0_uni60 GTI_bil0_uni61 GTI_bil0_uni62 GTI_bil0_uni63 GTI_bil0_uni64 GTI_bil0_uni65 GTI_bil0_uni66 GTI_bil0_uni67                                 

 ( 1)  GTI_bil_0 = 0
 ( 2)  GTI_bil_1 = 0
 ( 3)  GTI_bil_2 = 0
 ( 4)  GTI_bil_3 = 0
 ( 5)  GTI_bil_4 = 0
 ( 6)  GTI_bil_5 = 0
 ( 7)  GTI_bil_6 = 0
 ( 8)  GTI_bil_7 = 0
 ( 9)  GTI_bil_8 = 0
 (10)  GTI_bil_9 = 0
 (11)  GTI_bil_10 = 0
 (12)  GTI_bil_12 = 0
 (13)  GTI_bil_13 = 0
 (14)  GTI_bil_14 = 0
 (15)  GTI_bil_15 = 0
 (16)  GTI_bil_16 = 0
 (17)  GTI_bil_17 = 0
 (18)  GTI_bil_18 = 0
 (19)  GTI_bil_19 = 0
 (20)  GTI_bil_20 = 0
 (21)  GTI_bil_21 = 0
 (22)  GTI_bil_22 = 0
 (23)  GTI_bil_23 = 0
 (24)  GTI_bil_24 = 0
 (25)  GTI_bil_25 = 0
 (26)  GTI_bil_26 = 0
 (27)  GTI_bil_27 = 0
 (28)  GTI_bil_28 = 0
 (29)  GTI_bil_29 = 0
 (30)  GTI_bil_30 = 0
 (31)  GTI_bil_31 = 0
 (32)  GTI_bil_32 = 0
 (33)  GTI_bil_33 = 0
 (34)  GTI_bil_34 = 0
 (35)  GTI_bil_35 = 0
 (36)  GTI_bil_36 = 0
 (37)  GTI_bil_37 = 0
 (38)  GTI_bil_38 = 0
 (39)  GTI_bil_39 = 0
 (40)  GTI_bil_40 = 0
 (41)  GTI_bil_41 = 0
 (42)  GTI_bil_42 = 0
 (43)  GTI_bil_43 = 0
 (44)  GTI_bil_44 = 0
 (45)  GTI_bil_45 = 0
 (46)  GTI_bil_46 = 0
 (47)  GTI_bil_47 = 0
 (48)  GTI_bil_48 = 0
 (49)  GTI_bil_49 = 0
 (50)  GTI_bil_50 = 0
 (51)  GTI_bil_51 = 0
 (52)  GTI_bil_52 = 0
 (53)  GTI_bil_53 = 0
 (54)  GTI_bil_54 = 0
 (55)  GTI_bil_55 = 0
 (56)  GTI_bil_56 = 0
 (57)  GTI_bil_57 = 0
 (58)  GTI_bil_58 = 0
 (59)  GTI_bil_59 = 0
 (60)  GTI_bil_60 = 0
 (61)  GTI_bil_61 = 0
 (62)  GTI_bil_62 = 0
 (63)  GTI_bil_63 = 0
 (64)  GTI_bil_64 = 0
 (65)  GTI_bil_65 = 0
 (66)  GTI_bil_66 = 0
 (67)  GTI_bil_67 = 0
 (68)  GTI_bil0_uni1 = 0
 (69)  GTI_bil0_uni2 = 0
 (70)  GTI_bil0_uni3 = 0
 (71)  GTI_bil0_uni4 = 0
 (72)  GTI_bil0_uni5 = 0
 (73)  GTI_bil0_uni6 = 0
 (74)  GTI_bil0_uni7 = 0
 (75)  GTI_bil0_uni8 = 0
 (76)  GTI_bil0_uni9 = 0
 (77)  GTI_bil0_uni10 = 0
 (78)  GTI_bil0_uni11 = 0
 (79)  GTI_bil0_uni12 = 0
 (80)  GTI_bil0_uni13 = 0
 (81)  GTI_bil0_uni14 = 0
 (82)  GTI_bil0_uni15 = 0
 (83)  GTI_bil0_uni16 = 0
 (84)  GTI_bil0_uni17 = 0
 (85)  GTI_bil0_uni18 = 0
 (86)  GTI_bil0_uni19 = 0
 (87)  GTI_bil0_uni20 = 0
 (88)  GTI_bil0_uni21 = 0
 (89)  GTI_bil0_uni22 = 0
 (90)  GTI_bil0_uni23 = 0
 (91)  GTI_bil0_uni24 = 0
 (92)  GTI_bil0_uni25 = 0
 (93)  GTI_bil0_uni26 = 0
 (94)  GTI_bil0_uni27 = 0
 (95)  GTI_bil0_uni28 = 0
 (96)  GTI_bil0_uni29 = 0
 (97)  GTI_bil0_uni30 = 0
 (98)  GTI_bil0_uni31 = 0
 (99)  GTI_bil0_uni32 = 0
 (100)  GTI_bil0_uni33 = 0
 (101)  GTI_bil0_uni34 = 0
 (102)  GTI_bil0_uni35 = 0
 (103)  GTI_bil0_uni36 = 0
 (104)  GTI_bil0_uni37 = 0
 (105)  GTI_bil0_uni38 = 0
 (106)  GTI_bil0_uni39 = 0
 (107)  GTI_bil0_uni40 = 0
 (108)  GTI_bil0_uni41 = 0
 (109)  GTI_bil0_uni42 = 0
 (110)  GTI_bil0_uni43 = 0
 (111)  GTI_bil0_uni44 = 0
 (112)  GTI_bil0_uni45 = 0
 (113)  GTI_bil0_uni46 = 0
 (114)  GTI_bil0_uni47 = 0
 (115)  GTI_bil0_uni48 = 0
 (116)  GTI_bil0_uni49 = 0
 (117)  GTI_bil0_uni50 = 0
 (118)  GTI_bil0_uni51 = 0
 (119)  GTI_bil0_uni52 = 0
 (120)  GTI_bil0_uni53 = 0
 (121)  GTI_bil0_uni54 = 0
 (122)  GTI_bil0_uni55 = 0
 (123)  GTI_bil0_uni56 = 0
 (124)  GTI_bil0_uni57 = 0
 (125)  GTI_bil0_uni58 = 0
 (126)  GTI_bil0_uni59 = 0
 (127)  GTI_bil0_uni60 = 0
 (128)  GTI_bil0_uni61 = 0
 (129)  GTI_bil0_uni62 = 0
 (130)  GTI_bil0_uni63 = 0
 (131)  GTI_bil0_uni64 = 0
 (132)  GTI_bil0_uni65 = 0
 (133)  GTI_bil0_uni66 = 0
 (134)  GTI_bil0_uni67 = 0

       F(134, 21569) =   40.77
            Prob > F =    0.0000

. //originXyear, destination (multilateral resistance Ortega and Peri 2013)
. regxfe fwd_log_mig $gallup d_log_gdp d_log_pop  if $sample1, fe(iso3n_oXyear iso3n_d) cluster(pair_id)
Transforming the data
........
Estimating redundant parameters
.
Number of redundant parameters: 1

                                                 Number of obs      =    21855
                                                 F_xb (    5, 20729)=   87.076
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.7595
                                                 R2-Within          =   0.0800
                                                 # redundant FE     =        1
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
log_wmigdemand |   .0910835   .0065242    13.96   0.000     .0782955    .1038715
  log_wmigplan |   .0355365    .010381     3.42   0.001     .0151888    .0558841
  log_wmigprep |   .0704804   .0136857     5.15   0.000     .0436555    .0973054
     d_log_gdp |   1.624659   .2578411     6.30   0.000     1.119271    2.130048
     d_log_pop |  -3.816498   .4555442    -8.38   0.000      -4.7094   -2.923596
         _cons |    3.16402   1.624467     1.95   0.051    -.0200615    6.348102
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_Table6.xls", append label excel tex ctitle("Benchmark, OP")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.xls
dir : seeout

. regxfe fwd_log_mig $gallup d_log_gdp d_log_pop $gallup $bil_GTI_spec if $sample1, fe(iso3n_oXyear iso3n_d) cluster(pair_id)
Transforming the data
.........
Estimating redundant parameters
.
Number of redundant parameters: 1

                                                 Number of obs      =    21855
                                                 F_xb (  139, 20595)=   44.150
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.8300
                                                 R2-Within          =   0.3496
                                                 # redundant FE     =        1
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
log_wmigdemand |   .0786305   .0051552    15.25   0.000      .068526     .088735
  log_wmigplan |   .0386021   .0086887     4.44   0.000     .0215716    .0556326
  log_wmigprep |   .0426023   .0109229     3.90   0.000     .0211925    .0640121
     d_log_gdp |   .8099318   .2458254     3.29   0.001     .3280947    1.291769
     d_log_pop |  -.7417089   .4167672    -1.78   0.075    -1.558606    .0751879
log_wmigdemand |          0  (omitted)
  log_wmigplan |          0  (omitted)
  log_wmigprep |          0  (omitted)
     GTI_bil_0 |   .0890543   .0081141    10.98   0.000       .07315    .1049586
     GTI_bil_1 |   .1157196   .0780465     1.48   0.138    -.0372578    .2686969
     GTI_bil_2 |  -.0004994   .0183246    -0.03   0.978     -.036417    .0354181
     GTI_bil_3 |  -.0178881   .0268341    -0.67   0.505    -.0704851    .0347089
     GTI_bil_4 |   .1170877   .0595065     1.97   0.049     .0004502    .2337252
     GTI_bil_5 |  -.0185622   .0097906    -1.90   0.058    -.0377525    .0006282
     GTI_bil_6 |    .014572   .0060094     2.42   0.015      .002793     .026351
     GTI_bil_7 |   .0237063   .0120795     1.96   0.050     .0000296     .047383
     GTI_bil_8 |   .0402576   .0135892     2.96   0.003     .0136217    .0668934
     GTI_bil_9 |    .007455   .0363323     0.21   0.837    -.0637591    .0786692
    GTI_bil_10 |   .0163687   .0036544     4.48   0.000     .0092057    .0235317
    GTI_bil_12 |   .0148603   .0146553     1.01   0.311    -.0138654    .0435859
    GTI_bil_13 |   .0117504   .0182123     0.65   0.519    -.0239472     .047448
    GTI_bil_14 |  -.0112016   .0092511    -1.21   0.226    -.0293345    .0069312
    GTI_bil_15 |  -.0299018   .0177295    -1.69   0.092    -.0646531    .0048495
    GTI_bil_16 |   .0000377   .0116039     0.00   0.997    -.0227068    .0227822
    GTI_bil_17 |   .0060634   .0123103     0.49   0.622    -.0180658    .0301925
    GTI_bil_18 |  -.0029988   .0070316    -0.43   0.670    -.0167813    .0107838
    GTI_bil_19 |  -.0308379   .0155375    -1.98   0.047    -.0612926   -.0003832
    GTI_bil_20 |  -.0120984   .0166949    -0.72   0.469    -.0448218     .020625
    GTI_bil_21 |   .0344748   .0221268     1.56   0.119    -.0088954     .077845
    GTI_bil_22 |   .0447065   .0148455     3.01   0.003      .015608    .0738049
    GTI_bil_23 |  -.0365313   .0151667    -2.41   0.016    -.0662592   -.0068034
    GTI_bil_24 |  -.0484495   .0211762    -2.29   0.022    -.0899566   -.0069424
    GTI_bil_25 |  -.0008647   .0069805    -0.12   0.901    -.0145471    .0128178
    GTI_bil_26 |   .0041668   .0219279     0.19   0.849    -.0388136    .0471472
    GTI_bil_27 |  -.0452555   .0157591    -2.87   0.004    -.0761446   -.0143663
    GTI_bil_28 |   .0432643   .0349601     1.24   0.216    -.0252602    .1117888
    GTI_bil_29 |   .0041299   .0098277     0.42   0.674    -.0151331    .0233929
    GTI_bil_30 |  -.0365579   .0183313    -1.99   0.046    -.0724888    -.000627
    GTI_bil_31 |  -.1796917   .0398094    -4.51   0.000    -.2577213   -.1016622
    GTI_bil_32 |  -.0012324   .0093736    -0.13   0.895    -.0196054    .0171406
    GTI_bil_33 |  -.0298854   .0701318    -0.43   0.670    -.1673493    .1075785
    GTI_bil_34 |   .1800502   .0504582     3.57   0.000     .0811482    .2789522
    GTI_bil_35 |    -.03846   .0720459    -0.53   0.593    -.1796756    .1027556
    GTI_bil_36 |    .014167   .0044061     3.22   0.001     .0055306    .0228034
    GTI_bil_37 |  -.0475724   .0171138    -2.78   0.005    -.0811168   -.0140281
    GTI_bil_38 |  -.0272774   .0144919    -1.88   0.060    -.0556827    .0011278
    GTI_bil_39 |  -.0135419   .0096998    -1.40   0.163    -.0325543    .0054706
    GTI_bil_40 |   .0082356   .0181338     0.45   0.650    -.0273081    .0437792
    GTI_bil_41 |   .0202368    .014043     1.44   0.150    -.0072887    .0477622
    GTI_bil_42 |  -.1311574   .1953968    -0.67   0.502    -.5141507    .2518358
    GTI_bil_43 |  -.1007321   .0258134    -3.90   0.000    -.1513283   -.0501358
    GTI_bil_44 |   .0021731   .0082954     0.26   0.793    -.0140865    .0184327
    GTI_bil_45 |  -.0591871   .0173319    -3.41   0.001     -.093159   -.0252153
    GTI_bil_46 |   .0065349   .0086437     0.76   0.450    -.0104074    .0234773
    GTI_bil_47 |   -.008692   .0098871    -0.88   0.379    -.0280714    .0106874
    GTI_bil_48 |  -.0114723   .0171062    -0.67   0.502    -.0450018    .0220571
    GTI_bil_49 |   .0067464   .0120143     0.56   0.574    -.0168025    .0302954
    GTI_bil_50 |   .0421908   .0126958     3.32   0.001      .017306    .0670756
    GTI_bil_51 |  -.0060874   .0148349    -0.41   0.682     -.035165    .0229902
    GTI_bil_52 |   .0433082    .005171     8.38   0.000     .0331726    .0534437
    GTI_bil_53 |   .0062404   .0149346     0.42   0.676    -.0230326    .0355135
    GTI_bil_54 |  -.0415265   .0151599    -2.74   0.006    -.0712411   -.0118119
    GTI_bil_55 |   .0066292   .0092466     0.72   0.473    -.0114948    .0247532
    GTI_bil_56 |  -.0104135    .022602    -0.46   0.645    -.0547152    .0338882
    GTI_bil_57 |   .0099196   .0140199     0.71   0.479    -.0175605    .0373997
    GTI_bil_58 |   -.019468   .0127601    -1.53   0.127    -.0444788    .0055429
    GTI_bil_59 |   .0124592   .0121429     1.03   0.305    -.0113418    .0362602
    GTI_bil_60 |  -.0820339   .0430986    -1.90   0.057    -.1665107    .0024429
    GTI_bil_61 |   .0358996   .0085136     4.22   0.000     .0192122     .052587
    GTI_bil_62 |   .0128773   .0092642     1.39   0.165    -.0052812    .0310358
    GTI_bil_63 |  -.0271581   .0164366    -1.65   0.098    -.0593751    .0050588
    GTI_bil_64 |  -.0264742    .010274    -2.58   0.010    -.0466121   -.0063364
    GTI_bil_65 |   -.047353    .018601    -2.55   0.011    -.0838125   -.0108935
    GTI_bil_66 |   .0083761   .0098265     0.85   0.394    -.0108846    .0276367
    GTI_bil_67 |   .0382643   .0253683     1.51   0.131    -.0114595    .0879882
 GTI_bil0_uni1 |   .0002994   .0001678     1.78   0.074    -.0000296    .0006283
 GTI_bil0_uni2 |  -.0000938   .0001297    -0.72   0.470     -.000348    .0001604
 GTI_bil0_uni3 |   .0000391   .0001635     0.24   0.811    -.0002814    .0003597
 GTI_bil0_uni4 |  -.0000997   .0002505    -0.40   0.691    -.0005907    .0003913
 GTI_bil0_uni5 |  -.0001031   .0001271    -0.81   0.417    -.0003521     .000146
 GTI_bil0_uni6 |  -.0000846   .0001373    -0.62   0.538    -.0003538    .0001846
 GTI_bil0_uni7 |  -.0001385   .0001501    -0.92   0.356    -.0004327    .0001558
 GTI_bil0_uni8 |  -.0002419   .0001698    -1.42   0.154    -.0005746    .0000909
 GTI_bil0_uni9 |   .0000806   .0001421     0.57   0.571     -.000198    .0003591
GTI_bil0_uni10 |  -.0001848   .0001379    -1.34   0.180    -.0004551    .0000855
GTI_bil0_uni11 |   .0002559   .0001472     1.74   0.082    -.0000326    .0005445
GTI_bil0_uni12 |  -.0002146   .0001635    -1.31   0.189    -.0005351    .0001058
GTI_bil0_uni13 |  -.0001436   .0001612    -0.89   0.373    -.0004596    .0001724
GTI_bil0_uni14 |  -.0000785   .0001453    -0.54   0.589    -.0003632    .0002062
GTI_bil0_uni15 |   -.000209   .0001327    -1.57   0.115    -.0004691    .0000512
GTI_bil0_uni16 |   .0002499   .0001362     1.83   0.067    -.0000171     .000517
GTI_bil0_uni17 |   .0003905   .0001619     2.41   0.016     .0000731    .0007079
GTI_bil0_uni18 |  -.0000729    .000155    -0.47   0.638    -.0003767    .0002309
GTI_bil0_uni19 |   .0005304   .0001673     3.17   0.002     .0002026    .0008582
GTI_bil0_uni20 |  -.0002452   .0001729    -1.42   0.156    -.0005842    .0000938
GTI_bil0_uni21 |  -.0002245   .0001693    -1.33   0.185    -.0005562    .0001073
GTI_bil0_uni22 |   .0003859   .0001407     2.74   0.006     .0001102    .0006616
GTI_bil0_uni23 |   -.000179   .0001315    -1.36   0.174    -.0004368    .0000788
GTI_bil0_uni24 |   .0002441   .0001542     1.58   0.113    -.0000582    .0005464
GTI_bil0_uni25 |   .0000588   .0001191     0.49   0.621    -.0001746    .0002922
GTI_bil0_uni26 |   .0002099   .0001451     1.45   0.148    -.0000745    .0004944
GTI_bil0_uni27 |   .0000529   .0001468     0.36   0.718    -.0002348    .0003406
GTI_bil0_uni28 |   .0001111   .0002324     0.48   0.632    -.0003443    .0005666
GTI_bil0_uni29 |   .0003512    .000163     2.15   0.031     .0000316    .0006707
GTI_bil0_uni30 |   .0000551   .0001635     0.34   0.736    -.0002654    .0003756
GTI_bil0_uni31 |    .000043   .0001265     0.34   0.734    -.0002051     .000291
GTI_bil0_uni32 |  -.0000127   .0001338    -0.09   0.924     -.000275    .0002496
GTI_bil0_uni33 |  -.0003932    .000195    -2.02   0.044    -.0007754    -.000011
GTI_bil0_uni34 |   -.000175   .0001763    -0.99   0.321    -.0005205    .0001706
GTI_bil0_uni35 |   .0000637   .0002031     0.31   0.754    -.0003344    .0004618
GTI_bil0_uni36 |   .0001204   .0001303     0.92   0.356    -.0001351    .0003758
GTI_bil0_uni37 |  -.0004094   .0001563    -2.62   0.009    -.0007157    -.000103
GTI_bil0_uni38 |  -.0001674   .0001407    -1.19   0.234    -.0004431    .0001083
GTI_bil0_uni39 |  -.0002354   .0001498    -1.57   0.116    -.0005291    .0000582
GTI_bil0_uni40 |  -.0005132   .0001565    -3.28   0.001      -.00082   -.0002064
GTI_bil0_uni41 |   .0002316   .0001623     1.43   0.154    -.0000865    .0005498
GTI_bil0_uni42 |   .0001079   .0001797     0.60   0.548    -.0002444    .0004603
GTI_bil0_uni43 |  -.0000893   .0001678    -0.53   0.595    -.0004182    .0002396
GTI_bil0_uni44 |  -.0000708   .0001399    -0.51   0.613    -.0003449    .0002033
GTI_bil0_uni45 |   .0003017   .0001518     1.99   0.047     4.22e-06    .0005991
GTI_bil0_uni46 |    .000061   .0001048     0.58   0.560    -.0001444    .0002664
GTI_bil0_uni47 |   .0003257   .0001584     2.06   0.040     .0000152    .0006363
GTI_bil0_uni48 |   .0002737   .0001417     1.93   0.053    -4.11e-06    .0005515
GTI_bil0_uni49 |   .0001727   .0001511     1.14   0.253    -.0001234    .0004688
GTI_bil0_uni50 |  -.0002852   .0001188    -2.40   0.016    -.0005181   -.0000522
GTI_bil0_uni51 |  -.0001193   .0001195    -1.00   0.318    -.0003536     .000115
GTI_bil0_uni52 |  -.0002156   .0001298    -1.66   0.097      -.00047    .0000389
GTI_bil0_uni53 |  -.0001116   .0001304    -0.86   0.392    -.0003671    .0001439
GTI_bil0_uni54 |  -.0000808   .0001561    -0.52   0.605    -.0003867    .0002251
GTI_bil0_uni55 |  -.0003385   .0001555    -2.18   0.029    -.0006433   -.0000338
GTI_bil0_uni56 |  -.0000171   .0001196    -0.14   0.886    -.0002516    .0002173
GTI_bil0_uni57 |   -.000564   .0001225    -4.60   0.000    -.0008041   -.0003239
GTI_bil0_uni58 |   .0002161   .0001119     1.93   0.054    -3.32e-06    .0004355
GTI_bil0_uni59 |   .0001988   .0001034     1.92   0.055    -3.95e-06    .0004015
GTI_bil0_uni60 |  -.0000359   .0001497    -0.24   0.810    -.0003292    .0002574
GTI_bil0_uni61 |  -.0002196   .0001497    -1.47   0.143    -.0005131    .0000739
GTI_bil0_uni62 |   -.000197   .0001261    -1.56   0.118    -.0004442    .0000502
GTI_bil0_uni63 |  -.0002338   .0001538    -1.52   0.128    -.0005352    .0000676
GTI_bil0_uni64 |   -.000027   .0001255    -0.21   0.830     -.000273    .0002191
GTI_bil0_uni65 |   .0000379   .0001371     0.28   0.782    -.0002308    .0003067
GTI_bil0_uni66 |   .0002189   .0001333     1.64   0.100    -.0000422    .0004801
GTI_bil0_uni67 |  -.0001149   .0001279    -0.90   0.369    -.0003657    .0001358
         _cons |  -.9412464   1.523944    -0.62   0.537    -3.928298    2.045805
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_Table6.xls", append label excel tex ctitle("GTI, OP")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.xls
dir : seeout

. test GTI_bil_0 GTI_bil_1 GTI_bil_2 GTI_bil_3 GTI_bil_4 GTI_bil_5 GTI_bil_6 GTI_bil_7 GTI_bil_8 GTI_bil_9 GTI_bil_10 GTI_bil_12 GTI_bil_13 GTI_bil_14 GTI_bil_15 
> GTI_bil_16 GTI_bil_17 GTI_bil_18 GTI_bil_19 GTI_bil_20 GTI_bil_21 GTI_bil_22 GTI_bil_23 GTI_bil_24 GTI_bil_25 GTI_bil_26 GTI_bil_27 GTI_bil_28 GTI_bil_29 GTI_bi
> l_30 GTI_bil_31 GTI_bil_32 GTI_bil_33 GTI_bil_34 GTI_bil_35 GTI_bil_36 GTI_bil_37 GTI_bil_38 GTI_bil_39 GTI_bil_40 GTI_bil_41 GTI_bil_42 GTI_bil_43 GTI_bil_44 G
> TI_bil_45 GTI_bil_46 GTI_bil_47 GTI_bil_48 GTI_bil_49 GTI_bil_50 GTI_bil_51 GTI_bil_52 GTI_bil_53 GTI_bil_54 GTI_bil_55 GTI_bil_56 GTI_bil_57 GTI_bil_58 GTI_bil
> _59 GTI_bil_60 GTI_bil_61 GTI_bil_62 GTI_bil_63 GTI_bil_64 GTI_bil_65 GTI_bil_66 GTI_bil_67 GTI_bil0_uni1 GTI_bil0_uni2 GTI_bil0_uni3 GTI_bil0_uni4 GTI_bil0_uni
> 5 GTI_bil0_uni6 GTI_bil0_uni7 GTI_bil0_uni8 GTI_bil0_uni9 GTI_bil0_uni10 GTI_bil0_uni11 GTI_bil0_uni12 GTI_bil0_uni13 GTI_bil0_uni14 GTI_bil0_uni15 GTI_bil0_uni
> 16 GTI_bil0_uni17 GTI_bil0_uni18 GTI_bil0_uni19 GTI_bil0_uni20 GTI_bil0_uni21 GTI_bil0_uni22 GTI_bil0_uni23 GTI_bil0_uni24 GTI_bil0_uni25 GTI_bil0_uni26 GTI_bil
> 0_uni27 GTI_bil0_uni28 GTI_bil0_uni29 GTI_bil0_uni30 GTI_bil0_uni31 GTI_bil0_uni32 GTI_bil0_uni33 GTI_bil0_uni34 GTI_bil0_uni35 GTI_bil0_uni36 GTI_bil0_uni37 GT
> I_bil0_uni38 GTI_bil0_uni39 GTI_bil0_uni40 GTI_bil0_uni41 GTI_bil0_uni42 GTI_bil0_uni43 GTI_bil0_uni44 GTI_bil0_uni45 GTI_bil0_uni46 GTI_bil0_uni47 GTI_bil0_uni
> 48 GTI_bil0_uni49 GTI_bil0_uni50 GTI_bil0_uni51 GTI_bil0_uni52 GTI_bil0_uni53 GTI_bil0_uni54 GTI_bil0_uni55 GTI_bil0_uni56 GTI_bil0_uni57 GTI_bil0_uni58 GTI_bil
> 0_uni59 GTI_bil0_uni60 GTI_bil0_uni61 GTI_bil0_uni62 GTI_bil0_uni63 GTI_bil0_uni64 GTI_bil0_uni65 GTI_bil0_uni66 GTI_bil0_uni67                                 

 ( 1)  GTI_bil_0 = 0
 ( 2)  GTI_bil_1 = 0
 ( 3)  GTI_bil_2 = 0
 ( 4)  GTI_bil_3 = 0
 ( 5)  GTI_bil_4 = 0
 ( 6)  GTI_bil_5 = 0
 ( 7)  GTI_bil_6 = 0
 ( 8)  GTI_bil_7 = 0
 ( 9)  GTI_bil_8 = 0
 (10)  GTI_bil_9 = 0
 (11)  GTI_bil_10 = 0
 (12)  GTI_bil_12 = 0
 (13)  GTI_bil_13 = 0
 (14)  GTI_bil_14 = 0
 (15)  GTI_bil_15 = 0
 (16)  GTI_bil_16 = 0
 (17)  GTI_bil_17 = 0
 (18)  GTI_bil_18 = 0
 (19)  GTI_bil_19 = 0
 (20)  GTI_bil_20 = 0
 (21)  GTI_bil_21 = 0
 (22)  GTI_bil_22 = 0
 (23)  GTI_bil_23 = 0
 (24)  GTI_bil_24 = 0
 (25)  GTI_bil_25 = 0
 (26)  GTI_bil_26 = 0
 (27)  GTI_bil_27 = 0
 (28)  GTI_bil_28 = 0
 (29)  GTI_bil_29 = 0
 (30)  GTI_bil_30 = 0
 (31)  GTI_bil_31 = 0
 (32)  GTI_bil_32 = 0
 (33)  GTI_bil_33 = 0
 (34)  GTI_bil_34 = 0
 (35)  GTI_bil_35 = 0
 (36)  GTI_bil_36 = 0
 (37)  GTI_bil_37 = 0
 (38)  GTI_bil_38 = 0
 (39)  GTI_bil_39 = 0
 (40)  GTI_bil_40 = 0
 (41)  GTI_bil_41 = 0
 (42)  GTI_bil_42 = 0
 (43)  GTI_bil_43 = 0
 (44)  GTI_bil_44 = 0
 (45)  GTI_bil_45 = 0
 (46)  GTI_bil_46 = 0
 (47)  GTI_bil_47 = 0
 (48)  GTI_bil_48 = 0
 (49)  GTI_bil_49 = 0
 (50)  GTI_bil_50 = 0
 (51)  GTI_bil_51 = 0
 (52)  GTI_bil_52 = 0
 (53)  GTI_bil_53 = 0
 (54)  GTI_bil_54 = 0
 (55)  GTI_bil_55 = 0
 (56)  GTI_bil_56 = 0
 (57)  GTI_bil_57 = 0
 (58)  GTI_bil_58 = 0
 (59)  GTI_bil_59 = 0
 (60)  GTI_bil_60 = 0
 (61)  GTI_bil_61 = 0
 (62)  GTI_bil_62 = 0
 (63)  GTI_bil_63 = 0
 (64)  GTI_bil_64 = 0
 (65)  GTI_bil_65 = 0
 (66)  GTI_bil_66 = 0
 (67)  GTI_bil_67 = 0
 (68)  GTI_bil0_uni1 = 0
 (69)  GTI_bil0_uni2 = 0
 (70)  GTI_bil0_uni3 = 0
 (71)  GTI_bil0_uni4 = 0
 (72)  GTI_bil0_uni5 = 0
 (73)  GTI_bil0_uni6 = 0
 (74)  GTI_bil0_uni7 = 0
 (75)  GTI_bil0_uni8 = 0
 (76)  GTI_bil0_uni9 = 0
 (77)  GTI_bil0_uni10 = 0
 (78)  GTI_bil0_uni11 = 0
 (79)  GTI_bil0_uni12 = 0
 (80)  GTI_bil0_uni13 = 0
 (81)  GTI_bil0_uni14 = 0
 (82)  GTI_bil0_uni15 = 0
 (83)  GTI_bil0_uni16 = 0
 (84)  GTI_bil0_uni17 = 0
 (85)  GTI_bil0_uni18 = 0
 (86)  GTI_bil0_uni19 = 0
 (87)  GTI_bil0_uni20 = 0
 (88)  GTI_bil0_uni21 = 0
 (89)  GTI_bil0_uni22 = 0
 (90)  GTI_bil0_uni23 = 0
 (91)  GTI_bil0_uni24 = 0
 (92)  GTI_bil0_uni25 = 0
 (93)  GTI_bil0_uni26 = 0
 (94)  GTI_bil0_uni27 = 0
 (95)  GTI_bil0_uni28 = 0
 (96)  GTI_bil0_uni29 = 0
 (97)  GTI_bil0_uni30 = 0
 (98)  GTI_bil0_uni31 = 0
 (99)  GTI_bil0_uni32 = 0
 (100)  GTI_bil0_uni33 = 0
 (101)  GTI_bil0_uni34 = 0
 (102)  GTI_bil0_uni35 = 0
 (103)  GTI_bil0_uni36 = 0
 (104)  GTI_bil0_uni37 = 0
 (105)  GTI_bil0_uni38 = 0
 (106)  GTI_bil0_uni39 = 0
 (107)  GTI_bil0_uni40 = 0
 (108)  GTI_bil0_uni41 = 0
 (109)  GTI_bil0_uni42 = 0
 (110)  GTI_bil0_uni43 = 0
 (111)  GTI_bil0_uni44 = 0
 (112)  GTI_bil0_uni45 = 0
 (113)  GTI_bil0_uni46 = 0
 (114)  GTI_bil0_uni47 = 0
 (115)  GTI_bil0_uni48 = 0
 (116)  GTI_bil0_uni49 = 0
 (117)  GTI_bil0_uni50 = 0
 (118)  GTI_bil0_uni51 = 0
 (119)  GTI_bil0_uni52 = 0
 (120)  GTI_bil0_uni53 = 0
 (121)  GTI_bil0_uni54 = 0
 (122)  GTI_bil0_uni55 = 0
 (123)  GTI_bil0_uni56 = 0
 (124)  GTI_bil0_uni57 = 0
 (125)  GTI_bil0_uni58 = 0
 (126)  GTI_bil0_uni59 = 0
 (127)  GTI_bil0_uni60 = 0
 (128)  GTI_bil0_uni61 = 0
 (129)  GTI_bil0_uni62 = 0
 (130)  GTI_bil0_uni63 = 0
 (131)  GTI_bil0_uni64 = 0
 (132)  GTI_bil0_uni65 = 0
 (133)  GTI_bil0_uni66 = 0
 (134)  GTI_bil0_uni67 = 0

       F(134, 20595) =   39.79
            Prob > F =    0.0000

. 
. //originXyear, destinationXyear (trade spec)
. regxfe fwd_log_mig $gallup d_log_gdp d_log_pop  if $sample1, fe(iso3n_oXyear iso3n_dXyear) cluster(pair_id)
Transforming the data
........
Estimating redundant parameters
.
Number of redundant parameters: 11

                                                 Number of obs      =    21855
                                                 F_xb (    3, 20425)=  152.421
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.7693
                                                 R2-Within          =   0.0984
                                                 # redundant FE     =       11
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
log_wmigdemand |   .1185711   .0072158    16.43   0.000     .1044277    .1327146
  log_wmigplan |    .048397   .0104024     4.65   0.000     .0280074    .0687866
  log_wmigprep |   .0808246   .0134935     5.99   0.000     .0543762     .107273
         _cons |   2.822808   .0305673    92.35   0.000     2.762893    2.882722
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_Table6.xls", append label excel tex ctitle("Benchmark, origin/destinationXyear")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.xls
dir : seeout

. regxfe fwd_log_mig $gallup d_log_gdp d_log_pop $gallup $bil_GTI_spec if $sample1, fe(iso3n_oXyear iso3n_dXyear) cluster(pair_id)
Transforming the data
.........
Estimating redundant parameters
.
Number of redundant parameters: 11

                                                 Number of obs      =    21855
                                                 F_xb (  137, 20291)=   44.769
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.8351
                                                 R2-Within          =   0.3554
                                                 # redundant FE     =       11
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
log_wmigdemand |   .0838396   .0056642    14.80   0.000     .0727374    .0949419
  log_wmigplan |    .040902   .0089202     4.59   0.000     .0234176    .0583863
  log_wmigprep |   .0440892   .0110218     4.00   0.000     .0224855    .0656928
log_wmigdemand |          0  (omitted)
  log_wmigplan |          0  (omitted)
  log_wmigprep |          0  (omitted)
     GTI_bil_0 |   .0915932    .008213    11.15   0.000      .075495    .1076914
     GTI_bil_1 |    .112308   .0805628     1.39   0.163    -.0456015    .2702175
     GTI_bil_2 |   .0011915   .0184128     0.06   0.948     -.034899     .037282
     GTI_bil_3 |  -.0163512   .0271195    -0.60   0.547    -.0695077    .0368053
     GTI_bil_4 |   .1207013   .0639657     1.89   0.059    -.0046766    .2460792
     GTI_bil_5 |  -.0172494   .0099129    -1.74   0.082    -.0366794    .0021806
     GTI_bil_6 |   .0153925     .00608     2.53   0.011     .0034752    .0273097
     GTI_bil_7 |   .0230871   .0122642     1.88   0.060    -.0009517    .0471259
     GTI_bil_8 |   .0383846   .0141887     2.71   0.007     .0105737    .0661956
     GTI_bil_9 |   .0016053    .037355     0.04   0.966    -.0716135     .074824
    GTI_bil_10 |   .0167994   .0037063     4.53   0.000     .0095347    .0240641
    GTI_bil_12 |   .0148505   .0142296     1.04   0.297    -.0130406    .0427416
    GTI_bil_13 |   .0167875   .0181162     0.93   0.354    -.0187217    .0522966
    GTI_bil_14 |  -.0104446   .0093098    -1.12   0.262    -.0286925    .0078033
    GTI_bil_15 |  -.0298074   .0181237    -1.64   0.100    -.0653313    .0057165
    GTI_bil_16 |  -.0026959   .0116386    -0.23   0.817    -.0255084    .0201167
    GTI_bil_17 |   .0073314   .0126754     0.58   0.563    -.0175135    .0321762
    GTI_bil_18 |  -.0011009   .0072566    -0.15   0.879    -.0153245    .0131227
    GTI_bil_19 |  -.0320397   .0152977    -2.09   0.036    -.0620245    -.002055
    GTI_bil_20 |  -.0108862   .0171027    -0.64   0.524    -.0444089    .0226364
    GTI_bil_21 |   .0387215   .0219723     1.76   0.078    -.0043461     .081789
    GTI_bil_22 |   .0437511   .0147866     2.96   0.003     .0147681     .072734
    GTI_bil_23 |  -.0381097   .0151067    -2.52   0.012      -.06772   -.0084994
    GTI_bil_24 |  -.0475368   .0214014    -2.22   0.026    -.0894852   -.0055883
    GTI_bil_25 |  -.0032136   .0068884    -0.47   0.641    -.0167153    .0102881
    GTI_bil_26 |   .0132385   .0224921     0.59   0.556    -.0308479    .0573248
    GTI_bil_27 |  -.0417163   .0161914    -2.58   0.010    -.0734527   -.0099799
    GTI_bil_28 |    .047852   .0335865     1.42   0.154    -.0179802    .1136841
    GTI_bil_29 |    .003748   .0098755     0.38   0.704    -.0156087    .0231047
    GTI_bil_30 |  -.0416019   .0182565    -2.28   0.023    -.0773862   -.0058177
    GTI_bil_31 |  -.1747173   .0394094    -4.43   0.000    -.2519628   -.0974717
    GTI_bil_32 |  -.0008054   .0093608    -0.09   0.931    -.0191534    .0175425
    GTI_bil_33 |  -.0443737   .0694597    -0.64   0.523    -.1805204     .091773
    GTI_bil_34 |   .1839115    .051577     3.57   0.000     .0828164    .2850066
    GTI_bil_35 |  -.0394401   .0711325    -0.55   0.579    -.1788656    .0999853
    GTI_bil_36 |   .0135563   .0043917     3.09   0.002     .0049482    .0221645
    GTI_bil_37 |  -.0463304   .0173677    -2.67   0.008    -.0803725   -.0122883
    GTI_bil_38 |  -.0268015   .0147253    -1.82   0.069    -.0556644    .0020613
    GTI_bil_39 |  -.0128325   .0097051    -1.32   0.186    -.0318552    .0061902
    GTI_bil_40 |   .0066488   .0182937     0.36   0.716    -.0292083    .0425058
    GTI_bil_41 |   .0181706   .0140584     1.29   0.196     -.009385    .0457262
    GTI_bil_42 |  -.1103013   .1927877    -0.57   0.567    -.4881808    .2675782
    GTI_bil_43 |  -.1032256     .02569    -4.02   0.000      -.15358   -.0528712
    GTI_bil_44 |   .0040971   .0084011     0.49   0.626    -.0123698    .0205639
    GTI_bil_45 |   -.062726   .0173443    -3.62   0.000    -.0967223   -.0287298
    GTI_bil_46 |   .0053156   .0085425     0.62   0.534    -.0114284    .0220595
    GTI_bil_47 |  -.0090258   .0101046    -0.89   0.372    -.0288316      .01078
    GTI_bil_48 |  -.0129807   .0168279    -0.77   0.440    -.0459648    .0200033
    GTI_bil_49 |   .0057921    .012052     0.48   0.631    -.0178307     .029415
    GTI_bil_50 |   .0456131   .0131138     3.48   0.001      .019909    .0713172
    GTI_bil_51 |  -.0025753   .0147885    -0.17   0.862    -.0315619    .0264114
    GTI_bil_52 |   .0428348   .0052214     8.20   0.000     .0326006    .0530691
    GTI_bil_53 |   .0039996   .0147443     0.27   0.786    -.0249003    .0328996
    GTI_bil_54 |  -.0401566   .0153522    -2.62   0.009    -.0702481    -.010065
    GTI_bil_55 |   .0074033   .0092872     0.80   0.425    -.0108003    .0256068
    GTI_bil_56 |  -.0131153   .0234019    -0.56   0.575    -.0589849    .0327544
    GTI_bil_57 |   .0081375   .0140949     0.58   0.564    -.0194897    .0357647
    GTI_bil_58 |  -.0212979   .0131095    -1.62   0.104    -.0469936    .0043978
    GTI_bil_59 |   .0123325   .0124455     0.99   0.322    -.0120617    .0367268
    GTI_bil_60 |  -.0782143   .0428177    -1.83   0.068    -.1621404    .0057118
    GTI_bil_61 |   .0335366   .0084457     3.97   0.000     .0169822    .0500909
    GTI_bil_62 |   .0137962    .009397     1.47   0.142    -.0046228    .0322151
    GTI_bil_63 |  -.0279109   .0170136    -1.64   0.101     -.061259    .0054371
    GTI_bil_64 |  -.0258303   .0104901    -2.46   0.014    -.0463918   -.0052687
    GTI_bil_65 |  -.0435326   .0187391    -2.32   0.020    -.0802628   -.0068024
    GTI_bil_66 |   .0074997   .0098514     0.76   0.446    -.0118099    .0268092
    GTI_bil_67 |   .0375908   .0247965     1.52   0.130    -.0110124    .0861941
 GTI_bil0_uni1 |   .0002809   .0001683     1.67   0.095    -.0000489    .0006107
 GTI_bil0_uni2 |  -.0001192   .0001301    -0.92   0.360    -.0003743    .0001359
 GTI_bil0_uni3 |   .0000375   .0001622     0.23   0.817    -.0002803    .0003553
 GTI_bil0_uni4 |  -.0001235   .0002466    -0.50   0.617    -.0006069      .00036
 GTI_bil0_uni5 |  -.0001235   .0001276    -0.97   0.333    -.0003735    .0001265
 GTI_bil0_uni6 |  -.0000517   .0001377    -0.38   0.707    -.0003216    .0002181
 GTI_bil0_uni7 |  -.0001285   .0001473    -0.87   0.383    -.0004173    .0001602
 GTI_bil0_uni8 |  -.0002784   .0001675    -1.66   0.097    -.0006068      .00005
 GTI_bil0_uni9 |   .0001089   .0001429     0.76   0.446    -.0001713     .000389
GTI_bil0_uni10 |  -.0001924    .000138    -1.39   0.163    -.0004629    .0000782
GTI_bil0_uni11 |   .0002357   .0001489     1.58   0.114    -.0000562    .0005277
GTI_bil0_uni12 |  -.0002223   .0001617    -1.37   0.169    -.0005392    .0000946
GTI_bil0_uni13 |  -.0000951   .0001614    -0.59   0.556    -.0004114    .0002213
GTI_bil0_uni14 |   -.000058   .0001459    -0.40   0.691    -.0003441    .0002281
GTI_bil0_uni15 |  -.0002237   .0001334    -1.68   0.094    -.0004852    .0000379
GTI_bil0_uni16 |   .0002162   .0001373     1.57   0.115     -.000053    .0004854
GTI_bil0_uni17 |   .0004128   .0001605     2.57   0.010     .0000983    .0007273
GTI_bil0_uni18 |  -.0000689   .0001544    -0.45   0.655    -.0003715    .0002336
GTI_bil0_uni19 |   .0005677   .0001643     3.46   0.001     .0002457    .0008898
GTI_bil0_uni20 |  -.0002512   .0001715    -1.46   0.143    -.0005874     .000085
GTI_bil0_uni21 |   -.000235   .0001691    -1.39   0.165    -.0005665    .0000965
GTI_bil0_uni22 |   .0003659   .0001421     2.57   0.010     .0000873    .0006445
GTI_bil0_uni23 |  -.0002046   .0001326    -1.54   0.123    -.0004646    .0000553
GTI_bil0_uni24 |   .0002004   .0001554     1.29   0.197    -.0001042    .0005049
GTI_bil0_uni25 |   .0000564   .0001199     0.47   0.638    -.0001786    .0002913
GTI_bil0_uni26 |   .0001989   .0001461     1.36   0.173    -.0000875    .0004853
GTI_bil0_uni27 |   .0000463   .0001464     0.32   0.752    -.0002406    .0003333
GTI_bil0_uni28 |   .0001665   .0002351     0.71   0.479    -.0002944    .0006274
GTI_bil0_uni29 |   .0002972   .0001651     1.80   0.072    -.0000264    .0006208
GTI_bil0_uni30 |   .0000663   .0001649     0.40   0.688    -.0002569    .0003894
GTI_bil0_uni31 |   .0000501   .0001243     0.40   0.687    -.0001935    .0002937
GTI_bil0_uni32 |   8.42e-06   .0001339     0.06   0.950     -.000254    .0002709
GTI_bil0_uni33 |  -.0003673   .0001937    -1.90   0.058    -.0007469    .0000123
GTI_bil0_uni34 |  -.0002147   .0001757    -1.22   0.222     -.000559    .0001296
GTI_bil0_uni35 |   .0000294   .0002008     0.15   0.884    -.0003641    .0004229
GTI_bil0_uni36 |   .0001126   .0001316     0.86   0.392    -.0001453    .0003705
GTI_bil0_uni37 |  -.0003791   .0001552    -2.44   0.015    -.0006833   -.0000749
GTI_bil0_uni38 |  -.0001691   .0001405    -1.20   0.229    -.0004444    .0001062
GTI_bil0_uni39 |  -.0002635   .0001487    -1.77   0.077     -.000555    .0000281
GTI_bil0_uni40 |  -.0004902   .0001562    -3.14   0.002    -.0007963   -.0001841
GTI_bil0_uni41 |   .0002392   .0001626     1.47   0.141    -.0000795    .0005579
GTI_bil0_uni42 |   .0001022   .0001788     0.57   0.568    -.0002483    .0004528
GTI_bil0_uni43 |  -.0000959   .0001676    -0.57   0.567    -.0004245    .0002327
GTI_bil0_uni44 |  -.0000797   .0001437    -0.55   0.579    -.0003615     .000202
GTI_bil0_uni45 |   .0003296     .00015     2.20   0.028     .0000355    .0006236
GTI_bil0_uni46 |   .0000673   .0001041     0.65   0.517    -.0001366    .0002713
GTI_bil0_uni47 |   .0003289    .000157     2.09   0.036     .0000211    .0006367
GTI_bil0_uni48 |   .0002491   .0001425     1.75   0.081    -.0000303    .0005284
GTI_bil0_uni49 |    .000179   .0001487     1.20   0.229    -.0001124    .0004704
GTI_bil0_uni50 |  -.0002743   .0001183    -2.32   0.020    -.0005062   -.0000423
GTI_bil0_uni51 |  -.0001125    .000119    -0.94   0.345    -.0003458    .0001208
GTI_bil0_uni52 |  -.0002111   .0001305    -1.62   0.106    -.0004668    .0000447
GTI_bil0_uni53 |  -.0001314   .0001308    -1.01   0.315    -.0003877    .0001248
GTI_bil0_uni54 |   -.000113   .0001567    -0.72   0.471    -.0004201     .000194
GTI_bil0_uni55 |  -.0003371   .0001541    -2.19   0.029    -.0006391   -.0000351
GTI_bil0_uni56 |   5.17e-06   .0001193     0.04   0.965    -.0002286    .0002389
GTI_bil0_uni57 |  -.0005548   .0001226    -4.53   0.000    -.0007951   -.0003145
GTI_bil0_uni58 |   .0001567   .0001177     1.33   0.183    -.0000739    .0003873
GTI_bil0_uni59 |   .0001855   .0001038     1.79   0.074    -.0000179     .000389
GTI_bil0_uni60 |  -.0000295   .0001486    -0.20   0.843    -.0003207    .0002617
GTI_bil0_uni61 |  -.0002194   .0001513    -1.45   0.147    -.0005159    .0000771
GTI_bil0_uni62 |  -.0001952   .0001264    -1.54   0.123     -.000443    .0000526
GTI_bil0_uni63 |  -.0001959   .0001547    -1.27   0.205     -.000499    .0001073
GTI_bil0_uni64 |  -3.88e-06   .0001261    -0.03   0.975    -.0002509    .0002432
GTI_bil0_uni65 |   .0000422   .0001365     0.31   0.757    -.0002254    .0003097
GTI_bil0_uni66 |   .0001953   .0001341     1.46   0.145    -.0000675    .0004582
GTI_bil0_uni67 |  -.0001217   .0001269    -0.96   0.338    -.0003705    .0001271
         _cons |   1.958073   .0717956    27.27   0.000     1.817348    2.098799
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_Table6.xls", append label excel tex ctitle("all GTI, origin/destinationXyear")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.xls
dir : seeout

. test GTI_bil_0 GTI_bil_1 GTI_bil_2 GTI_bil_3 GTI_bil_4 GTI_bil_5 GTI_bil_6 GTI_bil_7 GTI_bil_8 GTI_bil_9 GTI_bil_10 GTI_bil_12 GTI_bil_13 GTI_bil_14 GTI_bil_15 
> GTI_bil_16 GTI_bil_17 GTI_bil_18 GTI_bil_19 GTI_bil_20 GTI_bil_21 GTI_bil_22 GTI_bil_23 GTI_bil_24 GTI_bil_25 GTI_bil_26 GTI_bil_27 GTI_bil_28 GTI_bil_29 GTI_bi
> l_30 GTI_bil_31 GTI_bil_32 GTI_bil_33 GTI_bil_34 GTI_bil_35 GTI_bil_36 GTI_bil_37 GTI_bil_38 GTI_bil_39 GTI_bil_40 GTI_bil_41 GTI_bil_42 GTI_bil_43 GTI_bil_44 G
> TI_bil_45 GTI_bil_46 GTI_bil_47 GTI_bil_48 GTI_bil_49 GTI_bil_50 GTI_bil_51 GTI_bil_52 GTI_bil_53 GTI_bil_54 GTI_bil_55 GTI_bil_56 GTI_bil_57 GTI_bil_58 GTI_bil
> _59 GTI_bil_60 GTI_bil_61 GTI_bil_62 GTI_bil_63 GTI_bil_64 GTI_bil_65 GTI_bil_66 GTI_bil_67 GTI_bil0_uni1 GTI_bil0_uni2 GTI_bil0_uni3 GTI_bil0_uni4 GTI_bil0_uni
> 5 GTI_bil0_uni6 GTI_bil0_uni7 GTI_bil0_uni8 GTI_bil0_uni9 GTI_bil0_uni10 GTI_bil0_uni11 GTI_bil0_uni12 GTI_bil0_uni13 GTI_bil0_uni14 GTI_bil0_uni15 GTI_bil0_uni
> 16 GTI_bil0_uni17 GTI_bil0_uni18 GTI_bil0_uni19 GTI_bil0_uni20 GTI_bil0_uni21 GTI_bil0_uni22 GTI_bil0_uni23 GTI_bil0_uni24 GTI_bil0_uni25 GTI_bil0_uni26 GTI_bil
> 0_uni27 GTI_bil0_uni28 GTI_bil0_uni29 GTI_bil0_uni30 GTI_bil0_uni31 GTI_bil0_uni32 GTI_bil0_uni33 GTI_bil0_uni34 GTI_bil0_uni35 GTI_bil0_uni36 GTI_bil0_uni37 GT
> I_bil0_uni38 GTI_bil0_uni39 GTI_bil0_uni40 GTI_bil0_uni41 GTI_bil0_uni42 GTI_bil0_uni43 GTI_bil0_uni44 GTI_bil0_uni45 GTI_bil0_uni46 GTI_bil0_uni47 GTI_bil0_uni
> 48 GTI_bil0_uni49 GTI_bil0_uni50 GTI_bil0_uni51 GTI_bil0_uni52 GTI_bil0_uni53 GTI_bil0_uni54 GTI_bil0_uni55 GTI_bil0_uni56 GTI_bil0_uni57 GTI_bil0_uni58 GTI_bil
> 0_uni59 GTI_bil0_uni60 GTI_bil0_uni61 GTI_bil0_uni62 GTI_bil0_uni63 GTI_bil0_uni64 GTI_bil0_uni65 GTI_bil0_uni66 GTI_bil0_uni67                                 

 ( 1)  GTI_bil_0 = 0
 ( 2)  GTI_bil_1 = 0
 ( 3)  GTI_bil_2 = 0
 ( 4)  GTI_bil_3 = 0
 ( 5)  GTI_bil_4 = 0
 ( 6)  GTI_bil_5 = 0
 ( 7)  GTI_bil_6 = 0
 ( 8)  GTI_bil_7 = 0
 ( 9)  GTI_bil_8 = 0
 (10)  GTI_bil_9 = 0
 (11)  GTI_bil_10 = 0
 (12)  GTI_bil_12 = 0
 (13)  GTI_bil_13 = 0
 (14)  GTI_bil_14 = 0
 (15)  GTI_bil_15 = 0
 (16)  GTI_bil_16 = 0
 (17)  GTI_bil_17 = 0
 (18)  GTI_bil_18 = 0
 (19)  GTI_bil_19 = 0
 (20)  GTI_bil_20 = 0
 (21)  GTI_bil_21 = 0
 (22)  GTI_bil_22 = 0
 (23)  GTI_bil_23 = 0
 (24)  GTI_bil_24 = 0
 (25)  GTI_bil_25 = 0
 (26)  GTI_bil_26 = 0
 (27)  GTI_bil_27 = 0
 (28)  GTI_bil_28 = 0
 (29)  GTI_bil_29 = 0
 (30)  GTI_bil_30 = 0
 (31)  GTI_bil_31 = 0
 (32)  GTI_bil_32 = 0
 (33)  GTI_bil_33 = 0
 (34)  GTI_bil_34 = 0
 (35)  GTI_bil_35 = 0
 (36)  GTI_bil_36 = 0
 (37)  GTI_bil_37 = 0
 (38)  GTI_bil_38 = 0
 (39)  GTI_bil_39 = 0
 (40)  GTI_bil_40 = 0
 (41)  GTI_bil_41 = 0
 (42)  GTI_bil_42 = 0
 (43)  GTI_bil_43 = 0
 (44)  GTI_bil_44 = 0
 (45)  GTI_bil_45 = 0
 (46)  GTI_bil_46 = 0
 (47)  GTI_bil_47 = 0
 (48)  GTI_bil_48 = 0
 (49)  GTI_bil_49 = 0
 (50)  GTI_bil_50 = 0
 (51)  GTI_bil_51 = 0
 (52)  GTI_bil_52 = 0
 (53)  GTI_bil_53 = 0
 (54)  GTI_bil_54 = 0
 (55)  GTI_bil_55 = 0
 (56)  GTI_bil_56 = 0
 (57)  GTI_bil_57 = 0
 (58)  GTI_bil_58 = 0
 (59)  GTI_bil_59 = 0
 (60)  GTI_bil_60 = 0
 (61)  GTI_bil_61 = 0
 (62)  GTI_bil_62 = 0
 (63)  GTI_bil_63 = 0
 (64)  GTI_bil_64 = 0
 (65)  GTI_bil_65 = 0
 (66)  GTI_bil_66 = 0
 (67)  GTI_bil_67 = 0
 (68)  GTI_bil0_uni1 = 0
 (69)  GTI_bil0_uni2 = 0
 (70)  GTI_bil0_uni3 = 0
 (71)  GTI_bil0_uni4 = 0
 (72)  GTI_bil0_uni5 = 0
 (73)  GTI_bil0_uni6 = 0
 (74)  GTI_bil0_uni7 = 0
 (75)  GTI_bil0_uni8 = 0
 (76)  GTI_bil0_uni9 = 0
 (77)  GTI_bil0_uni10 = 0
 (78)  GTI_bil0_uni11 = 0
 (79)  GTI_bil0_uni12 = 0
 (80)  GTI_bil0_uni13 = 0
 (81)  GTI_bil0_uni14 = 0
 (82)  GTI_bil0_uni15 = 0
 (83)  GTI_bil0_uni16 = 0
 (84)  GTI_bil0_uni17 = 0
 (85)  GTI_bil0_uni18 = 0
 (86)  GTI_bil0_uni19 = 0
 (87)  GTI_bil0_uni20 = 0
 (88)  GTI_bil0_uni21 = 0
 (89)  GTI_bil0_uni22 = 0
 (90)  GTI_bil0_uni23 = 0
 (91)  GTI_bil0_uni24 = 0
 (92)  GTI_bil0_uni25 = 0
 (93)  GTI_bil0_uni26 = 0
 (94)  GTI_bil0_uni27 = 0
 (95)  GTI_bil0_uni28 = 0
 (96)  GTI_bil0_uni29 = 0
 (97)  GTI_bil0_uni30 = 0
 (98)  GTI_bil0_uni31 = 0
 (99)  GTI_bil0_uni32 = 0
 (100)  GTI_bil0_uni33 = 0
 (101)  GTI_bil0_uni34 = 0
 (102)  GTI_bil0_uni35 = 0
 (103)  GTI_bil0_uni36 = 0
 (104)  GTI_bil0_uni37 = 0
 (105)  GTI_bil0_uni38 = 0
 (106)  GTI_bil0_uni39 = 0
 (107)  GTI_bil0_uni40 = 0
 (108)  GTI_bil0_uni41 = 0
 (109)  GTI_bil0_uni42 = 0
 (110)  GTI_bil0_uni43 = 0
 (111)  GTI_bil0_uni44 = 0
 (112)  GTI_bil0_uni45 = 0
 (113)  GTI_bil0_uni46 = 0
 (114)  GTI_bil0_uni47 = 0
 (115)  GTI_bil0_uni48 = 0
 (116)  GTI_bil0_uni49 = 0
 (117)  GTI_bil0_uni50 = 0
 (118)  GTI_bil0_uni51 = 0
 (119)  GTI_bil0_uni52 = 0
 (120)  GTI_bil0_uni53 = 0
 (121)  GTI_bil0_uni54 = 0
 (122)  GTI_bil0_uni55 = 0
 (123)  GTI_bil0_uni56 = 0
 (124)  GTI_bil0_uni57 = 0
 (125)  GTI_bil0_uni58 = 0
 (126)  GTI_bil0_uni59 = 0
 (127)  GTI_bil0_uni60 = 0
 (128)  GTI_bil0_uni61 = 0
 (129)  GTI_bil0_uni62 = 0
 (130)  GTI_bil0_uni63 = 0
 (131)  GTI_bil0_uni64 = 0
 (132)  GTI_bil0_uni65 = 0
 (133)  GTI_bil0_uni66 = 0
 (134)  GTI_bil0_uni67 = 0

       F(134, 20291) =   36.89
            Prob > F =    0.0000

. 
. //originXyear, pair FE
. regxfe fwd_log_mig $gallup d_log_gdp d_log_pop  if $sample1, fe(pair_id  iso3n_oXyear) cluster(pair_id)  
Transforming the data
.........
Estimating redundant parameters
.
Number of redundant parameters: 101

                                                 Number of obs      =    21855
                                                 F_xb (    4, 18254)=    7.849
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.9723
                                                 R2-Within          =   0.0081
                                                 # redundant FE     =      101
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
log_wmigdemand |  -.0015907   .0028611    -0.56   0.578    -.0071987    .0040174
  log_wmigplan |  -.0054439   .0046852    -1.16   0.245    -.0146273    .0037394
  log_wmigprep |   -.001275    .005613    -0.23   0.820     -.012277     .009727
     d_log_gdp |   .7667606    .198973     3.85   0.000     .3767548    1.156766
     d_log_pop |  -1.821357   .3277601    -5.56   0.000    -2.463798   -1.178916
         _cons |   3.393159   1.212466     2.80   0.005     1.016612    5.769706
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_Table6.xls", append label excel tex ctitle("Benchmark, OP pair FE")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.xls
dir : seeout

. regxfe fwd_log_mig $gallup d_log_gdp d_log_pop $gallup $bil_GTI_spec if $sample1, fe(pair_id  iso3n_oXyear) cluster(pair_id)  
Transforming the data
...........
Estimating redundant parameters
.
Number of redundant parameters: 101

                                                 Number of obs      =    21855
                                                 F_xb (  139, 18119)=    2.991
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.9728
                                                 R2-Within          =   0.0266
                                                 # redundant FE     =      101
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
log_wmigdemand |    .000021    .002319     0.01   0.993    -.0045245    .0045666
  log_wmigplan |  -.0060813   .0045298    -1.34   0.179    -.0149602    .0027976
  log_wmigprep |   .0022242   .0057441     0.39   0.699    -.0090348    .0134833
     d_log_gdp |   .7499112   .1967423     3.81   0.000     .3642776    1.135545
     d_log_pop |  -1.868377   .3310237    -5.64   0.000    -2.517214   -1.219539
log_wmigdemand |          0  (omitted)
  log_wmigplan |          0  (omitted)
  log_wmigprep |          0  (omitted)
     GTI_bil_0 |    .003959   .0025394     1.56   0.119    -.0010185    .0089365
     GTI_bil_1 |   .0093543   .0163879     0.57   0.568    -.0227675    .0414761
     GTI_bil_2 |  -.0015582   .0050021    -0.31   0.755    -.0113628    .0082464
     GTI_bil_3 |  -.0003142   .0068428    -0.05   0.963    -.0137269    .0130984
     GTI_bil_4 |   .0768535   .0482611     1.59   0.111    -.0177428    .1714499
     GTI_bil_5 |   .0005442   .0042672     0.13   0.899    -.0078199    .0089083
     GTI_bil_6 |  -.0004714   .0025468    -0.19   0.853    -.0054634    .0045206
     GTI_bil_7 |  -.0075831    .006326    -1.20   0.231    -.0199826    .0048164
     GTI_bil_8 |   .0025393   .0062129     0.41   0.683    -.0096386    .0147172
     GTI_bil_9 |   -.007951   .0162558    -0.49   0.625    -.0398139    .0239119
    GTI_bil_10 |  -.0005486   .0018361    -0.30   0.765    -.0041476    .0030503
    GTI_bil_12 |   .0053765   .0051728     1.04   0.299    -.0047626    .0155157
    GTI_bil_13 |   .0106775   .0094885     1.13   0.260    -.0079208    .0292759
    GTI_bil_14 |   .0014602   .0036389     0.40   0.688    -.0056725    .0085928
    GTI_bil_15 |  -.0019348   .0056861    -0.34   0.734    -.0130802    .0092106
    GTI_bil_16 |   .0080801   .0043796     1.84   0.065    -.0005044    .0166646
    GTI_bil_17 |  -.0136839   .0042105    -3.25   0.001    -.0219369   -.0054308
    GTI_bil_18 |   .0001688   .0024934     0.07   0.946    -.0047185    .0050561
    GTI_bil_19 |  -.0085056   .0045658    -1.86   0.062    -.0174551    .0004439
    GTI_bil_20 |  -.0050915   .0074331    -0.68   0.493    -.0196611    .0094781
    GTI_bil_21 |  -.0015468   .0058385    -0.26   0.791    -.0129908    .0098973
    GTI_bil_22 |   .0020313   .0044992     0.45   0.652    -.0067876    .0108502
    GTI_bil_23 |  -.0028356    .007582    -0.37   0.708     -.017697    .0120258
    GTI_bil_24 |  -.0266039   .0091922    -2.89   0.004    -.0446215   -.0085864
    GTI_bil_25 |   .0036806   .0041614     0.88   0.376    -.0044761    .0118372
    GTI_bil_26 |  -.0082021    .011201    -0.73   0.464    -.0301571    .0137529
    GTI_bil_27 |  -.0001005   .0057343    -0.02   0.986    -.0113402    .0111392
    GTI_bil_28 |  -.0155829   .0131882    -1.18   0.237    -.0414331    .0102673
    GTI_bil_29 |   .0060201   .0069375     0.87   0.386    -.0075781    .0196183
    GTI_bil_30 |   .0247399   .0167215     1.48   0.139    -.0080358    .0575155
    GTI_bil_31 |   .0142075   .0141324     1.01   0.315    -.0134934    .0419084
    GTI_bil_32 |   .0070285   .0028043     2.51   0.012     .0015317    .0125253
    GTI_bil_33 |  -.0008361   .0206294    -0.04   0.968    -.0412716    .0395995
    GTI_bil_34 |  -.0050644   .0138661    -0.37   0.715    -.0322433    .0221145
    GTI_bil_35 |    .042954   .0228145     1.88   0.060    -.0017646    .0876726
    GTI_bil_36 |   .0026579   .0017621     1.51   0.131     -.000796    .0061118
    GTI_bil_37 |  -.0015643   .0065376    -0.24   0.811    -.0143786    .0112501
    GTI_bil_38 |   .0014878   .0098903     0.15   0.880     -.017898    .0208737
    GTI_bil_39 |   .0025522   .0030217     0.84   0.398    -.0033706    .0084749
    GTI_bil_40 |  -.0074423   .0100395    -0.74   0.459    -.0271206    .0122361
    GTI_bil_41 |   .0075475   .0051727     1.46   0.145    -.0025916    .0176865
    GTI_bil_42 |   .0089469   .0410083     0.22   0.827    -.0714333    .0893271
    GTI_bil_43 |   .0022238   .0097649     0.23   0.820    -.0169164     .021364
    GTI_bil_44 |   .0015861   .0040718     0.39   0.697    -.0063951    .0095672
    GTI_bil_45 |   -.002174   .0067432    -0.32   0.747    -.0153914    .0110433
    GTI_bil_46 |   .0101971   .0032975     3.09   0.002     .0037337    .0166605
    GTI_bil_47 |    -.01046    .004095    -2.55   0.011    -.0184866   -.0024334
    GTI_bil_48 |  -.0034164   .0103422    -0.33   0.741     -.023688    .0168552
    GTI_bil_49 |   .0059003   .0044827     1.32   0.188    -.0028862    .0146868
    GTI_bil_50 |   -.007686   .0074154    -1.04   0.300    -.0222209    .0068489
    GTI_bil_51 |  -.0067171   .0063279    -1.06   0.288    -.0191204    .0056863
    GTI_bil_52 |   .0062483   .0021585     2.89   0.004     .0020175    .0104792
    GTI_bil_53 |   .0029219   .0060882     0.48   0.631    -.0090115    .0148553
    GTI_bil_54 |   .0028809    .006776     0.43   0.671    -.0104008    .0161626
    GTI_bil_55 |   .0022424   .0033655     0.67   0.505    -.0043542     .008839
    GTI_bil_56 |  -.0121543   .0071364    -1.70   0.089    -.0261423    .0018338
    GTI_bil_57 |   .0110613   .0059895     1.85   0.065    -.0006787    .0228012
    GTI_bil_58 |   .0024125   .0042439     0.57   0.570     -.005906     .010731
    GTI_bil_59 |  -.0048625   .0041712    -1.17   0.244    -.0130385    .0033136
    GTI_bil_60 |   .0012686   .0145793     0.09   0.931    -.0273083    .0298455
    GTI_bil_61 |    .003209   .0026094     1.23   0.219    -.0019056    .0083237
    GTI_bil_62 |  -.0084617   .0044298    -1.91   0.056    -.0171445    .0002211
    GTI_bil_63 |   .0084164    .006202     1.36   0.175    -.0037401    .0205729
    GTI_bil_64 |  -.0087315   .0038161    -2.29   0.022    -.0162113   -.0012516
    GTI_bil_65 |  -.0166335   .0114227    -1.46   0.145     -.039023     .005756
    GTI_bil_66 |  -.0005073   .0034548    -0.15   0.883     -.007279    .0062645
    GTI_bil_67 |   .0068333   .0101536     0.67   0.501    -.0130687    .0267353
 GTI_bil0_uni1 |  -.0000595   .0000595    -1.00   0.317    -.0001762    .0000572
 GTI_bil0_uni2 |   .0001352   .0000587     2.30   0.021     .0000202    .0002502
 GTI_bil0_uni3 |  -.0000583    .000069    -0.84   0.399    -.0001936    .0000771
 GTI_bil0_uni4 |  -.0000829   .0001268    -0.65   0.513    -.0003314    .0001656
 GTI_bil0_uni5 |  -4.83e-06   .0000522    -0.09   0.926    -.0001071    .0000974
 GTI_bil0_uni6 |   -.000044   .0000521    -0.84   0.399    -.0001462    .0000582
 GTI_bil0_uni7 |  -.0000768    .000063    -1.22   0.223    -.0002003    .0000466
 GTI_bil0_uni8 |  -.0000799   .0000839    -0.95   0.341    -.0002444    .0000845
 GTI_bil0_uni9 |  -.0000209   .0000685    -0.31   0.760    -.0001552    .0001134
GTI_bil0_uni10 |  -.0000208   .0000513    -0.41   0.685    -.0001214    .0000798
GTI_bil0_uni11 |   -.000026   .0000735    -0.35   0.723    -.0001701     .000118
GTI_bil0_uni12 |   .0000958   .0000753     1.27   0.203    -.0000518    .0002433
GTI_bil0_uni13 |   .0000101   .0000782     0.13   0.897    -.0001431    .0001633
GTI_bil0_uni14 |  -.0000495   .0000609    -0.81   0.417    -.0001689    .0000699
GTI_bil0_uni15 |   .0000788   .0000554     1.42   0.154    -.0000297    .0001874
GTI_bil0_uni16 |   4.07e-06   .0000647     0.06   0.950    -.0001228     .000131
GTI_bil0_uni17 |   .0000827   .0000616     1.34   0.179     -.000038    .0002034
GTI_bil0_uni18 |  -.0001038   .0000617    -1.68   0.092    -.0002248    .0000171
GTI_bil0_uni19 |   .0000328   .0000807     0.41   0.685    -.0001255     .000191
GTI_bil0_uni20 |  -.0000732   .0000806    -0.91   0.364    -.0002312    .0000849
GTI_bil0_uni21 |  -2.64e-06   .0000693    -0.04   0.970    -.0001386    .0001333
GTI_bil0_uni22 |   .0001115   .0000554     2.01   0.044     2.91e-06    .0002201
GTI_bil0_uni23 |   .0000148   .0000573     0.26   0.796    -.0000975     .000127
GTI_bil0_uni24 |   .0001136   .0000636     1.79   0.074     -.000011    .0002383
GTI_bil0_uni25 |   .0000923    .000048     1.92   0.055    -1.87e-06    .0001865
GTI_bil0_uni26 |  -.0000184   .0000687    -0.27   0.789    -.0001531    .0001163
GTI_bil0_uni27 |   .0000873   .0000701     1.25   0.213    -.0000501    .0002246
GTI_bil0_uni28 |   -.000133   .0001247    -1.07   0.286    -.0003773    .0001114
GTI_bil0_uni29 |   .0000237     .00006     0.39   0.693    -.0000939    .0001413
GTI_bil0_uni30 |  -.0000339   .0000613    -0.55   0.581     -.000154    .0000863
GTI_bil0_uni31 |   .0000503   .0000569     0.88   0.377    -.0000613    .0001618
GTI_bil0_uni32 |  -.0000461   .0000519    -0.89   0.375    -.0001479    .0000557
GTI_bil0_uni33 |   .0000381   .0000764     0.50   0.618    -.0001117    .0001879
GTI_bil0_uni34 |   .0000343   .0000851     0.40   0.687    -.0001326    .0002012
GTI_bil0_uni35 |  -.0000317   .0000881    -0.36   0.719    -.0002045     .000141
GTI_bil0_uni36 |  -.0000286   .0000479    -0.60   0.551    -.0001225    .0000654
GTI_bil0_uni37 |  -2.06e-06   .0000693    -0.03   0.976    -.0001379    .0001338
GTI_bil0_uni38 |  -.0000271   .0000586    -0.46   0.644    -.0001419    .0000878
GTI_bil0_uni39 |  -.0000195   .0000578    -0.34   0.736    -.0001328    .0000938
GTI_bil0_uni40 |  -.0000602   .0000584    -1.03   0.302    -.0001746    .0000542
GTI_bil0_uni41 |  -1.64e-06   .0000619    -0.03   0.979     -.000123    .0001197
GTI_bil0_uni42 |   .0001046   .0000797     1.31   0.189    -.0000516    .0002608
GTI_bil0_uni43 |   .0000546   .0000692     0.79   0.430    -.0000811    .0001902
GTI_bil0_uni44 |  -.0000326     .00006    -0.54   0.587    -.0001503     .000085
GTI_bil0_uni45 |  -.0000111   .0000616    -0.18   0.857    -.0001318    .0001096
GTI_bil0_uni46 |   .0000531   .0000488     1.09   0.276    -.0000425    .0001487
GTI_bil0_uni47 |   .0000512   .0000674     0.76   0.448     -.000081    .0001833
GTI_bil0_uni48 |  -.0000449   .0000606    -0.74   0.460    -.0001637     .000074
GTI_bil0_uni49 |  -.0000476   .0000625    -0.76   0.446    -.0001702     .000075
GTI_bil0_uni50 |  -.0000106   .0000499    -0.21   0.831    -.0001084    .0000871
GTI_bil0_uni51 |   8.30e-06   .0000506     0.16   0.870    -.0000908    .0001074
GTI_bil0_uni52 |  -3.52e-06    .000051    -0.07   0.945    -.0001035    .0000965
GTI_bil0_uni53 |  -.0000367   .0000559    -0.66   0.511    -.0001461    .0000728
GTI_bil0_uni54 |  -.0000207   .0000568    -0.36   0.716     -.000132    .0000907
GTI_bil0_uni55 |   .0000365   .0000604     0.60   0.546    -.0000819    .0001549
GTI_bil0_uni56 |  -1.02e-07   .0000571    -0.00   0.999    -.0001121    .0001119
GTI_bil0_uni57 |   .0000812   .0000526     1.54   0.123     -.000022    .0001844
GTI_bil0_uni58 |   .0000275   .0000424     0.65   0.517    -.0000557    .0001106
GTI_bil0_uni59 |  -.0000589   .0000437    -1.35   0.177    -.0001445    .0000266
GTI_bil0_uni60 |   -.000013   .0000601    -0.22   0.828    -.0001309    .0001049
GTI_bil0_uni61 |   -.000065   .0000658    -0.99   0.323     -.000194     .000064
GTI_bil0_uni62 |   5.59e-06   .0000543     0.10   0.918    -.0001008     .000112
GTI_bil0_uni63 |  -.0000628   .0000563    -1.12   0.265     -.000173    .0000475
GTI_bil0_uni64 |   .0000579   .0000543     1.07   0.286    -.0000486    .0001644
GTI_bil0_uni65 |    .000011   .0000462     0.24   0.812    -.0000796    .0001016
GTI_bil0_uni66 |   .0000371   .0000592     0.63   0.531     -.000079    .0001531
GTI_bil0_uni67 |   .0000392   .0000559     0.70   0.483    -.0000704    .0001487
         _cons |   3.426935   1.212337     2.83   0.005     1.050639    5.803231
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_Table6.xls", append label excel tex ctitle("all GTI, OP pair FE")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.xls
dir : seeout

. test GTI_bil_0 GTI_bil_1 GTI_bil_2 GTI_bil_3 GTI_bil_4 GTI_bil_5 GTI_bil_6 GTI_bil_7 GTI_bil_8 GTI_bil_9 GTI_bil_10 GTI_bil_12 GTI_bil_13 GTI_bil_14 GTI_bil_15 
> GTI_bil_16 GTI_bil_17 GTI_bil_18 GTI_bil_19 GTI_bil_20 GTI_bil_21 GTI_bil_22 GTI_bil_23 GTI_bil_24 GTI_bil_25 GTI_bil_26 GTI_bil_27 GTI_bil_28 GTI_bil_29 GTI_bi
> l_30 GTI_bil_31 GTI_bil_32 GTI_bil_33 GTI_bil_34 GTI_bil_35 GTI_bil_36 GTI_bil_37 GTI_bil_38 GTI_bil_39 GTI_bil_40 GTI_bil_41 GTI_bil_42 GTI_bil_43 GTI_bil_44 G
> TI_bil_45 GTI_bil_46 GTI_bil_47 GTI_bil_48 GTI_bil_49 GTI_bil_50 GTI_bil_51 GTI_bil_52 GTI_bil_53 GTI_bil_54 GTI_bil_55 GTI_bil_56 GTI_bil_57 GTI_bil_58 GTI_bil
> _59 GTI_bil_60 GTI_bil_61 GTI_bil_62 GTI_bil_63 GTI_bil_64 GTI_bil_65 GTI_bil_66 GTI_bil_67 GTI_bil0_uni1 GTI_bil0_uni2 GTI_bil0_uni3 GTI_bil0_uni4 GTI_bil0_uni
> 5 GTI_bil0_uni6 GTI_bil0_uni7 GTI_bil0_uni8 GTI_bil0_uni9 GTI_bil0_uni10 GTI_bil0_uni11 GTI_bil0_uni12 GTI_bil0_uni13 GTI_bil0_uni14 GTI_bil0_uni15 GTI_bil0_uni
> 16 GTI_bil0_uni17 GTI_bil0_uni18 GTI_bil0_uni19 GTI_bil0_uni20 GTI_bil0_uni21 GTI_bil0_uni22 GTI_bil0_uni23 GTI_bil0_uni24 GTI_bil0_uni25 GTI_bil0_uni26 GTI_bil
> 0_uni27 GTI_bil0_uni28 GTI_bil0_uni29 GTI_bil0_uni30 GTI_bil0_uni31 GTI_bil0_uni32 GTI_bil0_uni33 GTI_bil0_uni34 GTI_bil0_uni35 GTI_bil0_uni36 GTI_bil0_uni37 GT
> I_bil0_uni38 GTI_bil0_uni39 GTI_bil0_uni40 GTI_bil0_uni41 GTI_bil0_uni42 GTI_bil0_uni43 GTI_bil0_uni44 GTI_bil0_uni45 GTI_bil0_uni46 GTI_bil0_uni47 GTI_bil0_uni
> 48 GTI_bil0_uni49 GTI_bil0_uni50 GTI_bil0_uni51 GTI_bil0_uni52 GTI_bil0_uni53 GTI_bil0_uni54 GTI_bil0_uni55 GTI_bil0_uni56 GTI_bil0_uni57 GTI_bil0_uni58 GTI_bil
> 0_uni59 GTI_bil0_uni60 GTI_bil0_uni61 GTI_bil0_uni62 GTI_bil0_uni63 GTI_bil0_uni64 GTI_bil0_uni65 GTI_bil0_uni66 GTI_bil0_uni67                                 

 ( 1)  GTI_bil_0 = 0
 ( 2)  GTI_bil_1 = 0
 ( 3)  GTI_bil_2 = 0
 ( 4)  GTI_bil_3 = 0
 ( 5)  GTI_bil_4 = 0
 ( 6)  GTI_bil_5 = 0
 ( 7)  GTI_bil_6 = 0
 ( 8)  GTI_bil_7 = 0
 ( 9)  GTI_bil_8 = 0
 (10)  GTI_bil_9 = 0
 (11)  GTI_bil_10 = 0
 (12)  GTI_bil_12 = 0
 (13)  GTI_bil_13 = 0
 (14)  GTI_bil_14 = 0
 (15)  GTI_bil_15 = 0
 (16)  GTI_bil_16 = 0
 (17)  GTI_bil_17 = 0
 (18)  GTI_bil_18 = 0
 (19)  GTI_bil_19 = 0
 (20)  GTI_bil_20 = 0
 (21)  GTI_bil_21 = 0
 (22)  GTI_bil_22 = 0
 (23)  GTI_bil_23 = 0
 (24)  GTI_bil_24 = 0
 (25)  GTI_bil_25 = 0
 (26)  GTI_bil_26 = 0
 (27)  GTI_bil_27 = 0
 (28)  GTI_bil_28 = 0
 (29)  GTI_bil_29 = 0
 (30)  GTI_bil_30 = 0
 (31)  GTI_bil_31 = 0
 (32)  GTI_bil_32 = 0
 (33)  GTI_bil_33 = 0
 (34)  GTI_bil_34 = 0
 (35)  GTI_bil_35 = 0
 (36)  GTI_bil_36 = 0
 (37)  GTI_bil_37 = 0
 (38)  GTI_bil_38 = 0
 (39)  GTI_bil_39 = 0
 (40)  GTI_bil_40 = 0
 (41)  GTI_bil_41 = 0
 (42)  GTI_bil_42 = 0
 (43)  GTI_bil_43 = 0
 (44)  GTI_bil_44 = 0
 (45)  GTI_bil_45 = 0
 (46)  GTI_bil_46 = 0
 (47)  GTI_bil_47 = 0
 (48)  GTI_bil_48 = 0
 (49)  GTI_bil_49 = 0
 (50)  GTI_bil_50 = 0
 (51)  GTI_bil_51 = 0
 (52)  GTI_bil_52 = 0
 (53)  GTI_bil_53 = 0
 (54)  GTI_bil_54 = 0
 (55)  GTI_bil_55 = 0
 (56)  GTI_bil_56 = 0
 (57)  GTI_bil_57 = 0
 (58)  GTI_bil_58 = 0
 (59)  GTI_bil_59 = 0
 (60)  GTI_bil_60 = 0
 (61)  GTI_bil_61 = 0
 (62)  GTI_bil_62 = 0
 (63)  GTI_bil_63 = 0
 (64)  GTI_bil_64 = 0
 (65)  GTI_bil_65 = 0
 (66)  GTI_bil_66 = 0
 (67)  GTI_bil_67 = 0
 (68)  GTI_bil0_uni1 = 0
 (69)  GTI_bil0_uni2 = 0
 (70)  GTI_bil0_uni3 = 0
 (71)  GTI_bil0_uni4 = 0
 (72)  GTI_bil0_uni5 = 0
 (73)  GTI_bil0_uni6 = 0
 (74)  GTI_bil0_uni7 = 0
 (75)  GTI_bil0_uni8 = 0
 (76)  GTI_bil0_uni9 = 0
 (77)  GTI_bil0_uni10 = 0
 (78)  GTI_bil0_uni11 = 0
 (79)  GTI_bil0_uni12 = 0
 (80)  GTI_bil0_uni13 = 0
 (81)  GTI_bil0_uni14 = 0
 (82)  GTI_bil0_uni15 = 0
 (83)  GTI_bil0_uni16 = 0
 (84)  GTI_bil0_uni17 = 0
 (85)  GTI_bil0_uni18 = 0
 (86)  GTI_bil0_uni19 = 0
 (87)  GTI_bil0_uni20 = 0
 (88)  GTI_bil0_uni21 = 0
 (89)  GTI_bil0_uni22 = 0
 (90)  GTI_bil0_uni23 = 0
 (91)  GTI_bil0_uni24 = 0
 (92)  GTI_bil0_uni25 = 0
 (93)  GTI_bil0_uni26 = 0
 (94)  GTI_bil0_uni27 = 0
 (95)  GTI_bil0_uni28 = 0
 (96)  GTI_bil0_uni29 = 0
 (97)  GTI_bil0_uni30 = 0
 (98)  GTI_bil0_uni31 = 0
 (99)  GTI_bil0_uni32 = 0
 (100)  GTI_bil0_uni33 = 0
 (101)  GTI_bil0_uni34 = 0
 (102)  GTI_bil0_uni35 = 0
 (103)  GTI_bil0_uni36 = 0
 (104)  GTI_bil0_uni37 = 0
 (105)  GTI_bil0_uni38 = 0
 (106)  GTI_bil0_uni39 = 0
 (107)  GTI_bil0_uni40 = 0
 (108)  GTI_bil0_uni41 = 0
 (109)  GTI_bil0_uni42 = 0
 (110)  GTI_bil0_uni43 = 0
 (111)  GTI_bil0_uni44 = 0
 (112)  GTI_bil0_uni45 = 0
 (113)  GTI_bil0_uni46 = 0
 (114)  GTI_bil0_uni47 = 0
 (115)  GTI_bil0_uni48 = 0
 (116)  GTI_bil0_uni49 = 0
 (117)  GTI_bil0_uni50 = 0
 (118)  GTI_bil0_uni51 = 0
 (119)  GTI_bil0_uni52 = 0
 (120)  GTI_bil0_uni53 = 0
 (121)  GTI_bil0_uni54 = 0
 (122)  GTI_bil0_uni55 = 0
 (123)  GTI_bil0_uni56 = 0
 (124)  GTI_bil0_uni57 = 0
 (125)  GTI_bil0_uni58 = 0
 (126)  GTI_bil0_uni59 = 0
 (127)  GTI_bil0_uni60 = 0
 (128)  GTI_bil0_uni61 = 0
 (129)  GTI_bil0_uni62 = 0
 (130)  GTI_bil0_uni63 = 0
 (131)  GTI_bil0_uni64 = 0
 (132)  GTI_bil0_uni65 = 0
 (133)  GTI_bil0_uni66 = 0
 (134)  GTI_bil0_uni67 = 0

       F(134, 18119) =    2.32
            Prob > F =    0.0000

. 
. //originXyear, destinationXyear und pair FE  
. regxfe fwd_log_mig $gallup d_log_gdp d_log_pop  if $sample1, fe(pair_id iso3n_oXyear  iso3n_dXyear) cluster(pair_id)  
Transforming the data
................
Estimating redundant parameters
....
Number of redundant parameters: 146

                                                 Number of obs      =    21855
                                                 F_xb (    3, 17949)=    2.123
                                                 Prob > F_xb        =   0.0951
                                                 R2-Overall         =   0.9752
                                                 R2-Within          =   0.0008
                                                 # redundant FE     =      146
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
log_wmigdemand |  -.0026151   .0027205    -0.96   0.336    -.0079476    .0027173
  log_wmigplan |  -.0055478   .0045673    -1.21   0.225    -.0145001    .0034045
  log_wmigprep |  -.0004291   .0053633    -0.08   0.936    -.0109417    .0100836
         _cons |   3.222149   .0062027   519.47   0.000     3.209991    3.234307
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_Table6.xls", append label excel tex ctitle("Benchmark, all FE")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.xls
dir : seeout

. regxfe fwd_log_mig $gallup d_log_gdp d_log_pop $gallup $bil_GTI_spec if $sample1, fe(pair_id iso3n_oXyear  iso3n_dXyear) cluster(pair_id)  
Transforming the data
.........................
Estimating redundant parameters
....
Number of redundant parameters: 146

                                                 Number of obs      =    21855
                                                 F_xb (  137, 17815)=    2.119
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.9755
                                                 R2-Within          =   0.0164
                                                 # redundant FE     =      146
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
log_wmigdemand |  -.0009002   .0023292    -0.39   0.699    -.0054657    .0036654
  log_wmigplan |  -.0059054   .0045461    -1.30   0.194    -.0148162    .0030055
  log_wmigprep |   .0027726    .005545     0.50   0.617    -.0080962    .0136414
log_wmigdemand |          0  (omitted)
  log_wmigplan |          0  (omitted)
  log_wmigprep |          0  (omitted)
     GTI_bil_0 |   .0032294   .0024431     1.32   0.186    -.0015593    .0080181
     GTI_bil_1 |   .0040637   .0135784     0.30   0.765    -.0225513    .0306788
     GTI_bil_2 |   .0016607   .0043451     0.38   0.702    -.0068561    .0101776
     GTI_bil_3 |  -.0003654   .0064262    -0.06   0.955    -.0129614    .0122306
     GTI_bil_4 |   .0833785   .0427617     1.95   0.051    -.0004387    .1671956
     GTI_bil_5 |   .0006088   .0041468     0.15   0.883    -.0075192    .0087369
     GTI_bil_6 |   .0025799   .0022223     1.16   0.246     -.001776    .0069357
     GTI_bil_7 |  -.0041361   .0053139    -0.78   0.436    -.0145517    .0062796
     GTI_bil_8 |     .00122    .005858     0.21   0.835    -.0102622    .0127022
     GTI_bil_9 |   -.027144    .015092    -1.80   0.072    -.0567259    .0024378
    GTI_bil_10 |   .0006307    .001652     0.38   0.703    -.0026075    .0038689
    GTI_bil_12 |   .0038475   .0050242     0.77   0.444    -.0060004    .0136955
    GTI_bil_13 |   .0111098   .0084149     1.32   0.187    -.0053842    .0276038
    GTI_bil_14 |  -.0001511   .0029096    -0.05   0.959    -.0058541     .005552
    GTI_bil_15 |  -.0039942   .0044604    -0.90   0.371     -.012737    .0047485
    GTI_bil_16 |   .0059065   .0037842     1.56   0.119     -.001511    .0133239
    GTI_bil_17 |   -.010913   .0035283    -3.09   0.002    -.0178287   -.0039972
    GTI_bil_18 |  -.0018765   .0026695    -0.70   0.482     -.007109     .003356
    GTI_bil_19 |  -.0104554   .0053689    -1.95   0.052    -.0209791    .0000682
    GTI_bil_20 |  -.0039089   .0068887    -0.57   0.570    -.0174114    .0095935
    GTI_bil_21 |   .0035668   .0058178     0.61   0.540    -.0078367    .0149703
    GTI_bil_22 |   .0008077   .0038534     0.21   0.834    -.0067453    .0083606
    GTI_bil_23 |  -.0013549   .0071129    -0.19   0.849     -.015297    .0125872
    GTI_bil_24 |   -.021539   .0084493    -2.55   0.011    -.0381005   -.0049775
    GTI_bil_25 |   .0039454   .0038951     1.01   0.311    -.0036894    .0115802
    GTI_bil_26 |  -.0041616   .0101696    -0.41   0.682    -.0240951    .0157718
    GTI_bil_27 |   .0025639   .0054224     0.47   0.636    -.0080644    .0131923
    GTI_bil_28 |  -.0087175   .0099816    -0.87   0.382    -.0282824    .0108474
    GTI_bil_29 |   .0065818   .0064242     1.02   0.306    -.0060102    .0191738
    GTI_bil_30 |   .0206015   .0141097     1.46   0.144    -.0070549    .0482579
    GTI_bil_31 |   .0168195   .0148256     1.13   0.257    -.0122402    .0458791
    GTI_bil_32 |   .0060595   .0024123     2.51   0.012      .001331    .0107879
    GTI_bil_33 |  -.0106005   .0204297    -0.52   0.604    -.0506447    .0294437
    GTI_bil_34 |   .0082373    .012181     0.68   0.499    -.0156385    .0321132
    GTI_bil_35 |   .0209483   .0176391     1.19   0.235     -.013626    .0555226
    GTI_bil_36 |   .0023606   .0015735     1.50   0.134    -.0007237    .0054449
    GTI_bil_37 |   .0033908   .0067675     0.50   0.616    -.0098742    .0166558
    GTI_bil_38 |   .0012123   .0079172     0.15   0.878    -.0143061    .0167308
    GTI_bil_39 |   .0020878   .0026886     0.78   0.437     -.003182    .0073577
    GTI_bil_40 |  -.0122886   .0090421    -1.36   0.174     -.030012    .0054348
    GTI_bil_41 |   .0037297   .0044548     0.84   0.402    -.0050022    .0124616
    GTI_bil_42 |   .0342932    .035412     0.97   0.333    -.0351178    .1037043
    GTI_bil_43 |   .0032583   .0085935     0.38   0.705    -.0135858    .0201024
    GTI_bil_44 |   .0020828    .003522     0.59   0.554    -.0048206    .0089862
    GTI_bil_45 |  -.0028963   .0058283    -0.50   0.619    -.0143203    .0085277
    GTI_bil_46 |   .0074148   .0028372     2.61   0.009     .0018537    .0129759
    GTI_bil_47 |  -.0075563   .0038835    -1.95   0.052    -.0151683    .0000558
    GTI_bil_48 |  -.0043497   .0096204    -0.45   0.651    -.0232065    .0145071
    GTI_bil_49 |   .0061616   .0040678     1.51   0.130    -.0018116    .0141348
    GTI_bil_50 |  -.0063753   .0073954    -0.86   0.389    -.0208711    .0081205
    GTI_bil_51 |  -.0042556   .0055866    -0.76   0.446     -.015206    .0066947
    GTI_bil_52 |   .0047216   .0018974     2.49   0.013     .0010025    .0084407
    GTI_bil_53 |   .0040171   .0051214     0.78   0.433    -.0060213    .0140555
    GTI_bil_54 |   .0048309   .0065516     0.74   0.461    -.0080108    .0176727
    GTI_bil_55 |   .0036297   .0031379     1.16   0.247    -.0025208    .0097802
    GTI_bil_56 |   -.008292   .0071994    -1.15   0.249    -.0224035    .0058196
    GTI_bil_57 |   .0083363    .005346     1.56   0.119    -.0021424     .018815
    GTI_bil_58 |   .0034308    .004249     0.81   0.419    -.0048976    .0117592
    GTI_bil_59 |  -.0083295   .0040159    -2.07   0.038     -.016201    -.000458
    GTI_bil_60 |   .0136305   .0121302     1.12   0.261     -.010146    .0374069
    GTI_bil_61 |   .0022838   .0022192     1.03   0.303     -.002066    .0066336
    GTI_bil_62 |  -.0061236   .0038124    -1.61   0.108    -.0135964    .0013491
    GTI_bil_63 |     .00829   .0058102     1.43   0.154    -.0030986    .0196786
    GTI_bil_64 |  -.0085166   .0035878    -2.37   0.018    -.0155489   -.0014842
    GTI_bil_65 |   -.020043   .0084252    -2.38   0.017    -.0365573   -.0035287
    GTI_bil_66 |  -.0007347   .0029156    -0.25   0.801    -.0064497    .0049802
    GTI_bil_67 |  -.0032735   .0094492    -0.35   0.729     -.021795    .0152479
 GTI_bil0_uni1 |  -.0000654   .0000574    -1.14   0.254    -.0001778     .000047
 GTI_bil0_uni2 |   .0000962   .0000595     1.62   0.106    -.0000204    .0002129
 GTI_bil0_uni3 |  -.0000669   .0000649    -1.03   0.303    -.0001941    .0000604
 GTI_bil0_uni4 |  -.0000588   .0001159    -0.51   0.612    -.0002859    .0001683
 GTI_bil0_uni5 |  -1.96e-06   .0000478    -0.04   0.967    -.0000957    .0000918
 GTI_bil0_uni6 |  -.0000319   .0000467    -0.68   0.495    -.0001235    .0000597
 GTI_bil0_uni7 |  -.0000891   .0000566    -1.57   0.116    -.0002001    .0000219
 GTI_bil0_uni8 |  -.0000752   .0000802    -0.94   0.349    -.0002324     .000082
 GTI_bil0_uni9 |  -.0000135    .000066    -0.20   0.838    -.0001428    .0001159
GTI_bil0_uni10 |  -6.63e-06   .0000486    -0.14   0.891    -.0001018    .0000886
GTI_bil0_uni11 |  -.0000703   .0000687    -1.02   0.306     -.000205    .0000644
GTI_bil0_uni12 |   .0001065   .0000684     1.56   0.120    -.0000276    .0002406
GTI_bil0_uni13 |   .0000701   .0000728     0.96   0.336    -.0000727    .0002128
GTI_bil0_uni14 |  -.0000396   .0000561    -0.71   0.480    -.0001495    .0000703
GTI_bil0_uni15 |   .0000644   .0000519     1.24   0.215    -.0000373    .0001662
GTI_bil0_uni16 |   .0000164   .0000594     0.28   0.783    -.0001001    .0001328
GTI_bil0_uni17 |   .0000789   .0000576     1.37   0.171     -.000034    .0001919
GTI_bil0_uni18 |  -.0000993   .0000593    -1.68   0.094    -.0002155    .0000168
GTI_bil0_uni19 |   .0000447   .0000721     0.62   0.535    -.0000966    .0001861
GTI_bil0_uni20 |  -.0000831    .000071    -1.17   0.242    -.0002223     .000056
GTI_bil0_uni21 |  -.0000272   .0000641    -0.42   0.672    -.0001529    .0000986
GTI_bil0_uni22 |   .0000945   .0000505     1.87   0.061    -4.46e-06    .0001934
GTI_bil0_uni23 |  -.0000115   .0000539    -0.21   0.831    -.0001171    .0000941
GTI_bil0_uni24 |    .000089   .0000615     1.45   0.147    -.0000314    .0002095
GTI_bil0_uni25 |   .0000733   .0000452     1.62   0.105    -.0000153    .0001619
GTI_bil0_uni26 |  -.0000366   .0000661    -0.55   0.579    -.0001661    .0000929
GTI_bil0_uni27 |   .0000783   .0000648     1.21   0.227    -.0000488    .0002053
GTI_bil0_uni28 |  -.0000511   .0001172    -0.44   0.663    -.0002807    .0001786
GTI_bil0_uni29 |  -4.05e-06   .0000557    -0.07   0.942    -.0001132    .0001051
GTI_bil0_uni30 |  -.0000315   .0000549    -0.57   0.566    -.0001391    .0000761
GTI_bil0_uni31 |   .0000463   .0000537     0.86   0.389     -.000059    .0001515
GTI_bil0_uni32 |  -.0000169   .0000491    -0.34   0.730    -.0001131    .0000793
GTI_bil0_uni33 |   .0000353    .000073     0.48   0.628    -.0001077    .0001784
GTI_bil0_uni34 |   .0000145   .0000783     0.19   0.853     -.000139     .000168
GTI_bil0_uni35 |  -.0000359   .0000873    -0.41   0.681    -.0002071    .0001352
GTI_bil0_uni36 |  -.0000111    .000047    -0.24   0.813    -.0001033    .0000811
GTI_bil0_uni37 |   .0000143    .000062     0.23   0.818    -.0001072    .0001358
GTI_bil0_uni38 |  -.0000314   .0000553    -0.57   0.570    -.0001397    .0000769
GTI_bil0_uni39 |  -.0000255    .000053    -0.48   0.631    -.0001295    .0000785
GTI_bil0_uni40 |  -.0000336   .0000554    -0.61   0.544    -.0001422     .000075
GTI_bil0_uni41 |   .0000117   .0000565     0.21   0.837     -.000099    .0001223
GTI_bil0_uni42 |   .0000611   .0000752     0.81   0.417    -.0000864    .0002085
GTI_bil0_uni43 |   .0000242   .0000653     0.37   0.711    -.0001039    .0001522
GTI_bil0_uni44 |  -.0000384   .0000551    -0.70   0.486    -.0001464    .0000696
GTI_bil0_uni45 |   3.23e-06   .0000582     0.06   0.956    -.0001109    .0001174
GTI_bil0_uni46 |   .0000453   .0000437     1.04   0.300    -.0000404     .000131
GTI_bil0_uni47 |   .0000526   .0000604     0.87   0.384    -.0000659     .000171
GTI_bil0_uni48 |  -.0000708   .0000563    -1.26   0.209    -.0001812    .0000396
GTI_bil0_uni49 |  -.0000221   .0000547    -0.40   0.687    -.0001293    .0000852
GTI_bil0_uni50 |   7.98e-06    .000047     0.17   0.865    -.0000841    .0001001
GTI_bil0_uni51 |   .0000206   .0000481     0.43   0.668    -.0000737    .0001149
GTI_bil0_uni52 |   4.64e-06   .0000489     0.09   0.924    -.0000913    .0001006
GTI_bil0_uni53 |  -.0000213   .0000532    -0.40   0.688    -.0001255    .0000829
GTI_bil0_uni54 |  -.0000298   .0000522    -0.57   0.568    -.0001322    .0000725
GTI_bil0_uni55 |   .0000344   .0000558     0.62   0.538    -.0000749    .0001437
GTI_bil0_uni56 |   9.04e-06   .0000524     0.17   0.863    -.0000937    .0001118
GTI_bil0_uni57 |   .0000644   .0000498     1.29   0.197    -.0000333    .0001621
GTI_bil0_uni58 |  -9.41e-06    .000042    -0.22   0.823    -.0000917    .0000729
GTI_bil0_uni59 |  -.0000644   .0000398    -1.62   0.106    -.0001425    .0000136
GTI_bil0_uni60 |   6.28e-06    .000056     0.11   0.911    -.0001035     .000116
GTI_bil0_uni61 |  -.0000641    .000061    -1.05   0.293    -.0001837    .0000554
GTI_bil0_uni62 |  -1.66e-06    .000051    -0.03   0.974    -.0001017    .0000984
GTI_bil0_uni63 |  -.0000289   .0000541    -0.53   0.593     -.000135    .0000772
GTI_bil0_uni64 |    .000043    .000051     0.84   0.398    -.0000568    .0001429
GTI_bil0_uni65 |   .0000107   .0000435     0.25   0.805    -.0000746    .0000961
GTI_bil0_uni66 |   .0000158   .0000558     0.28   0.776    -.0000935    .0001252
GTI_bil0_uni67 |   .0000182   .0000518     0.35   0.725    -.0000833    .0001198
         _cons |   3.054736   .0595248    51.32   0.000     2.938062    3.171411
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_Table6.xls", append label excel tex ctitle("all GTI, all FE")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_Table6.xls
dir : seeout

. test GTI_bil_0 GTI_bil_1 GTI_bil_2 GTI_bil_3 GTI_bil_4 GTI_bil_5 GTI_bil_6 GTI_bil_7 GTI_bil_8 GTI_bil_9 GTI_bil_10 GTI_bil_12 GTI_bil_13 GTI_bil_14 GTI_bil_15 
> GTI_bil_16 GTI_bil_17 GTI_bil_18 GTI_bil_19 GTI_bil_20 GTI_bil_21 GTI_bil_22 GTI_bil_23 GTI_bil_24 GTI_bil_25 GTI_bil_26 GTI_bil_27 GTI_bil_28 GTI_bil_29 GTI_bi
> l_30 GTI_bil_31 GTI_bil_32 GTI_bil_33 GTI_bil_34 GTI_bil_35 GTI_bil_36 GTI_bil_37 GTI_bil_38 GTI_bil_39 GTI_bil_40 GTI_bil_41 GTI_bil_42 GTI_bil_43 GTI_bil_44 G
> TI_bil_45 GTI_bil_46 GTI_bil_47 GTI_bil_48 GTI_bil_49 GTI_bil_50 GTI_bil_51 GTI_bil_52 GTI_bil_53 GTI_bil_54 GTI_bil_55 GTI_bil_56 GTI_bil_57 GTI_bil_58 GTI_bil
> _59 GTI_bil_60 GTI_bil_61 GTI_bil_62 GTI_bil_63 GTI_bil_64 GTI_bil_65 GTI_bil_66 GTI_bil_67 GTI_bil0_uni1 GTI_bil0_uni2 GTI_bil0_uni3 GTI_bil0_uni4 GTI_bil0_uni
> 5 GTI_bil0_uni6 GTI_bil0_uni7 GTI_bil0_uni8 GTI_bil0_uni9 GTI_bil0_uni10 GTI_bil0_uni11 GTI_bil0_uni12 GTI_bil0_uni13 GTI_bil0_uni14 GTI_bil0_uni15 GTI_bil0_uni
> 16 GTI_bil0_uni17 GTI_bil0_uni18 GTI_bil0_uni19 GTI_bil0_uni20 GTI_bil0_uni21 GTI_bil0_uni22 GTI_bil0_uni23 GTI_bil0_uni24 GTI_bil0_uni25 GTI_bil0_uni26 GTI_bil
> 0_uni27 GTI_bil0_uni28 GTI_bil0_uni29 GTI_bil0_uni30 GTI_bil0_uni31 GTI_bil0_uni32 GTI_bil0_uni33 GTI_bil0_uni34 GTI_bil0_uni35 GTI_bil0_uni36 GTI_bil0_uni37 GT
> I_bil0_uni38 GTI_bil0_uni39 GTI_bil0_uni40 GTI_bil0_uni41 GTI_bil0_uni42 GTI_bil0_uni43 GTI_bil0_uni44 GTI_bil0_uni45 GTI_bil0_uni46 GTI_bil0_uni47 GTI_bil0_uni
> 48 GTI_bil0_uni49 GTI_bil0_uni50 GTI_bil0_uni51 GTI_bil0_uni52 GTI_bil0_uni53 GTI_bil0_uni54 GTI_bil0_uni55 GTI_bil0_uni56 GTI_bil0_uni57 GTI_bil0_uni58 GTI_bil
> 0_uni59 GTI_bil0_uni60 GTI_bil0_uni61 GTI_bil0_uni62 GTI_bil0_uni63 GTI_bil0_uni64 GTI_bil0_uni65 GTI_bil0_uni66 GTI_bil0_uni67                                 

 ( 1)  GTI_bil_0 = 0
 ( 2)  GTI_bil_1 = 0
 ( 3)  GTI_bil_2 = 0
 ( 4)  GTI_bil_3 = 0
 ( 5)  GTI_bil_4 = 0
 ( 6)  GTI_bil_5 = 0
 ( 7)  GTI_bil_6 = 0
 ( 8)  GTI_bil_7 = 0
 ( 9)  GTI_bil_8 = 0
 (10)  GTI_bil_9 = 0
 (11)  GTI_bil_10 = 0
 (12)  GTI_bil_12 = 0
 (13)  GTI_bil_13 = 0
 (14)  GTI_bil_14 = 0
 (15)  GTI_bil_15 = 0
 (16)  GTI_bil_16 = 0
 (17)  GTI_bil_17 = 0
 (18)  GTI_bil_18 = 0
 (19)  GTI_bil_19 = 0
 (20)  GTI_bil_20 = 0
 (21)  GTI_bil_21 = 0
 (22)  GTI_bil_22 = 0
 (23)  GTI_bil_23 = 0
 (24)  GTI_bil_24 = 0
 (25)  GTI_bil_25 = 0
 (26)  GTI_bil_26 = 0
 (27)  GTI_bil_27 = 0
 (28)  GTI_bil_28 = 0
 (29)  GTI_bil_29 = 0
 (30)  GTI_bil_30 = 0
 (31)  GTI_bil_31 = 0
 (32)  GTI_bil_32 = 0
 (33)  GTI_bil_33 = 0
 (34)  GTI_bil_34 = 0
 (35)  GTI_bil_35 = 0
 (36)  GTI_bil_36 = 0
 (37)  GTI_bil_37 = 0
 (38)  GTI_bil_38 = 0
 (39)  GTI_bil_39 = 0
 (40)  GTI_bil_40 = 0
 (41)  GTI_bil_41 = 0
 (42)  GTI_bil_42 = 0
 (43)  GTI_bil_43 = 0
 (44)  GTI_bil_44 = 0
 (45)  GTI_bil_45 = 0
 (46)  GTI_bil_46 = 0
 (47)  GTI_bil_47 = 0
 (48)  GTI_bil_48 = 0
 (49)  GTI_bil_49 = 0
 (50)  GTI_bil_50 = 0
 (51)  GTI_bil_51 = 0
 (52)  GTI_bil_52 = 0
 (53)  GTI_bil_53 = 0
 (54)  GTI_bil_54 = 0
 (55)  GTI_bil_55 = 0
 (56)  GTI_bil_56 = 0
 (57)  GTI_bil_57 = 0
 (58)  GTI_bil_58 = 0
 (59)  GTI_bil_59 = 0
 (60)  GTI_bil_60 = 0
 (61)  GTI_bil_61 = 0
 (62)  GTI_bil_62 = 0
 (63)  GTI_bil_63 = 0
 (64)  GTI_bil_64 = 0
 (65)  GTI_bil_65 = 0
 (66)  GTI_bil_66 = 0
 (67)  GTI_bil_67 = 0
 (68)  GTI_bil0_uni1 = 0
 (69)  GTI_bil0_uni2 = 0
 (70)  GTI_bil0_uni3 = 0
 (71)  GTI_bil0_uni4 = 0
 (72)  GTI_bil0_uni5 = 0
 (73)  GTI_bil0_uni6 = 0
 (74)  GTI_bil0_uni7 = 0
 (75)  GTI_bil0_uni8 = 0
 (76)  GTI_bil0_uni9 = 0
 (77)  GTI_bil0_uni10 = 0
 (78)  GTI_bil0_uni11 = 0
 (79)  GTI_bil0_uni12 = 0
 (80)  GTI_bil0_uni13 = 0
 (81)  GTI_bil0_uni14 = 0
 (82)  GTI_bil0_uni15 = 0
 (83)  GTI_bil0_uni16 = 0
 (84)  GTI_bil0_uni17 = 0
 (85)  GTI_bil0_uni18 = 0
 (86)  GTI_bil0_uni19 = 0
 (87)  GTI_bil0_uni20 = 0
 (88)  GTI_bil0_uni21 = 0
 (89)  GTI_bil0_uni22 = 0
 (90)  GTI_bil0_uni23 = 0
 (91)  GTI_bil0_uni24 = 0
 (92)  GTI_bil0_uni25 = 0
 (93)  GTI_bil0_uni26 = 0
 (94)  GTI_bil0_uni27 = 0
 (95)  GTI_bil0_uni28 = 0
 (96)  GTI_bil0_uni29 = 0
 (97)  GTI_bil0_uni30 = 0
 (98)  GTI_bil0_uni31 = 0
 (99)  GTI_bil0_uni32 = 0
 (100)  GTI_bil0_uni33 = 0
 (101)  GTI_bil0_uni34 = 0
 (102)  GTI_bil0_uni35 = 0
 (103)  GTI_bil0_uni36 = 0
 (104)  GTI_bil0_uni37 = 0
 (105)  GTI_bil0_uni38 = 0
 (106)  GTI_bil0_uni39 = 0
 (107)  GTI_bil0_uni40 = 0
 (108)  GTI_bil0_uni41 = 0
 (109)  GTI_bil0_uni42 = 0
 (110)  GTI_bil0_uni43 = 0
 (111)  GTI_bil0_uni44 = 0
 (112)  GTI_bil0_uni45 = 0
 (113)  GTI_bil0_uni46 = 0
 (114)  GTI_bil0_uni47 = 0
 (115)  GTI_bil0_uni48 = 0
 (116)  GTI_bil0_uni49 = 0
 (117)  GTI_bil0_uni50 = 0
 (118)  GTI_bil0_uni51 = 0
 (119)  GTI_bil0_uni52 = 0
 (120)  GTI_bil0_uni53 = 0
 (121)  GTI_bil0_uni54 = 0
 (122)  GTI_bil0_uni55 = 0
 (123)  GTI_bil0_uni56 = 0
 (124)  GTI_bil0_uni57 = 0
 (125)  GTI_bil0_uni58 = 0
 (126)  GTI_bil0_uni59 = 0
 (127)  GTI_bil0_uni60 = 0
 (128)  GTI_bil0_uni61 = 0
 (129)  GTI_bil0_uni62 = 0
 (130)  GTI_bil0_uni63 = 0
 (131)  GTI_bil0_uni64 = 0
 (132)  GTI_bil0_uni65 = 0
 (133)  GTI_bil0_uni66 = 0
 (134)  GTI_bil0_uni67 = 0

       F(134, 17815) =    2.01
            Prob > F =    0.0000

. 
. 
. 
. *** For comparison, what is the performance of the estimators without the GWP questions but run on this subsample?
. * Table A3: Robustness II: Bilateral model including Google Trends Indices on Gallup World Poll sample
. //destination, origin, year FE (a la Mayda 2009)
. regxfe fwd_log_mig  $basic if $sample1, fe(iso3n_o iso3n_d year)  cluster(pair_id)  
Transforming the data
........
Estimating redundant parameters
....
Number of redundant parameters: 2

                                                 Number of obs      =    21855
                                                 F_xb (    4, 21706)=   13.250
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.7332
                                                 R2-Within          =   0.0014
                                                 # redundant FE     =        2
                           (Std. Err. adjusted for 2,611 clusters in _pair_id)
------------------------------------------------------------------------------
             |               Robust
 fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   o_log_gdp |  -.5624913   .1044816    -5.38   0.000    -.7672829   -.3576997
   o_log_pop |   .6335624   .2836913     2.23   0.026     .0775067    1.189618
   d_log_gdp |   .4378558   .2185748     2.00   0.045     .0094331    .8662785
   d_log_pop |  -1.875368   .3603991    -5.20   0.000    -2.581777    -1.16896
       _cons |   6.008181   1.477807     4.07   0.000      3.11157    8.904791
------------------------------------------------------------------------------

. outreg2 using "$export\replication_TableA3.xls", replace label excel tex ctitle("Benchmark, Mayda") adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.xls
dir : seeout

. regxfe fwd_log_mig $bil_GTI_spec $basic if $sample1, fe(iso3n_o iso3n_d year)  cluster(pair_id)
Transforming the data
.........
Estimating redundant parameters
....
Number of redundant parameters: 2

                                                 Number of obs      =    21855
                                                 F_xb (  138, 21572)=   38.950
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.8065
                                                 R2-Within          =   0.2758
                                                 # redundant FE     =        2
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     GTI_bil_0 |   .0932653   .0064211    14.52   0.000     .0806796     .105851
     GTI_bil_1 |   .0641611   .0994534     0.65   0.519     -.130775    .2590972
     GTI_bil_2 |  -.0025008     .00892    -0.28   0.779    -.0199846     .014983
     GTI_bil_3 |  -.0113345   .0274496    -0.41   0.680    -.0651378    .0424689
     GTI_bil_4 |   .0103207   .0123247     0.84   0.402    -.0138367     .034478
     GTI_bil_5 |  -.0216613    .010259    -2.11   0.035    -.0417698   -.0015529
     GTI_bil_6 |    .013745   .0061951     2.22   0.027     .0016021    .0258879
     GTI_bil_7 |   .0232278    .013841     1.68   0.093    -.0039015    .0503571
     GTI_bil_8 |   .0151725   .0082762     1.83   0.067    -.0010495    .0313944
     GTI_bil_9 |   .0381285    .037628     1.01   0.311    -.0356251    .1118822
    GTI_bil_10 |   .0151466   .0037621     4.03   0.000     .0077725    .0225206
    GTI_bil_12 |   .0160685   .0155929     1.03   0.303    -.0144947    .0466317
    GTI_bil_13 |   .0034779   .0189203     0.18   0.854    -.0336074    .0405632
    GTI_bil_14 |   .0024375   .0058425     0.42   0.677    -.0090141    .0138892
    GTI_bil_15 |  -.0326867   .0179997    -1.82   0.069    -.0679674    .0025941
    GTI_bil_16 |   .0018477   .0090359     0.20   0.838    -.0158634    .0195588
    GTI_bil_17 |   .0107015    .013081     0.82   0.413    -.0149382    .0363412
    GTI_bil_18 |  -.0061906   .0070053    -0.88   0.377    -.0199216    .0075403
    GTI_bil_19 |  -.0256502   .0202326    -1.27   0.205    -.0653077    .0140073
    GTI_bil_20 |  -.0163852   .0094472    -1.73   0.083    -.0349024     .002132
    GTI_bil_21 |   .0273437   .0226405     1.21   0.227    -.0170334    .0717208
    GTI_bil_22 |   .0269245   .0098207     2.74   0.006     .0076752    .0461738
    GTI_bil_23 |  -.0358611     .01553    -2.31   0.021    -.0663011   -.0054212
    GTI_bil_24 |  -.0349645   .0110925    -3.15   0.002    -.0567067   -.0132223
    GTI_bil_25 |   .0048635   .0073647     0.66   0.509    -.0095718    .0192988
    GTI_bil_26 |  -.0154152   .0103065    -1.50   0.135    -.0356167    .0047863
    GTI_bil_27 |  -.0349051   .0106088    -3.29   0.001    -.0556992   -.0141111
    GTI_bil_28 |   .0546615   .0353324     1.55   0.122    -.0145927    .1239157
    GTI_bil_29 |   .0048324   .0107913     0.45   0.654    -.0163193    .0259842
    GTI_bil_30 |    -.02195   .0108698    -2.02   0.043    -.0432556   -.0006443
    GTI_bil_31 |  -.1859945   .0411867    -4.52   0.000    -.2667234   -.1052655
    GTI_bil_32 |   .0008524   .0085145     0.10   0.920    -.0158366    .0175414
    GTI_bil_33 |   .0022827    .079098     0.03   0.977    -.1527552    .1573205
    GTI_bil_34 |   .1932334   .0514004     3.76   0.000     .0924849     .293982
    GTI_bil_35 |  -.0589332   .0660262    -0.89   0.372    -.1883495    .0704831
    GTI_bil_36 |    .021358   .0045221     4.72   0.000     .0124944    .0302216
    GTI_bil_37 |  -.0128081   .0099788    -1.28   0.199    -.0323672     .006751
    GTI_bil_38 |   -.017788   .0079564    -2.24   0.025    -.0333832   -.0021929
    GTI_bil_39 |  -.0184085   .0093438    -1.97   0.049    -.0367229    -.000094
    GTI_bil_40 |  -.0090906    .020608    -0.44   0.659    -.0494839    .0313027
    GTI_bil_41 |   .0064929   .0090819     0.71   0.475    -.0113082     .024294
    GTI_bil_42 |  -.3059034   .1865471    -1.64   0.101    -.6715496    .0597428
    GTI_bil_43 |  -.0351651   .0123465    -2.85   0.004    -.0593651   -.0109651
    GTI_bil_44 |   .0027316   .0086746     0.31   0.753    -.0142712    .0197345
    GTI_bil_45 |  -.0058184   .0082574    -0.70   0.481    -.0220036    .0103667
    GTI_bil_46 |    .004419   .0091953     0.48   0.631    -.0136045    .0224426
    GTI_bil_47 |  -.0091095   .0105134    -0.87   0.386    -.0297166    .0114976
    GTI_bil_48 |   -.007439   .0171484    -0.43   0.664    -.0410511    .0261731
    GTI_bil_49 |   .0058839   .0121937     0.48   0.629    -.0180167    .0297845
    GTI_bil_50 |    .039483   .0132012     2.99   0.003     .0136076    .0653583
    GTI_bil_51 |  -.0023052   .0072203    -0.32   0.750    -.0164574    .0118471
    GTI_bil_52 |    .034118   .0044309     7.70   0.000      .025433     .042803
    GTI_bil_53 |     .01081   .0149348     0.72   0.469    -.0184634    .0400833
    GTI_bil_54 |  -.0284047   .0073638    -3.86   0.000    -.0428383   -.0139711
    GTI_bil_55 |   .0238607   .0093207     2.56   0.010     .0055914      .04213
    GTI_bil_56 |  -.0088407   .0278212    -0.32   0.751    -.0633723     .045691
    GTI_bil_57 |  -.0025282   .0063807    -0.40   0.692    -.0150349    .0099784
    GTI_bil_58 |  -.0185807   .0111139    -1.67   0.095    -.0403648    .0032033
    GTI_bil_59 |   .0155103   .0124656     1.24   0.213    -.0089232    .0399438
    GTI_bil_60 |  -.1639668   .0583949    -2.81   0.005    -.2784252   -.0495085
    GTI_bil_61 |   .0353278    .006656     5.31   0.000     .0222816    .0483739
    GTI_bil_62 |   .0093303   .0062293     1.50   0.134    -.0028797    .0215402
    GTI_bil_63 |  -.0259155   .0179168    -1.45   0.148    -.0610337    .0092027
    GTI_bil_64 |  -.0100978   .0056223    -1.80   0.073    -.0211179    .0009223
    GTI_bil_65 |  -.0551919   .0208132    -2.65   0.008    -.0959873   -.0143964
    GTI_bil_66 |  -.0105724    .006529    -1.62   0.105    -.0233698     .002225
    GTI_bil_67 |   .0397504   .0275804     1.44   0.150    -.0143092    .0938101
 GTI_bil0_uni1 |    .000364   .0001011     3.60   0.000     .0001659    .0005621
 GTI_bil0_uni2 |   .0001185   .0000883     1.34   0.180    -.0000546    .0002916
 GTI_bil0_uni3 |   .0001216   .0000888     1.37   0.171    -.0000525    .0002957
 GTI_bil0_uni4 |   .0000156   .0001579     0.10   0.922     -.000294    .0003251
 GTI_bil0_uni5 |  -5.08e-06   .0000764    -0.07   0.947    -.0001548    .0001447
 GTI_bil0_uni6 |  -.0000105   .0000869    -0.12   0.904    -.0001808    .0001599
 GTI_bil0_uni7 |  -.0001017   .0000977    -1.04   0.298    -.0002931    .0000898
 GTI_bil0_uni8 |  -.0002654   .0000946    -2.80   0.005    -.0004509   -.0000798
 GTI_bil0_uni9 |   .0000183   .0000754     0.24   0.808    -.0001296    .0001662
GTI_bil0_uni10 |  -.0001406   .0000858    -1.64   0.101    -.0003088    .0000276
GTI_bil0_uni11 |   .0003065   .0000966     3.17   0.002     .0001171    .0004958
GTI_bil0_uni12 |   -.000277   .0000888    -3.12   0.002    -.0004511   -.0001029
GTI_bil0_uni13 |  -.0001786   .0001034    -1.73   0.084    -.0003812    .0000241
GTI_bil0_uni14 |   -.000178   .0000936    -1.90   0.057    -.0003615    5.43e-06
GTI_bil0_uni15 |   .0000705   .0000781     0.90   0.367    -.0000825    .0002235
GTI_bil0_uni16 |   -.000089    .000078    -1.14   0.254    -.0002419    .0000639
GTI_bil0_uni17 |   .0002379   .0000918     2.59   0.010     .0000581    .0004178
GTI_bil0_uni18 |  -.0001226     .00009    -1.36   0.173     -.000299    .0000539
GTI_bil0_uni19 |   .0003292   .0000953     3.45   0.001     .0001425     .000516
GTI_bil0_uni20 |   .0000901   .0001059     0.85   0.395    -.0001175    .0002976
GTI_bil0_uni21 |  -.0000929   .0001024    -0.91   0.364    -.0002936    .0001077
GTI_bil0_uni22 |   .0001652   .0000885     1.87   0.062    -8.31e-06    .0003388
GTI_bil0_uni23 |  -.0000552   .0000764    -0.72   0.470     -.000205    .0000945
GTI_bil0_uni24 |   .0001556   .0000896     1.74   0.083    -.0000201    .0003313
GTI_bil0_uni25 |   3.41e-06    .000075     0.05   0.964    -.0001436    .0001504
GTI_bil0_uni26 |   .0002846   .0000915     3.11   0.002     .0001053    .0004638
GTI_bil0_uni27 |  -.0000191   .0000904    -0.21   0.833    -.0001964    .0001582
GTI_bil0_uni28 |   -.000053   .0001334    -0.40   0.691    -.0003144    .0002085
GTI_bil0_uni29 |  -.0000104   .0000947    -0.11   0.912    -.0001961    .0001752
GTI_bil0_uni30 |    -.00011    .000101    -1.09   0.276    -.0003081    .0000881
GTI_bil0_uni31 |   .0000139   .0000792     0.18   0.860    -.0001412    .0001691
GTI_bil0_uni32 |   .0000971   .0000881     1.10   0.271    -.0000756    .0002698
GTI_bil0_uni33 |  -.0000707   .0001023    -0.69   0.490    -.0002713    .0001298
GTI_bil0_uni34 |  -.0001226   .0001101    -1.11   0.265    -.0003385    .0000932
GTI_bil0_uni35 |  -.0000239   .0001086    -0.22   0.826    -.0002369     .000189
GTI_bil0_uni36 |    -.00007   .0000844    -0.83   0.407    -.0002354    .0000955
GTI_bil0_uni37 |  -.0000168    .000094    -0.18   0.858     -.000201    .0001675
GTI_bil0_uni38 |  -.0001893   .0001034    -1.83   0.067    -.0003921    .0000134
GTI_bil0_uni39 |  -.0005187   .0001113    -4.66   0.000    -.0007369   -.0003004
GTI_bil0_uni40 |  -.0003474   .0001019    -3.41   0.001    -.0005471   -.0001476
GTI_bil0_uni41 |   .0001304    .000103     1.27   0.205    -.0000715    .0003323
GTI_bil0_uni42 |   .0000971   .0001028     0.94   0.345    -.0001045    .0002986
GTI_bil0_uni43 |   .0000102   .0001029     0.10   0.921    -.0001915    .0002119
GTI_bil0_uni44 |  -.0000749   .0000989    -0.76   0.449    -.0002688    .0001189
GTI_bil0_uni45 |   .0000388   .0000873     0.44   0.657    -.0001324      .00021
GTI_bil0_uni46 |   .0001758   .0000723     2.43   0.015      .000034    .0003176
GTI_bil0_uni47 |  -.0000409   .0001063    -0.39   0.700    -.0002493    .0001674
GTI_bil0_uni48 |   .0001575   .0000839     1.88   0.060    -6.93e-06     .000322
GTI_bil0_uni49 |   .0000885   .0000924     0.96   0.338    -.0000925    .0002696
GTI_bil0_uni50 |  -.0001622   .0000692    -2.34   0.019    -.0002978   -.0000266
GTI_bil0_uni51 |  -.0001329   .0000661    -2.01   0.044    -.0002625   -3.42e-06
GTI_bil0_uni52 |    -.00012   .0000911    -1.32   0.188    -.0002987    .0000586
GTI_bil0_uni53 |  -.0001805   .0000805    -2.24   0.025    -.0003384   -.0000227
GTI_bil0_uni54 |   .0000591   .0001013     0.58   0.559    -.0001394    .0002576
GTI_bil0_uni55 |  -.0000314   .0000958    -0.33   0.743    -.0002193    .0001564
GTI_bil0_uni56 |   .0000413   .0000756     0.55   0.585    -.0001069    .0001895
GTI_bil0_uni57 |  -.0003301   .0000795    -4.15   0.000    -.0004859   -.0001743
GTI_bil0_uni58 |   .0000872    .000065     1.34   0.179    -.0000401    .0002145
GTI_bil0_uni59 |   .0002713    .000065     4.18   0.000     .0001439    .0003987
GTI_bil0_uni60 |  -.0001297     .00009    -1.44   0.149    -.0003061    .0000466
GTI_bil0_uni61 |   .0000485   .0001112     0.44   0.663    -.0001695    .0002664
GTI_bil0_uni62 |  -.0000988   .0000844    -1.17   0.242    -.0002642    .0000667
GTI_bil0_uni63 |  -.0002017   .0000925    -2.18   0.029     -.000383   -.0000203
GTI_bil0_uni64 |  -.0001466   .0000795    -1.85   0.065    -.0003023    9.13e-06
GTI_bil0_uni65 |  -.0000534   .0000799    -0.67   0.504      -.00021    .0001032
GTI_bil0_uni66 |   .0000933   .0000859     1.09   0.277    -.0000751    .0002617
GTI_bil0_uni67 |  -.0001227   .0000818    -1.50   0.133    -.0002829    .0000376
     o_log_gdp |  -.1555373   .1200472    -1.30   0.195    -.3908386    .0797641
     o_log_pop |   1.436823   .3260274     4.41   0.000      .797785    2.075861
     d_log_gdp |   .0783549   .2410349     0.33   0.745    -.3940914    .5508013
     d_log_pop |  -.0816829    .438146    -0.19   0.852    -.9404815    .7771156
         _cons |   .3332395   1.666157     0.20   0.841    -2.932551     3.59903
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_TableA3.xls", append label excel tex ctitle("GTI, Mayda")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.xls
dir : seeout

. test GTI_bil_0 GTI_bil_1 GTI_bil_2 GTI_bil_3 GTI_bil_4 GTI_bil_5 GTI_bil_6 GTI_bil_7 GTI_bil_8 GTI_bil_9 GTI_bil_10 GTI_bil_12 GTI_bil_13 GTI_bil_14 GTI_bil_15 
> GTI_bil_16 GTI_bil_17 GTI_bil_18 GTI_bil_19 GTI_bil_20 GTI_bil_21 GTI_bil_22 GTI_bil_23 GTI_bil_24 GTI_bil_25 GTI_bil_26 GTI_bil_27 GTI_bil_28 GTI_bil_29 GTI_bi
> l_30 GTI_bil_31 GTI_bil_32 GTI_bil_33 GTI_bil_34 GTI_bil_35 GTI_bil_36 GTI_bil_37 GTI_bil_38 GTI_bil_39 GTI_bil_40 GTI_bil_41 GTI_bil_42 GTI_bil_43 GTI_bil_44 G
> TI_bil_45 GTI_bil_46 GTI_bil_47 GTI_bil_48 GTI_bil_49 GTI_bil_50 GTI_bil_51 GTI_bil_52 GTI_bil_53 GTI_bil_54 GTI_bil_55 GTI_bil_56 GTI_bil_57 GTI_bil_58 GTI_bil
> _59 GTI_bil_60 GTI_bil_61 GTI_bil_62 GTI_bil_63 GTI_bil_64 GTI_bil_65 GTI_bil_66 GTI_bil_67 GTI_bil0_uni1 GTI_bil0_uni2 GTI_bil0_uni3 GTI_bil0_uni4 GTI_bil0_uni
> 5 GTI_bil0_uni6 GTI_bil0_uni7 GTI_bil0_uni8 GTI_bil0_uni9 GTI_bil0_uni10 GTI_bil0_uni11 GTI_bil0_uni12 GTI_bil0_uni13 GTI_bil0_uni14 GTI_bil0_uni15 GTI_bil0_uni
> 16 GTI_bil0_uni17 GTI_bil0_uni18 GTI_bil0_uni19 GTI_bil0_uni20 GTI_bil0_uni21 GTI_bil0_uni22 GTI_bil0_uni23 GTI_bil0_uni24 GTI_bil0_uni25 GTI_bil0_uni26 GTI_bil
> 0_uni27 GTI_bil0_uni28 GTI_bil0_uni29 GTI_bil0_uni30 GTI_bil0_uni31 GTI_bil0_uni32 GTI_bil0_uni33 GTI_bil0_uni34 GTI_bil0_uni35 GTI_bil0_uni36 GTI_bil0_uni37 GT
> I_bil0_uni38 GTI_bil0_uni39 GTI_bil0_uni40 GTI_bil0_uni41 GTI_bil0_uni42 GTI_bil0_uni43 GTI_bil0_uni44 GTI_bil0_uni45 GTI_bil0_uni46 GTI_bil0_uni47 GTI_bil0_uni
> 48 GTI_bil0_uni49 GTI_bil0_uni50 GTI_bil0_uni51 GTI_bil0_uni52 GTI_bil0_uni53 GTI_bil0_uni54 GTI_bil0_uni55 GTI_bil0_uni56 GTI_bil0_uni57 GTI_bil0_uni58 GTI_bil
> 0_uni59 GTI_bil0_uni60 GTI_bil0_uni61 GTI_bil0_uni62 GTI_bil0_uni63 GTI_bil0_uni64 GTI_bil0_uni65 GTI_bil0_uni66 GTI_bil0_uni67                                 

 ( 1)  GTI_bil_0 = 0
 ( 2)  GTI_bil_1 = 0
 ( 3)  GTI_bil_2 = 0
 ( 4)  GTI_bil_3 = 0
 ( 5)  GTI_bil_4 = 0
 ( 6)  GTI_bil_5 = 0
 ( 7)  GTI_bil_6 = 0
 ( 8)  GTI_bil_7 = 0
 ( 9)  GTI_bil_8 = 0
 (10)  GTI_bil_9 = 0
 (11)  GTI_bil_10 = 0
 (12)  GTI_bil_12 = 0
 (13)  GTI_bil_13 = 0
 (14)  GTI_bil_14 = 0
 (15)  GTI_bil_15 = 0
 (16)  GTI_bil_16 = 0
 (17)  GTI_bil_17 = 0
 (18)  GTI_bil_18 = 0
 (19)  GTI_bil_19 = 0
 (20)  GTI_bil_20 = 0
 (21)  GTI_bil_21 = 0
 (22)  GTI_bil_22 = 0
 (23)  GTI_bil_23 = 0
 (24)  GTI_bil_24 = 0
 (25)  GTI_bil_25 = 0
 (26)  GTI_bil_26 = 0
 (27)  GTI_bil_27 = 0
 (28)  GTI_bil_28 = 0
 (29)  GTI_bil_29 = 0
 (30)  GTI_bil_30 = 0
 (31)  GTI_bil_31 = 0
 (32)  GTI_bil_32 = 0
 (33)  GTI_bil_33 = 0
 (34)  GTI_bil_34 = 0
 (35)  GTI_bil_35 = 0
 (36)  GTI_bil_36 = 0
 (37)  GTI_bil_37 = 0
 (38)  GTI_bil_38 = 0
 (39)  GTI_bil_39 = 0
 (40)  GTI_bil_40 = 0
 (41)  GTI_bil_41 = 0
 (42)  GTI_bil_42 = 0
 (43)  GTI_bil_43 = 0
 (44)  GTI_bil_44 = 0
 (45)  GTI_bil_45 = 0
 (46)  GTI_bil_46 = 0
 (47)  GTI_bil_47 = 0
 (48)  GTI_bil_48 = 0
 (49)  GTI_bil_49 = 0
 (50)  GTI_bil_50 = 0
 (51)  GTI_bil_51 = 0
 (52)  GTI_bil_52 = 0
 (53)  GTI_bil_53 = 0
 (54)  GTI_bil_54 = 0
 (55)  GTI_bil_55 = 0
 (56)  GTI_bil_56 = 0
 (57)  GTI_bil_57 = 0
 (58)  GTI_bil_58 = 0
 (59)  GTI_bil_59 = 0
 (60)  GTI_bil_60 = 0
 (61)  GTI_bil_61 = 0
 (62)  GTI_bil_62 = 0
 (63)  GTI_bil_63 = 0
 (64)  GTI_bil_64 = 0
 (65)  GTI_bil_65 = 0
 (66)  GTI_bil_66 = 0
 (67)  GTI_bil_67 = 0
 (68)  GTI_bil0_uni1 = 0
 (69)  GTI_bil0_uni2 = 0
 (70)  GTI_bil0_uni3 = 0
 (71)  GTI_bil0_uni4 = 0
 (72)  GTI_bil0_uni5 = 0
 (73)  GTI_bil0_uni6 = 0
 (74)  GTI_bil0_uni7 = 0
 (75)  GTI_bil0_uni8 = 0
 (76)  GTI_bil0_uni9 = 0
 (77)  GTI_bil0_uni10 = 0
 (78)  GTI_bil0_uni11 = 0
 (79)  GTI_bil0_uni12 = 0
 (80)  GTI_bil0_uni13 = 0
 (81)  GTI_bil0_uni14 = 0
 (82)  GTI_bil0_uni15 = 0
 (83)  GTI_bil0_uni16 = 0
 (84)  GTI_bil0_uni17 = 0
 (85)  GTI_bil0_uni18 = 0
 (86)  GTI_bil0_uni19 = 0
 (87)  GTI_bil0_uni20 = 0
 (88)  GTI_bil0_uni21 = 0
 (89)  GTI_bil0_uni22 = 0
 (90)  GTI_bil0_uni23 = 0
 (91)  GTI_bil0_uni24 = 0
 (92)  GTI_bil0_uni25 = 0
 (93)  GTI_bil0_uni26 = 0
 (94)  GTI_bil0_uni27 = 0
 (95)  GTI_bil0_uni28 = 0
 (96)  GTI_bil0_uni29 = 0
 (97)  GTI_bil0_uni30 = 0
 (98)  GTI_bil0_uni31 = 0
 (99)  GTI_bil0_uni32 = 0
 (100)  GTI_bil0_uni33 = 0
 (101)  GTI_bil0_uni34 = 0
 (102)  GTI_bil0_uni35 = 0
 (103)  GTI_bil0_uni36 = 0
 (104)  GTI_bil0_uni37 = 0
 (105)  GTI_bil0_uni38 = 0
 (106)  GTI_bil0_uni39 = 0
 (107)  GTI_bil0_uni40 = 0
 (108)  GTI_bil0_uni41 = 0
 (109)  GTI_bil0_uni42 = 0
 (110)  GTI_bil0_uni43 = 0
 (111)  GTI_bil0_uni44 = 0
 (112)  GTI_bil0_uni45 = 0
 (113)  GTI_bil0_uni46 = 0
 (114)  GTI_bil0_uni47 = 0
 (115)  GTI_bil0_uni48 = 0
 (116)  GTI_bil0_uni49 = 0
 (117)  GTI_bil0_uni50 = 0
 (118)  GTI_bil0_uni51 = 0
 (119)  GTI_bil0_uni52 = 0
 (120)  GTI_bil0_uni53 = 0
 (121)  GTI_bil0_uni54 = 0
 (122)  GTI_bil0_uni55 = 0
 (123)  GTI_bil0_uni56 = 0
 (124)  GTI_bil0_uni57 = 0
 (125)  GTI_bil0_uni58 = 0
 (126)  GTI_bil0_uni59 = 0
 (127)  GTI_bil0_uni60 = 0
 (128)  GTI_bil0_uni61 = 0
 (129)  GTI_bil0_uni62 = 0
 (130)  GTI_bil0_uni63 = 0
 (131)  GTI_bil0_uni64 = 0
 (132)  GTI_bil0_uni65 = 0
 (133)  GTI_bil0_uni66 = 0
 (134)  GTI_bil0_uni67 = 0

       F(134, 21572) =   39.80
            Prob > F =    0.0000

. 
. //originXyear, destination (multilateral resistance Ortega and Peri 2013)
. regxfe fwd_log_mig d_log_gdp d_log_pop  if $sample1, fe(iso3n_oXyear iso3n_d) cluster(pair_id)
Transforming the data
........
Estimating redundant parameters
.
Number of redundant parameters: 1

                                                 Number of obs      =    21855
                                                 F_xb (    2, 20732)=   13.238
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.7388
                                                 R2-Within          =   0.0006
                                                 # redundant FE     =        1
                           (Std. Err. adjusted for 2,611 clusters in _pair_id)
------------------------------------------------------------------------------
             |               Robust
 fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   d_log_gdp |   .4906642   .2242188     2.19   0.029     .0511777    .9301508
   d_log_pop |  -1.817123   .3551143    -5.12   0.000    -2.513175   -1.121071
       _cons |   5.043498   1.371845     3.68   0.000     2.354574    7.732422
------------------------------------------------------------------------------

. outreg2 using "$export\replication_TableA3.xls", append label excel tex ctitle("Benchmark, OP")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.xls
dir : seeout

. regxfe fwd_log_mig  d_log_gdp d_log_pop $bil_GTI_spec if $sample1, fe(iso3n_oXyear iso3n_d) cluster(pair_id)
Transforming the data
.........
Estimating redundant parameters
.
Number of redundant parameters: 1

                                                 Number of obs      =    21855
                                                 F_xb (  136, 20598)=   43.085
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.8175
                                                 R2-Within          =   0.3017
                                                 # redundant FE     =        1
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     d_log_gdp |   .1142223   .2504627     0.46   0.648    -.3767044    .6051491
     d_log_pop |  -.0066735    .432108    -0.02   0.988    -.8536393    .8402923
     GTI_bil_0 |   .0921068    .008384    10.99   0.000     .0756736      .10854
     GTI_bil_1 |   .1179017   .0876054     1.35   0.178    -.0538118    .2896151
     GTI_bil_2 |   .0096092   .0203255     0.47   0.636    -.0302303    .0494487
     GTI_bil_3 |  -.0165698    .028262    -0.59   0.558    -.0719655    .0388259
     GTI_bil_4 |   .1297658   .0733336     1.77   0.077    -.0139739    .2735056
     GTI_bil_5 |   -.021551   .0101484    -2.12   0.034    -.0414427   -.0016594
     GTI_bil_6 |   .0124073   .0063562     1.95   0.051    -.0000513    .0248658
     GTI_bil_7 |   .0182841   .0130526     1.40   0.161    -.0072999    .0438681
     GTI_bil_8 |    .039404   .0154257     2.55   0.011     .0091684    .0696396
     GTI_bil_9 |   .0271656   .0396337     0.69   0.493    -.0505195    .1048507
    GTI_bil_10 |   .0137324   .0038931     3.53   0.000     .0061017    .0213632
    GTI_bil_12 |   .0157618   .0155252     1.02   0.310    -.0146688    .0461925
    GTI_bil_13 |   .0069132   .0188551     0.37   0.714    -.0300443    .0438707
    GTI_bil_14 |  -.0090445   .0098232    -0.92   0.357    -.0282988    .0102097
    GTI_bil_15 |  -.0286802   .0186547    -1.54   0.124     -.065245    .0078845
    GTI_bil_16 |  -.0055187   .0124511    -0.44   0.658    -.0299239    .0188865
    GTI_bil_17 |   .0061664   .0130355     0.47   0.636    -.0193842     .031717
    GTI_bil_18 |   -.007373   .0072748    -1.01   0.311    -.0216322    .0068862
    GTI_bil_19 |  -.0293496   .0169704    -1.73   0.084    -.0626129    .0039138
    GTI_bil_20 |  -.0166687    .019049    -0.88   0.382    -.0540064    .0206689
    GTI_bil_21 |    .033896   .0237116     1.43   0.153    -.0125806    .0803725
    GTI_bil_22 |   .0435847    .015704     2.78   0.006     .0128035    .0743659
    GTI_bil_23 |  -.0309709   .0154761    -2.00   0.045    -.0613052   -.0006366
    GTI_bil_24 |  -.0489645    .023752    -2.06   0.039    -.0955204   -.0024086
    GTI_bil_25 |    .003685   .0073413     0.50   0.616    -.0107046    .0180745
    GTI_bil_26 |   .0058303   .0215882     0.27   0.787    -.0364842    .0481448
    GTI_bil_27 |  -.0461964   .0169741    -2.72   0.007     -.079467   -.0129257
    GTI_bil_28 |   .0479964   .0383782     1.25   0.211    -.0272279    .1232208
    GTI_bil_29 |   .0043613   .0107109     0.41   0.684     -.016633    .0253555
    GTI_bil_30 |  -.0445766   .0170616    -2.61   0.009    -.0780186   -.0111346
    GTI_bil_31 |  -.1845521    .038765    -4.76   0.000    -.2605346   -.1085697
    GTI_bil_32 |   -.000626   .0100026    -0.06   0.950    -.0202319    .0189798
    GTI_bil_33 |   .0510605   .0749084     0.68   0.495    -.0957659    .1978869
    GTI_bil_34 |   .1573239   .0461687     3.41   0.001     .0668295    .2478183
    GTI_bil_35 |  -.0384731   .0763876    -0.50   0.615    -.1881988    .1112527
    GTI_bil_36 |   .0191774   .0045891     4.18   0.000     .0101825    .0281723
    GTI_bil_37 |  -.0462395   .0191733    -2.41   0.016    -.0838208   -.0086583
    GTI_bil_38 |  -.0250509    .015452    -1.62   0.105    -.0553381    .0052363
    GTI_bil_39 |  -.0161221   .0097718    -1.65   0.099    -.0352755    .0030314
    GTI_bil_40 |   .0065637   .0190828     0.34   0.731    -.0308401    .0439676
    GTI_bil_41 |   .0123789   .0149811     0.83   0.409    -.0169852    .0417431
    GTI_bil_42 |  -.3357734   .1979879    -1.70   0.090    -.7238453    .0522985
    GTI_bil_43 |  -.1061625   .0271325    -3.91   0.000    -.1593444   -.0529805
    GTI_bil_44 |   .0014995   .0087488     0.17   0.864    -.0156489    .0186479
    GTI_bil_45 |  -.0620745   .0189259    -3.28   0.001    -.0991707   -.0249783
    GTI_bil_46 |   .0047779   .0094344     0.51   0.613    -.0137143    .0232701
    GTI_bil_47 |   -.006491   .0102882    -0.63   0.528    -.0266566    .0136747
    GTI_bil_48 |   .0004745   .0180215     0.03   0.979     -.034849     .035798
    GTI_bil_49 |   .0036424   .0126359     0.29   0.773     -.021125    .0284098
    GTI_bil_50 |   .0392669   .0128985     3.04   0.002     .0139848    .0645491
    GTI_bil_51 |  -.0000174   .0158858    -0.00   0.999    -.0311548    .0311201
    GTI_bil_52 |   .0429422    .005446     7.89   0.000     .0322675    .0536169
    GTI_bil_53 |   .0036933   .0157382     0.23   0.814    -.0271549    .0345415
    GTI_bil_54 |  -.0475176   .0164016    -2.90   0.004    -.0796661   -.0153692
    GTI_bil_55 |   .0163733   .0097328     1.68   0.093    -.0027038    .0354505
    GTI_bil_56 |  -.0114286   .0254015    -0.45   0.653    -.0612175    .0383602
    GTI_bil_57 |   .0056117   .0149237     0.38   0.707    -.0236399    .0348634
    GTI_bil_58 |  -.0205026   .0127644    -1.61   0.108    -.0455219    .0045167
    GTI_bil_59 |   .0128732   .0123706     1.04   0.298     -.011374    .0371205
    GTI_bil_60 |  -.0941837   .0504602    -1.87   0.062    -.1930897    .0047222
    GTI_bil_61 |   .0456876   .0088956     5.14   0.000     .0282516    .0631237
    GTI_bil_62 |   .0146536   .0100086     1.46   0.143    -.0049641    .0342714
    GTI_bil_63 |  -.0251392   .0170671    -1.47   0.141    -.0585922    .0083137
    GTI_bil_64 |   -.026917   .0110864    -2.43   0.015    -.0486472   -.0051867
    GTI_bil_65 |  -.0512394   .0206308    -2.48   0.013    -.0916775   -.0108014
    GTI_bil_66 |   .0174897   .0106614     1.64   0.101    -.0034075    .0383868
    GTI_bil_67 |    .039022    .027091     1.44   0.150    -.0140786    .0921226
 GTI_bil0_uni1 |   .0003843   .0001701     2.26   0.024     .0000508    .0007178
 GTI_bil0_uni2 |   .0001195   .0001342     0.89   0.373    -.0001436    .0003826
 GTI_bil0_uni3 |   1.74e-06   .0001713     0.01   0.992     -.000334    .0003375
 GTI_bil0_uni4 |   .0000665    .000266     0.25   0.803    -.0004548    .0005878
 GTI_bil0_uni5 |   -.000141   .0001344    -1.05   0.294    -.0004044    .0001224
 GTI_bil0_uni6 |  -.0001681   .0001439    -1.17   0.243    -.0004502     .000114
 GTI_bil0_uni7 |  -.0001436   .0001556    -0.92   0.356    -.0004486    .0001613
 GTI_bil0_uni8 |  -.0003724   .0001707    -2.18   0.029    -.0007071   -.0000378
 GTI_bil0_uni9 |   .0001289   .0001418     0.91   0.363     -.000149    .0004069
GTI_bil0_uni10 |  -.0002643   .0001442    -1.83   0.067     -.000547    .0000184
GTI_bil0_uni11 |     .00037   .0001523     2.43   0.015     .0000715    .0006685
GTI_bil0_uni12 |  -.0002378   .0001668    -1.43   0.154    -.0005647     .000089
GTI_bil0_uni13 |  -.0001844   .0001649    -1.12   0.264    -.0005076    .0001389
GTI_bil0_uni14 |  -.0001118   .0001525    -0.73   0.464    -.0004108    .0001872
GTI_bil0_uni15 |  -.0001012   .0001352    -0.75   0.454    -.0003661    .0001637
GTI_bil0_uni16 |   .0002382   .0001426     1.67   0.095    -.0000414    .0005178
GTI_bil0_uni17 |   .0005855   .0001644     3.56   0.000     .0002632    .0009078
GTI_bil0_uni18 |  -.0002728   .0001593    -1.71   0.087    -.0005851    .0000395
GTI_bil0_uni19 |   .0006871   .0001756     3.91   0.000     .0003429    .0010314
GTI_bil0_uni20 |  -.0002353   .0001779    -1.32   0.186     -.000584    .0001134
GTI_bil0_uni21 |  -.0002525   .0001788    -1.41   0.158    -.0006029    .0000979
GTI_bil0_uni22 |   .0003991   .0001471     2.71   0.007     .0001108    .0006874
GTI_bil0_uni23 |  -.0002113   .0001363    -1.55   0.121    -.0004785    .0000559
GTI_bil0_uni24 |   .0003566   .0001595     2.24   0.025     .0000439    .0006694
GTI_bil0_uni25 |    .000075   .0001238     0.61   0.544    -.0001676    .0003177
GTI_bil0_uni26 |   .0003446   .0001537     2.24   0.025     .0000433    .0006458
GTI_bil0_uni27 |   .0001272   .0001536     0.83   0.408    -.0001739    .0004284
GTI_bil0_uni28 |  -.0000551   .0002415    -0.23   0.820    -.0005284    .0004183
GTI_bil0_uni29 |   .0003446   .0001699     2.03   0.043     .0000115    .0006777
GTI_bil0_uni30 |  -.0000745   .0001745    -0.43   0.670    -.0004165    .0002676
GTI_bil0_uni31 |   .0000416   .0001328     0.31   0.754    -.0002187    .0003019
GTI_bil0_uni32 |  -.0000904   .0001392    -0.65   0.516    -.0003632    .0001823
GTI_bil0_uni33 |  -.0004484   .0002034    -2.20   0.027     -.000847   -.0000498
GTI_bil0_uni34 |  -.0001142   .0001834    -0.62   0.533    -.0004738    .0002453
GTI_bil0_uni35 |  -.0000605    .000208    -0.29   0.771    -.0004681    .0003472
GTI_bil0_uni36 |   .0000814   .0001347     0.60   0.546    -.0001827    .0003454
GTI_bil0_uni37 |  -.0003682   .0001665    -2.21   0.027    -.0006946   -.0000418
GTI_bil0_uni38 |  -.0000696   .0001469    -0.47   0.635    -.0003576    .0002183
GTI_bil0_uni39 |  -.0004025   .0001577    -2.55   0.011    -.0007116   -.0000934
GTI_bil0_uni40 |   -.000596   .0001673    -3.56   0.000    -.0009239   -.0002682
GTI_bil0_uni41 |   .0002884    .000171     1.69   0.092    -.0000469    .0006236
GTI_bil0_uni42 |   .0002686   .0001899     1.41   0.157    -.0001037    .0006409
GTI_bil0_uni43 |   -.000054    .000175    -0.31   0.758     -.000397    .0002891
GTI_bil0_uni44 |  -.0001561   .0001515    -1.03   0.303    -.0004531    .0001409
GTI_bil0_uni45 |   .0003113   .0001604     1.94   0.052    -3.06e-06    .0006257
GTI_bil0_uni46 |   .0002695   .0001094     2.46   0.014     .0000551    .0004838
GTI_bil0_uni47 |    .000235   .0001716     1.37   0.171    -.0001013    .0005713
GTI_bil0_uni48 |   .0002453   .0001492     1.64   0.100     -.000047    .0005377
GTI_bil0_uni49 |   .0001665    .000157     1.06   0.289    -.0001412    .0004742
GTI_bil0_uni50 |  -.0003722   .0001233    -3.02   0.003    -.0006139   -.0001306
GTI_bil0_uni51 |  -.0001185    .000125    -0.95   0.343    -.0003635    .0001264
GTI_bil0_uni52 |  -.0001657   .0001375    -1.20   0.228    -.0004352    .0001038
GTI_bil0_uni53 |  -.0002104   .0001348    -1.56   0.119    -.0004746    .0000538
GTI_bil0_uni54 |  -.0000807   .0001597    -0.51   0.613    -.0003937    .0002324
GTI_bil0_uni55 |  -.0002764   .0001636    -1.69   0.091    -.0005971    .0000444
GTI_bil0_uni56 |   .0000261   .0001292     0.20   0.840     -.000227    .0002793
GTI_bil0_uni57 |  -.0006402   .0001282    -4.99   0.000    -.0008915   -.0003889
GTI_bil0_uni58 |   .0001385    .000113     1.23   0.220    -.0000829    .0003599
GTI_bil0_uni59 |   .0003286   .0001067     3.08   0.002     .0001194    .0005378
GTI_bil0_uni60 |  -.0000921   .0001567    -0.59   0.557    -.0003992     .000215
GTI_bil0_uni61 |  -.0001929   .0001582    -1.22   0.223    -.0005031    .0001172
GTI_bil0_uni62 |  -.0001665    .000134    -1.24   0.214    -.0004291    .0000961
GTI_bil0_uni63 |  -.0003091   .0001597    -1.94   0.053    -.0006221    3.97e-06
GTI_bil0_uni64 |  -.0000672   .0001283    -0.52   0.601    -.0003187    .0001844
GTI_bil0_uni65 |  -.0000349   .0001457    -0.24   0.811    -.0003206    .0002508
GTI_bil0_uni66 |   .0003509   .0001432     2.45   0.014     .0000703    .0006315
GTI_bil0_uni67 |  -.0000618   .0001336    -0.46   0.644    -.0003236    .0002001
         _cons |   1.768167   1.572752     1.12   0.261    -1.314551    4.850885
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_TableA3.xls", append label excel tex ctitle("GTI, OP")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.xls
dir : seeout

. test GTI_bil_0 GTI_bil_1 GTI_bil_2 GTI_bil_3 GTI_bil_4 GTI_bil_5 GTI_bil_6 GTI_bil_7 GTI_bil_8 GTI_bil_9 GTI_bil_10 GTI_bil_12 GTI_bil_13 GTI_bil_14 GTI_bil_15 
> GTI_bil_16 GTI_bil_17 GTI_bil_18 GTI_bil_19 GTI_bil_20 GTI_bil_21 GTI_bil_22 GTI_bil_23 GTI_bil_24 GTI_bil_25 GTI_bil_26 GTI_bil_27 GTI_bil_28 GTI_bil_29 GTI_bi
> l_30 GTI_bil_31 GTI_bil_32 GTI_bil_33 GTI_bil_34 GTI_bil_35 GTI_bil_36 GTI_bil_37 GTI_bil_38 GTI_bil_39 GTI_bil_40 GTI_bil_41 GTI_bil_42 GTI_bil_43 GTI_bil_44 G
> TI_bil_45 GTI_bil_46 GTI_bil_47 GTI_bil_48 GTI_bil_49 GTI_bil_50 GTI_bil_51 GTI_bil_52 GTI_bil_53 GTI_bil_54 GTI_bil_55 GTI_bil_56 GTI_bil_57 GTI_bil_58 GTI_bil
> _59 GTI_bil_60 GTI_bil_61 GTI_bil_62 GTI_bil_63 GTI_bil_64 GTI_bil_65 GTI_bil_66 GTI_bil_67 GTI_bil0_uni1 GTI_bil0_uni2 GTI_bil0_uni3 GTI_bil0_uni4 GTI_bil0_uni
> 5 GTI_bil0_uni6 GTI_bil0_uni7 GTI_bil0_uni8 GTI_bil0_uni9 GTI_bil0_uni10 GTI_bil0_uni11 GTI_bil0_uni12 GTI_bil0_uni13 GTI_bil0_uni14 GTI_bil0_uni15 GTI_bil0_uni
> 16 GTI_bil0_uni17 GTI_bil0_uni18 GTI_bil0_uni19 GTI_bil0_uni20 GTI_bil0_uni21 GTI_bil0_uni22 GTI_bil0_uni23 GTI_bil0_uni24 GTI_bil0_uni25 GTI_bil0_uni26 GTI_bil
> 0_uni27 GTI_bil0_uni28 GTI_bil0_uni29 GTI_bil0_uni30 GTI_bil0_uni31 GTI_bil0_uni32 GTI_bil0_uni33 GTI_bil0_uni34 GTI_bil0_uni35 GTI_bil0_uni36 GTI_bil0_uni37 GT
> I_bil0_uni38 GTI_bil0_uni39 GTI_bil0_uni40 GTI_bil0_uni41 GTI_bil0_uni42 GTI_bil0_uni43 GTI_bil0_uni44 GTI_bil0_uni45 GTI_bil0_uni46 GTI_bil0_uni47 GTI_bil0_uni
> 48 GTI_bil0_uni49 GTI_bil0_uni50 GTI_bil0_uni51 GTI_bil0_uni52 GTI_bil0_uni53 GTI_bil0_uni54 GTI_bil0_uni55 GTI_bil0_uni56 GTI_bil0_uni57 GTI_bil0_uni58 GTI_bil
> 0_uni59 GTI_bil0_uni60 GTI_bil0_uni61 GTI_bil0_uni62 GTI_bil0_uni63 GTI_bil0_uni64 GTI_bil0_uni65 GTI_bil0_uni66 GTI_bil0_uni67                                 

 ( 1)  GTI_bil_0 = 0
 ( 2)  GTI_bil_1 = 0
 ( 3)  GTI_bil_2 = 0
 ( 4)  GTI_bil_3 = 0
 ( 5)  GTI_bil_4 = 0
 ( 6)  GTI_bil_5 = 0
 ( 7)  GTI_bil_6 = 0
 ( 8)  GTI_bil_7 = 0
 ( 9)  GTI_bil_8 = 0
 (10)  GTI_bil_9 = 0
 (11)  GTI_bil_10 = 0
 (12)  GTI_bil_12 = 0
 (13)  GTI_bil_13 = 0
 (14)  GTI_bil_14 = 0
 (15)  GTI_bil_15 = 0
 (16)  GTI_bil_16 = 0
 (17)  GTI_bil_17 = 0
 (18)  GTI_bil_18 = 0
 (19)  GTI_bil_19 = 0
 (20)  GTI_bil_20 = 0
 (21)  GTI_bil_21 = 0
 (22)  GTI_bil_22 = 0
 (23)  GTI_bil_23 = 0
 (24)  GTI_bil_24 = 0
 (25)  GTI_bil_25 = 0
 (26)  GTI_bil_26 = 0
 (27)  GTI_bil_27 = 0
 (28)  GTI_bil_28 = 0
 (29)  GTI_bil_29 = 0
 (30)  GTI_bil_30 = 0
 (31)  GTI_bil_31 = 0
 (32)  GTI_bil_32 = 0
 (33)  GTI_bil_33 = 0
 (34)  GTI_bil_34 = 0
 (35)  GTI_bil_35 = 0
 (36)  GTI_bil_36 = 0
 (37)  GTI_bil_37 = 0
 (38)  GTI_bil_38 = 0
 (39)  GTI_bil_39 = 0
 (40)  GTI_bil_40 = 0
 (41)  GTI_bil_41 = 0
 (42)  GTI_bil_42 = 0
 (43)  GTI_bil_43 = 0
 (44)  GTI_bil_44 = 0
 (45)  GTI_bil_45 = 0
 (46)  GTI_bil_46 = 0
 (47)  GTI_bil_47 = 0
 (48)  GTI_bil_48 = 0
 (49)  GTI_bil_49 = 0
 (50)  GTI_bil_50 = 0
 (51)  GTI_bil_51 = 0
 (52)  GTI_bil_52 = 0
 (53)  GTI_bil_53 = 0
 (54)  GTI_bil_54 = 0
 (55)  GTI_bil_55 = 0
 (56)  GTI_bil_56 = 0
 (57)  GTI_bil_57 = 0
 (58)  GTI_bil_58 = 0
 (59)  GTI_bil_59 = 0
 (60)  GTI_bil_60 = 0
 (61)  GTI_bil_61 = 0
 (62)  GTI_bil_62 = 0
 (63)  GTI_bil_63 = 0
 (64)  GTI_bil_64 = 0
 (65)  GTI_bil_65 = 0
 (66)  GTI_bil_66 = 0
 (67)  GTI_bil_67 = 0
 (68)  GTI_bil0_uni1 = 0
 (69)  GTI_bil0_uni2 = 0
 (70)  GTI_bil0_uni3 = 0
 (71)  GTI_bil0_uni4 = 0
 (72)  GTI_bil0_uni5 = 0
 (73)  GTI_bil0_uni6 = 0
 (74)  GTI_bil0_uni7 = 0
 (75)  GTI_bil0_uni8 = 0
 (76)  GTI_bil0_uni9 = 0
 (77)  GTI_bil0_uni10 = 0
 (78)  GTI_bil0_uni11 = 0
 (79)  GTI_bil0_uni12 = 0
 (80)  GTI_bil0_uni13 = 0
 (81)  GTI_bil0_uni14 = 0
 (82)  GTI_bil0_uni15 = 0
 (83)  GTI_bil0_uni16 = 0
 (84)  GTI_bil0_uni17 = 0
 (85)  GTI_bil0_uni18 = 0
 (86)  GTI_bil0_uni19 = 0
 (87)  GTI_bil0_uni20 = 0
 (88)  GTI_bil0_uni21 = 0
 (89)  GTI_bil0_uni22 = 0
 (90)  GTI_bil0_uni23 = 0
 (91)  GTI_bil0_uni24 = 0
 (92)  GTI_bil0_uni25 = 0
 (93)  GTI_bil0_uni26 = 0
 (94)  GTI_bil0_uni27 = 0
 (95)  GTI_bil0_uni28 = 0
 (96)  GTI_bil0_uni29 = 0
 (97)  GTI_bil0_uni30 = 0
 (98)  GTI_bil0_uni31 = 0
 (99)  GTI_bil0_uni32 = 0
 (100)  GTI_bil0_uni33 = 0
 (101)  GTI_bil0_uni34 = 0
 (102)  GTI_bil0_uni35 = 0
 (103)  GTI_bil0_uni36 = 0
 (104)  GTI_bil0_uni37 = 0
 (105)  GTI_bil0_uni38 = 0
 (106)  GTI_bil0_uni39 = 0
 (107)  GTI_bil0_uni40 = 0
 (108)  GTI_bil0_uni41 = 0
 (109)  GTI_bil0_uni42 = 0
 (110)  GTI_bil0_uni43 = 0
 (111)  GTI_bil0_uni44 = 0
 (112)  GTI_bil0_uni45 = 0
 (113)  GTI_bil0_uni46 = 0
 (114)  GTI_bil0_uni47 = 0
 (115)  GTI_bil0_uni48 = 0
 (116)  GTI_bil0_uni49 = 0
 (117)  GTI_bil0_uni50 = 0
 (118)  GTI_bil0_uni51 = 0
 (119)  GTI_bil0_uni52 = 0
 (120)  GTI_bil0_uni53 = 0
 (121)  GTI_bil0_uni54 = 0
 (122)  GTI_bil0_uni55 = 0
 (123)  GTI_bil0_uni56 = 0
 (124)  GTI_bil0_uni57 = 0
 (125)  GTI_bil0_uni58 = 0
 (126)  GTI_bil0_uni59 = 0
 (127)  GTI_bil0_uni60 = 0
 (128)  GTI_bil0_uni61 = 0
 (129)  GTI_bil0_uni62 = 0
 (130)  GTI_bil0_uni63 = 0
 (131)  GTI_bil0_uni64 = 0
 (132)  GTI_bil0_uni65 = 0
 (133)  GTI_bil0_uni66 = 0
 (134)  GTI_bil0_uni67 = 0

       F(134, 20598) =   43.48
            Prob > F =    0.0000

. 
. //originXyear, destinationXyear (trade spec)
. regxfe fwd_log_mig  d_log_gdp d_log_pop  if $sample1, fe(iso3n_oXyear iso3n_dXyear) cluster(pair_id)
Transforming the data
........
Estimating redundant parameters
.
Number of redundant parameters: 11

                                                 Number of obs      =    21855
                                                 F_xb (    0, 20428)=    0.000
                                                 Prob > F_xb        =        .
                                                 R2-Overall         =   0.7441
                                                 R2-Within          =   0.0000
                                                 # redundant FE     =       11
                           (Std. Err. adjusted for 2,611 clusters in _pair_id)
------------------------------------------------------------------------------
             |               Robust
 fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   3.210795   .0276904   115.95   0.000     3.156519     3.26507
------------------------------------------------------------------------------

. outreg2 using "$export\replication_TableA3.xls", append label excel tex ctitle("Benchmark, origin/destinationXyear")  adds(Within-R2, e(r2w), Overall R2, e(r2o)
> )
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.xls
dir : seeout

. regxfe fwd_log_mig d_log_gdp d_log_pop $bil_GTI_spec if $sample1, fe(iso3n_oXyear iso3n_dXyear) cluster(pair_id)
Transforming the data
.........
Estimating redundant parameters
.
Number of redundant parameters: 11

                                                 Number of obs      =    21855
                                                 F_xb (  134, 20294)=   43.116
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.8241
                                                 R2-Within          =   0.3127
                                                 # redundant FE     =       11
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     GTI_bil_0 |   .0950978   .0084451    11.26   0.000     .0785446    .1116509
     GTI_bil_1 |   .1137233   .0881478     1.29   0.197    -.0590535       .2865
     GTI_bil_2 |   .0118752   .0202373     0.59   0.557    -.0277915    .0515419
     GTI_bil_3 |  -.0150189   .0282472    -0.53   0.595    -.0703857    .0403479
     GTI_bil_4 |     .12336   .0709789     1.74   0.082    -.0157642    .2624843
     GTI_bil_5 |  -.0208578   .0102453    -2.04   0.042    -.0409394   -.0007763
     GTI_bil_6 |   .0147884   .0063808     2.32   0.020     .0022814    .0272953
     GTI_bil_7 |    .020099   .0130071     1.55   0.122    -.0053959    .0455939
     GTI_bil_8 |   .0382646    .015767     2.43   0.015     .0073599    .0691692
     GTI_bil_9 |   .0228551   .0403523     0.57   0.571    -.0562386    .1019488
    GTI_bil_10 |   .0170499   .0039314     4.34   0.000     .0093441    .0247557
    GTI_bil_12 |   .0175036   .0149243     1.17   0.241    -.0117493    .0467565
    GTI_bil_13 |   .0132461   .0184816     0.72   0.474    -.0229793    .0494715
    GTI_bil_14 |  -.0095328   .0098194    -0.97   0.332    -.0287797    .0097141
    GTI_bil_15 |  -.0298979   .0189264    -1.58   0.114    -.0669953    .0071994
    GTI_bil_16 |  -.0049425   .0123704    -0.40   0.690    -.0291895    .0193046
    GTI_bil_17 |   .0081877   .0133235     0.61   0.539    -.0179274    .0343028
    GTI_bil_18 |  -.0025046   .0074335    -0.34   0.736    -.0170747    .0120656
    GTI_bil_19 |  -.0305961    .016831    -1.82   0.069    -.0635862    .0023939
    GTI_bil_20 |  -.0140718   .0185785    -0.76   0.449    -.0504873    .0223436
    GTI_bil_21 |   .0381172   .0232948     1.64   0.102    -.0075424    .0837768
    GTI_bil_22 |    .042222   .0154054     2.74   0.006     .0120262    .0724178
    GTI_bil_23 |  -.0338401   .0154123    -2.20   0.028    -.0640495   -.0036306
    GTI_bil_24 |  -.0474626   .0233447    -2.03   0.042    -.0932202    -.001705
    GTI_bil_25 |  -.0002545   .0072849    -0.03   0.972    -.0145334    .0140245
    GTI_bil_26 |   .0147715   .0217532     0.68   0.497    -.0278666    .0574096
    GTI_bil_27 |  -.0429047   .0173973    -2.47   0.014    -.0770048   -.0088045
    GTI_bil_28 |   .0542772   .0362388     1.50   0.134    -.0167537    .1253081
    GTI_bil_29 |   .0044846   .0108486     0.41   0.679    -.0167795    .0257488
    GTI_bil_30 |  -.0464636   .0182099    -2.55   0.011    -.0821566   -.0107707
    GTI_bil_31 |  -.1786248   .0388117    -4.60   0.000     -.254699   -.1025507
    GTI_bil_32 |  -.0006942   .0099657    -0.07   0.944    -.0202277    .0188394
    GTI_bil_33 |   .0313636   .0734928     0.43   0.670    -.1126882    .1754154
    GTI_bil_34 |    .168034   .0477772     3.52   0.000     .0743868    .2616811
    GTI_bil_35 |  -.0272229   .0743801    -0.37   0.714     -.173014    .1185681
    GTI_bil_36 |    .017622   .0045865     3.84   0.000      .008632    .0266119
    GTI_bil_37 |  -.0472791   .0181678    -2.60   0.009    -.0828895   -.0116686
    GTI_bil_38 |  -.0258695   .0151421    -1.71   0.088    -.0555493    .0038103
    GTI_bil_39 |  -.0139113   .0096985    -1.43   0.151    -.0329212    .0050986
    GTI_bil_40 |   .0011952   .0191366     0.06   0.950    -.0363142    .0387046
    GTI_bil_41 |   .0105852    .014995     0.71   0.480    -.0188061    .0399765
    GTI_bil_42 |   -.328558   .1962117    -1.67   0.094    -.7131487    .0560327
    GTI_bil_43 |  -.1079073   .0262768    -4.11   0.000     -.159412   -.0564027
    GTI_bil_44 |   .0041121   .0087501     0.47   0.638    -.0130388    .0212629
    GTI_bil_45 |  -.0659564   .0188325    -3.50   0.000    -.1028696   -.0290432
    GTI_bil_46 |   .0044381   .0093139     0.48   0.634    -.0138179    .0226941
    GTI_bil_47 |  -.0080883   .0104129    -0.78   0.437    -.0284984    .0123218
    GTI_bil_48 |  -.0018726   .0175368    -0.11   0.915    -.0362462    .0325011
    GTI_bil_49 |   .0028475   .0126082     0.23   0.821    -.0218656    .0275607
    GTI_bil_50 |    .044713    .013169     3.40   0.001     .0189006    .0705254
    GTI_bil_51 |   .0033469   .0156116     0.21   0.830    -.0272531    .0339469
    GTI_bil_52 |   .0435211   .0054317     8.01   0.000     .0328746    .0541676
    GTI_bil_53 |  -.0011081   .0154285    -0.07   0.943    -.0313492     .029133
    GTI_bil_54 |  -.0441078   .0164941    -2.67   0.007    -.0764375    -.011778
    GTI_bil_55 |   .0143032   .0097323     1.47   0.142    -.0047729    .0333792
    GTI_bil_56 |   -.013054   .0258066    -0.51   0.613    -.0636371    .0375291
    GTI_bil_57 |   .0055458   .0148891     0.37   0.710     -.023638    .0347295
    GTI_bil_58 |   -.022175   .0131401    -1.69   0.092    -.0479307    .0035808
    GTI_bil_59 |    .013574   .0126099     1.08   0.282    -.0111425    .0382904
    GTI_bil_60 |  -.0918996   .0469174    -1.96   0.050    -.1838614    .0000622
    GTI_bil_61 |   .0409557   .0087855     4.66   0.000     .0237354     .058176
    GTI_bil_62 |   .0150359    .010013     1.50   0.133    -.0045903    .0346622
    GTI_bil_63 |  -.0262416   .0176808    -1.48   0.138    -.0608973    .0084142
    GTI_bil_64 |  -.0281609   .0112192    -2.51   0.012    -.0501515   -.0061703
    GTI_bil_65 |  -.0453557   .0202313    -2.24   0.025    -.0850107   -.0057008
    GTI_bil_66 |    .014913   .0106969     1.39   0.163    -.0060538    .0358798
    GTI_bil_67 |   .0403132   .0262958     1.53   0.125    -.0112287    .0918552
 GTI_bil0_uni1 |   .0003356   .0001723     1.95   0.051    -2.08e-06    .0006732
 GTI_bil0_uni2 |  -4.28e-06   .0001345    -0.03   0.975    -.0002679    .0002594
 GTI_bil0_uni3 |  -1.46e-06   .0001698    -0.01   0.993    -.0003343    .0003314
 GTI_bil0_uni4 |  -.0000269   .0002577    -0.10   0.917    -.0005319    .0004782
 GTI_bil0_uni5 |  -.0001602   .0001338    -1.20   0.231    -.0004225    .0001021
 GTI_bil0_uni6 |  -.0001708   .0001433    -1.19   0.233    -.0004516    .0001101
 GTI_bil0_uni7 |  -.0001426   .0001529    -0.93   0.351    -.0004424    .0001571
 GTI_bil0_uni8 |  -.0003563     .00017    -2.10   0.036    -.0006895    -.000023
 GTI_bil0_uni9 |   .0001578   .0001437     1.10   0.272     -.000124    .0004395
GTI_bil0_uni10 |   -.000198   .0001434    -1.38   0.167    -.0004791     .000083
GTI_bil0_uni11 |   .0003075   .0001529     2.01   0.044     7.81e-06    .0006071
GTI_bil0_uni12 |  -.0002406   .0001663    -1.45   0.148    -.0005666    .0000853
GTI_bil0_uni13 |  -.0001389   .0001639    -0.85   0.397    -.0004602    .0001823
GTI_bil0_uni14 |  -.0000906    .000152    -0.60   0.551    -.0003886    .0002074
GTI_bil0_uni15 |  -.0001362   .0001361    -1.00   0.317     -.000403    .0001306
GTI_bil0_uni16 |    .000199    .000141     1.41   0.158    -.0000775    .0004754
GTI_bil0_uni17 |   .0005263   .0001644     3.20   0.001     .0002042    .0008485
GTI_bil0_uni18 |   -.000169   .0001587    -1.06   0.287    -.0004801    .0001422
GTI_bil0_uni19 |   .0006802   .0001743     3.90   0.000     .0003385    .0010218
GTI_bil0_uni20 |  -.0002177   .0001759    -1.24   0.216    -.0005625    .0001271
GTI_bil0_uni21 |  -.0003471   .0001792    -1.94   0.053    -.0006984    4.08e-06
GTI_bil0_uni22 |   .0003773   .0001468     2.57   0.010     .0000895    .0006651
GTI_bil0_uni23 |  -.0002629   .0001375    -1.91   0.056    -.0005324    6.53e-06
GTI_bil0_uni24 |   .0002138   .0001606     1.33   0.183     -.000101    .0005286
GTI_bil0_uni25 |   .0000208   .0001249     0.17   0.868    -.0002239    .0002656
GTI_bil0_uni26 |   .0003142    .000152     2.07   0.039     .0000163    .0006122
GTI_bil0_uni27 |   .0000888   .0001519     0.58   0.559     -.000209    .0003866
GTI_bil0_uni28 |   .0001289   .0002369     0.54   0.586    -.0003354    .0005931
GTI_bil0_uni29 |   .0003122   .0001733     1.80   0.072    -.0000274    .0006518
GTI_bil0_uni30 |  -.0000107   .0001726    -0.06   0.951     -.000349    .0003277
GTI_bil0_uni31 |   .0000452   .0001301     0.35   0.728    -.0002098    .0003001
GTI_bil0_uni32 |  -.0000175   .0001401    -0.12   0.901    -.0002921    .0002571
GTI_bil0_uni33 |   -.000386   .0002016    -1.91   0.056    -.0007812    9.18e-06
GTI_bil0_uni34 |  -.0001517   .0001806    -0.84   0.401    -.0005057    .0002023
GTI_bil0_uni35 |   -.000049   .0002035    -0.24   0.810    -.0004478    .0003499
GTI_bil0_uni36 |   .0001091   .0001363     0.80   0.424    -.0001582    .0003763
GTI_bil0_uni37 |  -.0003629   .0001634    -2.22   0.026    -.0006833   -.0000426
GTI_bil0_uni38 |  -.0001433   .0001463    -0.98   0.327    -.0004301    .0001435
GTI_bil0_uni39 |  -.0003695   .0001547    -2.39   0.017    -.0006727   -.0000664
GTI_bil0_uni40 |  -.0005621   .0001678    -3.35   0.001    -.0008911   -.0002331
GTI_bil0_uni41 |   .0002821   .0001713     1.65   0.100    -.0000538    .0006179
GTI_bil0_uni42 |   .0002739   .0001893     1.45   0.148    -.0000971     .000645
GTI_bil0_uni43 |  -.0000664   .0001744    -0.38   0.704    -.0004083    .0002755
GTI_bil0_uni44 |  -.0000976   .0001542    -0.63   0.527    -.0003999    .0002048
GTI_bil0_uni45 |   .0003256   .0001587     2.05   0.040     .0000146    .0006366
GTI_bil0_uni46 |   .0002142   .0001077     1.99   0.047     3.04e-06    .0004253
GTI_bil0_uni47 |   .0002419   .0001675     1.44   0.149    -.0000863    .0005702
GTI_bil0_uni48 |    .000269   .0001488     1.81   0.071    -.0000228    .0005607
GTI_bil0_uni49 |   .0002341   .0001549     1.51   0.131    -.0000696    .0005378
GTI_bil0_uni50 |  -.0003322   .0001228    -2.71   0.007    -.0005729   -.0000915
GTI_bil0_uni51 |  -.0001157   .0001232    -0.94   0.348    -.0003571    .0001257
GTI_bil0_uni52 |   -.000169   .0001376    -1.23   0.219    -.0004386    .0001007
GTI_bil0_uni53 |   -.000177   .0001358    -1.30   0.192    -.0004432    .0000891
GTI_bil0_uni54 |  -.0000895   .0001645    -0.54   0.586     -.000412    .0002329
GTI_bil0_uni55 |  -.0002874   .0001621    -1.77   0.076    -.0006051    .0000304
GTI_bil0_uni56 |     .00002   .0001269     0.16   0.875    -.0002288    .0002688
GTI_bil0_uni57 |  -.0006041   .0001269    -4.76   0.000    -.0008528   -.0003553
GTI_bil0_uni58 |   .0000966   .0001183     0.82   0.414    -.0001352    .0003285
GTI_bil0_uni59 |   .0002774   .0001078     2.57   0.010      .000066    .0004888
GTI_bil0_uni60 |  -.0000766   .0001554    -0.49   0.622    -.0003812     .000228
GTI_bil0_uni61 |  -.0002284   .0001593    -1.43   0.152    -.0005406    .0000838
GTI_bil0_uni62 |  -.0001631   .0001327    -1.23   0.219    -.0004233     .000097
GTI_bil0_uni63 |  -.0002911    .000162    -1.80   0.072    -.0006086    .0000264
GTI_bil0_uni64 |  -.0000358   .0001295    -0.28   0.782    -.0002898    .0002181
GTI_bil0_uni65 |  -.0000268   .0001432    -0.19   0.851    -.0003076    .0002539
GTI_bil0_uni66 |   .0002922   .0001418     2.06   0.039     .0000143    .0005701
GTI_bil0_uni67 |  -.0001016   .0001332    -0.76   0.446    -.0003628    .0001595
         _cons |    2.41541   .0698056    34.60   0.000     2.278585    2.552234
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_TableA3.xls", append label excel tex ctitle("all GTI, origin/destinationXyear")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.xls
dir : seeout

. test GTI_bil_0 GTI_bil_1 GTI_bil_2 GTI_bil_3 GTI_bil_4 GTI_bil_5 GTI_bil_6 GTI_bil_7 GTI_bil_8 GTI_bil_9 GTI_bil_10 GTI_bil_12 GTI_bil_13 GTI_bil_14 GTI_bil_15 
> GTI_bil_16 GTI_bil_17 GTI_bil_18 GTI_bil_19 GTI_bil_20 GTI_bil_21 GTI_bil_22 GTI_bil_23 GTI_bil_24 GTI_bil_25 GTI_bil_26 GTI_bil_27 GTI_bil_28 GTI_bil_29 GTI_bi
> l_30 GTI_bil_31 GTI_bil_32 GTI_bil_33 GTI_bil_34 GTI_bil_35 GTI_bil_36 GTI_bil_37 GTI_bil_38 GTI_bil_39 GTI_bil_40 GTI_bil_41 GTI_bil_42 GTI_bil_43 GTI_bil_44 G
> TI_bil_45 GTI_bil_46 GTI_bil_47 GTI_bil_48 GTI_bil_49 GTI_bil_50 GTI_bil_51 GTI_bil_52 GTI_bil_53 GTI_bil_54 GTI_bil_55 GTI_bil_56 GTI_bil_57 GTI_bil_58 GTI_bil
> _59 GTI_bil_60 GTI_bil_61 GTI_bil_62 GTI_bil_63 GTI_bil_64 GTI_bil_65 GTI_bil_66 GTI_bil_67 GTI_bil0_uni1 GTI_bil0_uni2 GTI_bil0_uni3 GTI_bil0_uni4 GTI_bil0_uni
> 5 GTI_bil0_uni6 GTI_bil0_uni7 GTI_bil0_uni8 GTI_bil0_uni9 GTI_bil0_uni10 GTI_bil0_uni11 GTI_bil0_uni12 GTI_bil0_uni13 GTI_bil0_uni14 GTI_bil0_uni15 GTI_bil0_uni
> 16 GTI_bil0_uni17 GTI_bil0_uni18 GTI_bil0_uni19 GTI_bil0_uni20 GTI_bil0_uni21 GTI_bil0_uni22 GTI_bil0_uni23 GTI_bil0_uni24 GTI_bil0_uni25 GTI_bil0_uni26 GTI_bil
> 0_uni27 GTI_bil0_uni28 GTI_bil0_uni29 GTI_bil0_uni30 GTI_bil0_uni31 GTI_bil0_uni32 GTI_bil0_uni33 GTI_bil0_uni34 GTI_bil0_uni35 GTI_bil0_uni36 GTI_bil0_uni37 GT
> I_bil0_uni38 GTI_bil0_uni39 GTI_bil0_uni40 GTI_bil0_uni41 GTI_bil0_uni42 GTI_bil0_uni43 GTI_bil0_uni44 GTI_bil0_uni45 GTI_bil0_uni46 GTI_bil0_uni47 GTI_bil0_uni
> 48 GTI_bil0_uni49 GTI_bil0_uni50 GTI_bil0_uni51 GTI_bil0_uni52 GTI_bil0_uni53 GTI_bil0_uni54 GTI_bil0_uni55 GTI_bil0_uni56 GTI_bil0_uni57 GTI_bil0_uni58 GTI_bil
> 0_uni59 GTI_bil0_uni60 GTI_bil0_uni61 GTI_bil0_uni62 GTI_bil0_uni63 GTI_bil0_uni64 GTI_bil0_uni65 GTI_bil0_uni66 GTI_bil0_uni67                                 

 ( 1)  GTI_bil_0 = 0
 ( 2)  GTI_bil_1 = 0
 ( 3)  GTI_bil_2 = 0
 ( 4)  GTI_bil_3 = 0
 ( 5)  GTI_bil_4 = 0
 ( 6)  GTI_bil_5 = 0
 ( 7)  GTI_bil_6 = 0
 ( 8)  GTI_bil_7 = 0
 ( 9)  GTI_bil_8 = 0
 (10)  GTI_bil_9 = 0
 (11)  GTI_bil_10 = 0
 (12)  GTI_bil_12 = 0
 (13)  GTI_bil_13 = 0
 (14)  GTI_bil_14 = 0
 (15)  GTI_bil_15 = 0
 (16)  GTI_bil_16 = 0
 (17)  GTI_bil_17 = 0
 (18)  GTI_bil_18 = 0
 (19)  GTI_bil_19 = 0
 (20)  GTI_bil_20 = 0
 (21)  GTI_bil_21 = 0
 (22)  GTI_bil_22 = 0
 (23)  GTI_bil_23 = 0
 (24)  GTI_bil_24 = 0
 (25)  GTI_bil_25 = 0
 (26)  GTI_bil_26 = 0
 (27)  GTI_bil_27 = 0
 (28)  GTI_bil_28 = 0
 (29)  GTI_bil_29 = 0
 (30)  GTI_bil_30 = 0
 (31)  GTI_bil_31 = 0
 (32)  GTI_bil_32 = 0
 (33)  GTI_bil_33 = 0
 (34)  GTI_bil_34 = 0
 (35)  GTI_bil_35 = 0
 (36)  GTI_bil_36 = 0
 (37)  GTI_bil_37 = 0
 (38)  GTI_bil_38 = 0
 (39)  GTI_bil_39 = 0
 (40)  GTI_bil_40 = 0
 (41)  GTI_bil_41 = 0
 (42)  GTI_bil_42 = 0
 (43)  GTI_bil_43 = 0
 (44)  GTI_bil_44 = 0
 (45)  GTI_bil_45 = 0
 (46)  GTI_bil_46 = 0
 (47)  GTI_bil_47 = 0
 (48)  GTI_bil_48 = 0
 (49)  GTI_bil_49 = 0
 (50)  GTI_bil_50 = 0
 (51)  GTI_bil_51 = 0
 (52)  GTI_bil_52 = 0
 (53)  GTI_bil_53 = 0
 (54)  GTI_bil_54 = 0
 (55)  GTI_bil_55 = 0
 (56)  GTI_bil_56 = 0
 (57)  GTI_bil_57 = 0
 (58)  GTI_bil_58 = 0
 (59)  GTI_bil_59 = 0
 (60)  GTI_bil_60 = 0
 (61)  GTI_bil_61 = 0
 (62)  GTI_bil_62 = 0
 (63)  GTI_bil_63 = 0
 (64)  GTI_bil_64 = 0
 (65)  GTI_bil_65 = 0
 (66)  GTI_bil_66 = 0
 (67)  GTI_bil_67 = 0
 (68)  GTI_bil0_uni1 = 0
 (69)  GTI_bil0_uni2 = 0
 (70)  GTI_bil0_uni3 = 0
 (71)  GTI_bil0_uni4 = 0
 (72)  GTI_bil0_uni5 = 0
 (73)  GTI_bil0_uni6 = 0
 (74)  GTI_bil0_uni7 = 0
 (75)  GTI_bil0_uni8 = 0
 (76)  GTI_bil0_uni9 = 0
 (77)  GTI_bil0_uni10 = 0
 (78)  GTI_bil0_uni11 = 0
 (79)  GTI_bil0_uni12 = 0
 (80)  GTI_bil0_uni13 = 0
 (81)  GTI_bil0_uni14 = 0
 (82)  GTI_bil0_uni15 = 0
 (83)  GTI_bil0_uni16 = 0
 (84)  GTI_bil0_uni17 = 0
 (85)  GTI_bil0_uni18 = 0
 (86)  GTI_bil0_uni19 = 0
 (87)  GTI_bil0_uni20 = 0
 (88)  GTI_bil0_uni21 = 0
 (89)  GTI_bil0_uni22 = 0
 (90)  GTI_bil0_uni23 = 0
 (91)  GTI_bil0_uni24 = 0
 (92)  GTI_bil0_uni25 = 0
 (93)  GTI_bil0_uni26 = 0
 (94)  GTI_bil0_uni27 = 0
 (95)  GTI_bil0_uni28 = 0
 (96)  GTI_bil0_uni29 = 0
 (97)  GTI_bil0_uni30 = 0
 (98)  GTI_bil0_uni31 = 0
 (99)  GTI_bil0_uni32 = 0
 (100)  GTI_bil0_uni33 = 0
 (101)  GTI_bil0_uni34 = 0
 (102)  GTI_bil0_uni35 = 0
 (103)  GTI_bil0_uni36 = 0
 (104)  GTI_bil0_uni37 = 0
 (105)  GTI_bil0_uni38 = 0
 (106)  GTI_bil0_uni39 = 0
 (107)  GTI_bil0_uni40 = 0
 (108)  GTI_bil0_uni41 = 0
 (109)  GTI_bil0_uni42 = 0
 (110)  GTI_bil0_uni43 = 0
 (111)  GTI_bil0_uni44 = 0
 (112)  GTI_bil0_uni45 = 0
 (113)  GTI_bil0_uni46 = 0
 (114)  GTI_bil0_uni47 = 0
 (115)  GTI_bil0_uni48 = 0
 (116)  GTI_bil0_uni49 = 0
 (117)  GTI_bil0_uni50 = 0
 (118)  GTI_bil0_uni51 = 0
 (119)  GTI_bil0_uni52 = 0
 (120)  GTI_bil0_uni53 = 0
 (121)  GTI_bil0_uni54 = 0
 (122)  GTI_bil0_uni55 = 0
 (123)  GTI_bil0_uni56 = 0
 (124)  GTI_bil0_uni57 = 0
 (125)  GTI_bil0_uni58 = 0
 (126)  GTI_bil0_uni59 = 0
 (127)  GTI_bil0_uni60 = 0
 (128)  GTI_bil0_uni61 = 0
 (129)  GTI_bil0_uni62 = 0
 (130)  GTI_bil0_uni63 = 0
 (131)  GTI_bil0_uni64 = 0
 (132)  GTI_bil0_uni65 = 0
 (133)  GTI_bil0_uni66 = 0
 (134)  GTI_bil0_uni67 = 0

       F(134, 20294) =   43.12
            Prob > F =    0.0000

. 
. //originXyear, pair FE
. regxfe fwd_log_mig  d_log_gdp d_log_pop  if $sample1, fe(pair_id  iso3n_oXyear) cluster(pair_id)  
Transforming the data
.......
Estimating redundant parameters
.
Number of redundant parameters: 101

                                                 Number of obs      =    21855
                                                 F_xb (    1, 18257)=   18.276
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.9723
                                                 R2-Within          =   0.0072
                                                 # redundant FE     =      101
                           (Std. Err. adjusted for 2,611 clusters in _pair_id)
------------------------------------------------------------------------------
             |               Robust
 fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   d_log_gdp |   .8091119   .1999445     4.05   0.000     .4172019    1.201022
   d_log_pop |  -1.895592   .3348127    -5.66   0.000    -2.551857   -1.239328
       _cons |   3.324007   1.209365     2.75   0.006     .9535372    5.694477
------------------------------------------------------------------------------

. outreg2 using "$export\replication_TableA3.xls", append label excel tex ctitle("Benchmark, OP pair FE")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.xls
dir : seeout

. regxfe fwd_log_mig d_log_gdp d_log_pop $bil_GTI_spec if $sample1, fe(pair_id  iso3n_oXyear) cluster(pair_id)  
Transforming the data
...........
Estimating redundant parameters
.
Number of redundant parameters: 101

                                                 Number of obs      =    21855
                                                 F_xb (  135, 18123)=    2.999
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.9728
                                                 R2-Within          =   0.0262
                                                 # redundant FE     =      101
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     d_log_gdp |   .7599761   .1960914     3.88   0.000     .3756183    1.144334
     d_log_pop |  -1.868697   .3322305    -5.62   0.000      -2.5199   -1.217494
     GTI_bil_0 |   .0040025   .0025395     1.58   0.115    -.0009753    .0089802
     GTI_bil_1 |   .0094057   .0167137     0.56   0.574    -.0233548    .0421662
     GTI_bil_2 |   -.001594   .0050116    -0.32   0.750    -.0114172    .0082292
     GTI_bil_3 |  -.0002952    .006845    -0.04   0.966    -.0137121    .0131216
     GTI_bil_4 |   .0767513    .048216     1.59   0.111    -.0177567    .1712593
     GTI_bil_5 |   .0005064   .0042712     0.12   0.906    -.0078656    .0088784
     GTI_bil_6 |  -.0003709   .0025561    -0.15   0.885     -.005381    .0046393
     GTI_bil_7 |  -.0073966   .0063318    -1.17   0.243    -.0198076    .0050143
     GTI_bil_8 |   .0023146   .0062046     0.37   0.709     -.009847    .0144761
     GTI_bil_9 |  -.0080922   .0161864    -0.50   0.617    -.0398191    .0236346
    GTI_bil_10 |  -.0002866   .0018055    -0.16   0.874    -.0038255    .0032524
    GTI_bil_12 |   .0052947   .0051616     1.03   0.305    -.0048225     .015412
    GTI_bil_13 |   .0108644   .0095401     1.14   0.255    -.0078351    .0295639
    GTI_bil_14 |   .0015261   .0036531     0.42   0.676    -.0056344    .0086865
    GTI_bil_15 |  -.0020096   .0057022    -0.35   0.725    -.0131865    .0091673
    GTI_bil_16 |     .00833   .0043696     1.91   0.057    -.0002349     .016895
    GTI_bil_17 |  -.0137309    .004218    -3.26   0.001    -.0219985   -.0054632
    GTI_bil_18 |   .0002892   .0024938     0.12   0.908    -.0045988    .0051772
    GTI_bil_19 |  -.0086583    .004603    -1.88   0.060    -.0176805     .000364
    GTI_bil_20 |  -.0049471   .0074551    -0.66   0.507    -.0195599    .0096657
    GTI_bil_21 |  -.0014177   .0058159    -0.24   0.807    -.0128174     .009982
    GTI_bil_22 |    .002251   .0044773     0.50   0.615    -.0065249    .0110269
    GTI_bil_23 |  -.0027805   .0075968    -0.37   0.714    -.0176709    .0121099
    GTI_bil_24 |  -.0268891   .0091267    -2.95   0.003    -.0447784   -.0089999
    GTI_bil_25 |   .0035311   .0041415     0.85   0.394    -.0045866    .0116489
    GTI_bil_26 |  -.0086874   .0111867    -0.78   0.437    -.0306145    .0132397
    GTI_bil_27 |  -.0002383     .00577    -0.04   0.967     -.011548    .0110715
    GTI_bil_28 |  -.0151816   .0133842    -1.13   0.257    -.0414158    .0110527
    GTI_bil_29 |   .0059299   .0068924     0.86   0.390    -.0075799    .0194397
    GTI_bil_30 |   .0248695   .0166245     1.50   0.135    -.0077161    .0574551
    GTI_bil_31 |   .0143119   .0140014     1.02   0.307    -.0131323     .041756
    GTI_bil_32 |   .0069033   .0028033     2.46   0.014     .0014084    .0123981
    GTI_bil_33 |  -.0021848   .0206417    -0.11   0.916    -.0426445    .0382749
    GTI_bil_34 |  -.0049216   .0142675    -0.34   0.730    -.0328872    .0230441
    GTI_bil_35 |   .0426275   .0230685     1.85   0.065     -.002589     .087844
    GTI_bil_36 |   .0026784   .0017672     1.52   0.130    -.0007855    .0061423
    GTI_bil_37 |  -.0020808   .0065335    -0.32   0.750    -.0148872    .0107255
    GTI_bil_38 |   .0017641   .0099491     0.18   0.859    -.0177371    .0212654
    GTI_bil_39 |   .0025567   .0030315     0.84   0.399    -.0033854    .0084988
    GTI_bil_40 |   -.006976   .0099686    -0.70   0.484    -.0265154    .0125634
    GTI_bil_41 |   .0077255   .0051878     1.49   0.136    -.0024431    .0178941
    GTI_bil_42 |   .0113782   .0410141     0.28   0.781    -.0690133    .0917697
    GTI_bil_43 |   .0023512   .0097972     0.24   0.810    -.0168523    .0215546
    GTI_bil_44 |   .0017691   .0041037     0.43   0.666    -.0062746    .0098128
    GTI_bil_45 |  -.0022714   .0067296    -0.34   0.736    -.0154621    .0109192
    GTI_bil_46 |   .0100825   .0033061     3.05   0.002     .0036022    .0165627
    GTI_bil_47 |  -.0103961   .0040741    -2.55   0.011    -.0183817   -.0024106
    GTI_bil_48 |  -.0033704   .0102895    -0.33   0.743    -.0235389    .0167981
    GTI_bil_49 |   .0060175   .0044737     1.35   0.179    -.0027514    .0147863
    GTI_bil_50 |  -.0075557   .0073984    -1.02   0.307    -.0220572    .0069459
    GTI_bil_51 |  -.0069924   .0063502    -1.10   0.271    -.0194395    .0054546
    GTI_bil_52 |   .0064261   .0021596     2.98   0.003     .0021931    .0106592
    GTI_bil_53 |   .0028851    .006107     0.47   0.637    -.0090852    .0148554
    GTI_bil_54 |   .0028933   .0067688     0.43   0.669    -.0103742    .0161609
    GTI_bil_55 |   .0020437    .003395     0.60   0.547    -.0046108    .0086981
    GTI_bil_56 |  -.0121929   .0071231    -1.71   0.087    -.0261549    .0017691
    GTI_bil_57 |   .0112262   .0058695     1.91   0.056    -.0002786     .022731
    GTI_bil_58 |   .0025557   .0042061     0.61   0.543    -.0056887    .0108001
    GTI_bil_59 |  -.0049486   .0041835    -1.18   0.237    -.0131486    .0032515
    GTI_bil_60 |   .0002931   .0145771     0.02   0.984    -.0282795    .0288657
    GTI_bil_61 |    .003145   .0026029     1.21   0.227     -.001957    .0082469
    GTI_bil_62 |  -.0084527   .0044212    -1.91   0.056    -.0171187    .0002134
    GTI_bil_63 |   .0083114   .0062299     1.33   0.182    -.0038997    .0205225
    GTI_bil_64 |  -.0087397   .0038222    -2.29   0.022    -.0162317   -.0012477
    GTI_bil_65 |  -.0162806   .0114856    -1.42   0.156    -.0387934    .0062323
    GTI_bil_66 |  -.0005164   .0034268    -0.15   0.880    -.0072333    .0062006
    GTI_bil_67 |   .0065615   .0099946     0.66   0.512    -.0130288    .0261518
 GTI_bil0_uni1 |  -.0000615   .0000597    -1.03   0.303    -.0001785    .0000554
 GTI_bil0_uni2 |   .0001299    .000059     2.20   0.028     .0000142    .0002456
 GTI_bil0_uni3 |  -.0000592    .000069    -0.86   0.391    -.0001945    .0000761
 GTI_bil0_uni4 |  -.0000878   .0001271    -0.69   0.490    -.0003369    .0001614
 GTI_bil0_uni5 |  -5.58e-06   .0000522    -0.11   0.915    -.0001079    .0000967
 GTI_bil0_uni6 |  -.0000423   .0000522    -0.81   0.418    -.0001447      .00006
 GTI_bil0_uni7 |  -.0000766    .000063    -1.22   0.224    -.0002001    .0000469
 GTI_bil0_uni8 |  -.0000788   .0000839    -0.94   0.347    -.0002434    .0000857
 GTI_bil0_uni9 |  -.0000207   .0000687    -0.30   0.763    -.0001554    .0001139
GTI_bil0_uni10 |   -.000018   .0000516    -0.35   0.727    -.0001191    .0000831
GTI_bil0_uni11 |  -.0000258   .0000734    -0.35   0.725    -.0001698    .0001181
GTI_bil0_uni12 |   .0000941   .0000754     1.25   0.212    -.0000536    .0002418
GTI_bil0_uni13 |   .0000106    .000078     0.14   0.892    -.0001424    .0001635
GTI_bil0_uni14 |  -.0000502   .0000608    -0.83   0.409    -.0001694    .0000689
GTI_bil0_uni15 |    .000074   .0000552     1.34   0.180    -.0000341    .0001822
GTI_bil0_uni16 |   3.66e-06   .0000647     0.06   0.955    -.0001232    .0001305
GTI_bil0_uni17 |   .0000824   .0000616     1.34   0.181    -.0000383    .0002032
GTI_bil0_uni18 |   -.000101   .0000618    -1.63   0.102    -.0002221    .0000201
GTI_bil0_uni19 |   .0000314   .0000805     0.39   0.697    -.0001265    .0001893
GTI_bil0_uni20 |  -.0000744   .0000807    -0.92   0.357    -.0002326    .0000838
GTI_bil0_uni21 |  -3.81e-06   .0000699    -0.05   0.957    -.0001409    .0001333
GTI_bil0_uni22 |    .000113   .0000555     2.04   0.042     4.16e-06    .0002217
GTI_bil0_uni23 |   .0000154   .0000573     0.27   0.788     -.000097    .0001278
GTI_bil0_uni24 |   .0001086   .0000639     1.70   0.089    -.0000167    .0002338
GTI_bil0_uni25 |   .0000884   .0000481     1.84   0.066    -6.01e-06    .0001827
GTI_bil0_uni26 |   -.000018   .0000686    -0.26   0.793    -.0001524    .0001164
GTI_bil0_uni27 |   .0000884     .00007     1.26   0.207    -.0000488    .0002255
GTI_bil0_uni28 |  -.0001301   .0001253    -1.04   0.299    -.0003756    .0001155
GTI_bil0_uni29 |   .0000253   .0000601     0.42   0.675    -.0000926    .0001431
GTI_bil0_uni30 |  -.0000311   .0000613    -0.51   0.612    -.0001512    .0000891
GTI_bil0_uni31 |   .0000496   .0000567     0.87   0.382    -.0000616    .0001608
GTI_bil0_uni32 |  -.0000469   .0000519    -0.90   0.366    -.0001486    .0000548
GTI_bil0_uni33 |   .0000389   .0000764     0.51   0.611    -.0001109    .0001887
GTI_bil0_uni34 |   .0000327   .0000849     0.38   0.700    -.0001338    .0001992
GTI_bil0_uni35 |  -.0000291   .0000883    -0.33   0.741    -.0002022    .0001439
GTI_bil0_uni36 |   -.000026   .0000475    -0.55   0.584    -.0001192    .0000671
GTI_bil0_uni37 |  -3.85e-06    .000069    -0.06   0.955     -.000139    .0001313
GTI_bil0_uni38 |  -.0000293   .0000587    -0.50   0.617    -.0001443    .0000857
GTI_bil0_uni39 |  -.0000171   .0000579    -0.30   0.767    -.0001307    .0000964
GTI_bil0_uni40 |  -.0000594   .0000586    -1.01   0.310    -.0001742    .0000554
GTI_bil0_uni41 |  -6.45e-07   .0000621    -0.01   0.992    -.0001223     .000121
GTI_bil0_uni42 |    .000105   .0000799     1.31   0.189    -.0000516    .0002616
GTI_bil0_uni43 |   .0000576   .0000692     0.83   0.405     -.000078    .0001932
GTI_bil0_uni44 |  -.0000316   .0000601    -0.53   0.599    -.0001493    .0000862
GTI_bil0_uni45 |  -.0000129   .0000619    -0.21   0.835    -.0001342    .0001083
GTI_bil0_uni46 |   .0000526   .0000488     1.08   0.281    -.0000431    .0001482
GTI_bil0_uni47 |   .0000517   .0000674     0.77   0.443    -.0000804    .0001839
GTI_bil0_uni48 |  -.0000428   .0000608    -0.70   0.482     -.000162    .0000764
GTI_bil0_uni49 |  -.0000485   .0000626    -0.78   0.438    -.0001713    .0000742
GTI_bil0_uni50 |  -9.06e-06   .0000497    -0.18   0.855    -.0001065    .0000884
GTI_bil0_uni51 |   9.20e-06   .0000507     0.18   0.856    -.0000902    .0001086
GTI_bil0_uni52 |  -2.82e-06    .000051    -0.06   0.956    -.0001029    .0000972
GTI_bil0_uni53 |  -.0000376   .0000558    -0.67   0.501    -.0001469    .0000718
GTI_bil0_uni54 |  -.0000221   .0000567    -0.39   0.696    -.0001333    .0000891
GTI_bil0_uni55 |   .0000355   .0000605     0.59   0.558    -.0000831    .0001541
GTI_bil0_uni56 |  -2.31e-06   .0000575    -0.04   0.968    -.0001151    .0001105
GTI_bil0_uni57 |   .0000834   .0000528     1.58   0.114      -.00002    .0001869
GTI_bil0_uni58 |    .000033   .0000424     0.78   0.437    -.0000501    .0001161
GTI_bil0_uni59 |  -.0000611   .0000438    -1.40   0.162    -.0001469    .0000246
GTI_bil0_uni60 |  -.0000137   .0000602    -0.23   0.819    -.0001317    .0001043
GTI_bil0_uni61 |  -.0000659   .0000659    -1.00   0.317     -.000195    .0000633
GTI_bil0_uni62 |   5.91e-06   .0000543     0.11   0.913    -.0001005    .0001123
GTI_bil0_uni63 |  -.0000642   .0000564    -1.14   0.254    -.0001747    .0000462
GTI_bil0_uni64 |   .0000567   .0000543     1.04   0.297    -.0000497    .0001631
GTI_bil0_uni65 |   .0000128   .0000463     0.28   0.782    -.0000779    .0001035
GTI_bil0_uni66 |   .0000378   .0000593     0.64   0.524    -.0000785     .000154
GTI_bil0_uni67 |   .0000365   .0000559     0.65   0.514    -.0000731    .0001461
         _cons |   3.355672   1.205509     2.78   0.005     .9927593    5.718584
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_TableA3.xls", append label excel tex ctitle("all GTI, OP pair FE")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.xls
dir : seeout

. test GTI_bil_0 GTI_bil_1 GTI_bil_2 GTI_bil_3 GTI_bil_4 GTI_bil_5 GTI_bil_6 GTI_bil_7 GTI_bil_8 GTI_bil_9 GTI_bil_10 GTI_bil_12 GTI_bil_13 GTI_bil_14 GTI_bil_15 
> GTI_bil_16 GTI_bil_17 GTI_bil_18 GTI_bil_19 GTI_bil_20 GTI_bil_21 GTI_bil_22 GTI_bil_23 GTI_bil_24 GTI_bil_25 GTI_bil_26 GTI_bil_27 GTI_bil_28 GTI_bil_29 GTI_bi
> l_30 GTI_bil_31 GTI_bil_32 GTI_bil_33 GTI_bil_34 GTI_bil_35 GTI_bil_36 GTI_bil_37 GTI_bil_38 GTI_bil_39 GTI_bil_40 GTI_bil_41 GTI_bil_42 GTI_bil_43 GTI_bil_44 G
> TI_bil_45 GTI_bil_46 GTI_bil_47 GTI_bil_48 GTI_bil_49 GTI_bil_50 GTI_bil_51 GTI_bil_52 GTI_bil_53 GTI_bil_54 GTI_bil_55 GTI_bil_56 GTI_bil_57 GTI_bil_58 GTI_bil
> _59 GTI_bil_60 GTI_bil_61 GTI_bil_62 GTI_bil_63 GTI_bil_64 GTI_bil_65 GTI_bil_66 GTI_bil_67 GTI_bil0_uni1 GTI_bil0_uni2 GTI_bil0_uni3 GTI_bil0_uni4 GTI_bil0_uni
> 5 GTI_bil0_uni6 GTI_bil0_uni7 GTI_bil0_uni8 GTI_bil0_uni9 GTI_bil0_uni10 GTI_bil0_uni11 GTI_bil0_uni12 GTI_bil0_uni13 GTI_bil0_uni14 GTI_bil0_uni15 GTI_bil0_uni
> 16 GTI_bil0_uni17 GTI_bil0_uni18 GTI_bil0_uni19 GTI_bil0_uni20 GTI_bil0_uni21 GTI_bil0_uni22 GTI_bil0_uni23 GTI_bil0_uni24 GTI_bil0_uni25 GTI_bil0_uni26 GTI_bil
> 0_uni27 GTI_bil0_uni28 GTI_bil0_uni29 GTI_bil0_uni30 GTI_bil0_uni31 GTI_bil0_uni32 GTI_bil0_uni33 GTI_bil0_uni34 GTI_bil0_uni35 GTI_bil0_uni36 GTI_bil0_uni37 GT
> I_bil0_uni38 GTI_bil0_uni39 GTI_bil0_uni40 GTI_bil0_uni41 GTI_bil0_uni42 GTI_bil0_uni43 GTI_bil0_uni44 GTI_bil0_uni45 GTI_bil0_uni46 GTI_bil0_uni47 GTI_bil0_uni
> 48 GTI_bil0_uni49 GTI_bil0_uni50 GTI_bil0_uni51 GTI_bil0_uni52 GTI_bil0_uni53 GTI_bil0_uni54 GTI_bil0_uni55 GTI_bil0_uni56 GTI_bil0_uni57 GTI_bil0_uni58 GTI_bil
> 0_uni59 GTI_bil0_uni60 GTI_bil0_uni61 GTI_bil0_uni62 GTI_bil0_uni63 GTI_bil0_uni64 GTI_bil0_uni65 GTI_bil0_uni66 GTI_bil0_uni67                                 

 ( 1)  GTI_bil_0 = 0
 ( 2)  GTI_bil_1 = 0
 ( 3)  GTI_bil_2 = 0
 ( 4)  GTI_bil_3 = 0
 ( 5)  GTI_bil_4 = 0
 ( 6)  GTI_bil_5 = 0
 ( 7)  GTI_bil_6 = 0
 ( 8)  GTI_bil_7 = 0
 ( 9)  GTI_bil_8 = 0
 (10)  GTI_bil_9 = 0
 (11)  GTI_bil_10 = 0
 (12)  GTI_bil_12 = 0
 (13)  GTI_bil_13 = 0
 (14)  GTI_bil_14 = 0
 (15)  GTI_bil_15 = 0
 (16)  GTI_bil_16 = 0
 (17)  GTI_bil_17 = 0
 (18)  GTI_bil_18 = 0
 (19)  GTI_bil_19 = 0
 (20)  GTI_bil_20 = 0
 (21)  GTI_bil_21 = 0
 (22)  GTI_bil_22 = 0
 (23)  GTI_bil_23 = 0
 (24)  GTI_bil_24 = 0
 (25)  GTI_bil_25 = 0
 (26)  GTI_bil_26 = 0
 (27)  GTI_bil_27 = 0
 (28)  GTI_bil_28 = 0
 (29)  GTI_bil_29 = 0
 (30)  GTI_bil_30 = 0
 (31)  GTI_bil_31 = 0
 (32)  GTI_bil_32 = 0
 (33)  GTI_bil_33 = 0
 (34)  GTI_bil_34 = 0
 (35)  GTI_bil_35 = 0
 (36)  GTI_bil_36 = 0
 (37)  GTI_bil_37 = 0
 (38)  GTI_bil_38 = 0
 (39)  GTI_bil_39 = 0
 (40)  GTI_bil_40 = 0
 (41)  GTI_bil_41 = 0
 (42)  GTI_bil_42 = 0
 (43)  GTI_bil_43 = 0
 (44)  GTI_bil_44 = 0
 (45)  GTI_bil_45 = 0
 (46)  GTI_bil_46 = 0
 (47)  GTI_bil_47 = 0
 (48)  GTI_bil_48 = 0
 (49)  GTI_bil_49 = 0
 (50)  GTI_bil_50 = 0
 (51)  GTI_bil_51 = 0
 (52)  GTI_bil_52 = 0
 (53)  GTI_bil_53 = 0
 (54)  GTI_bil_54 = 0
 (55)  GTI_bil_55 = 0
 (56)  GTI_bil_56 = 0
 (57)  GTI_bil_57 = 0
 (58)  GTI_bil_58 = 0
 (59)  GTI_bil_59 = 0
 (60)  GTI_bil_60 = 0
 (61)  GTI_bil_61 = 0
 (62)  GTI_bil_62 = 0
 (63)  GTI_bil_63 = 0
 (64)  GTI_bil_64 = 0
 (65)  GTI_bil_65 = 0
 (66)  GTI_bil_66 = 0
 (67)  GTI_bil_67 = 0
 (68)  GTI_bil0_uni1 = 0
 (69)  GTI_bil0_uni2 = 0
 (70)  GTI_bil0_uni3 = 0
 (71)  GTI_bil0_uni4 = 0
 (72)  GTI_bil0_uni5 = 0
 (73)  GTI_bil0_uni6 = 0
 (74)  GTI_bil0_uni7 = 0
 (75)  GTI_bil0_uni8 = 0
 (76)  GTI_bil0_uni9 = 0
 (77)  GTI_bil0_uni10 = 0
 (78)  GTI_bil0_uni11 = 0
 (79)  GTI_bil0_uni12 = 0
 (80)  GTI_bil0_uni13 = 0
 (81)  GTI_bil0_uni14 = 0
 (82)  GTI_bil0_uni15 = 0
 (83)  GTI_bil0_uni16 = 0
 (84)  GTI_bil0_uni17 = 0
 (85)  GTI_bil0_uni18 = 0
 (86)  GTI_bil0_uni19 = 0
 (87)  GTI_bil0_uni20 = 0
 (88)  GTI_bil0_uni21 = 0
 (89)  GTI_bil0_uni22 = 0
 (90)  GTI_bil0_uni23 = 0
 (91)  GTI_bil0_uni24 = 0
 (92)  GTI_bil0_uni25 = 0
 (93)  GTI_bil0_uni26 = 0
 (94)  GTI_bil0_uni27 = 0
 (95)  GTI_bil0_uni28 = 0
 (96)  GTI_bil0_uni29 = 0
 (97)  GTI_bil0_uni30 = 0
 (98)  GTI_bil0_uni31 = 0
 (99)  GTI_bil0_uni32 = 0
 (100)  GTI_bil0_uni33 = 0
 (101)  GTI_bil0_uni34 = 0
 (102)  GTI_bil0_uni35 = 0
 (103)  GTI_bil0_uni36 = 0
 (104)  GTI_bil0_uni37 = 0
 (105)  GTI_bil0_uni38 = 0
 (106)  GTI_bil0_uni39 = 0
 (107)  GTI_bil0_uni40 = 0
 (108)  GTI_bil0_uni41 = 0
 (109)  GTI_bil0_uni42 = 0
 (110)  GTI_bil0_uni43 = 0
 (111)  GTI_bil0_uni44 = 0
 (112)  GTI_bil0_uni45 = 0
 (113)  GTI_bil0_uni46 = 0
 (114)  GTI_bil0_uni47 = 0
 (115)  GTI_bil0_uni48 = 0
 (116)  GTI_bil0_uni49 = 0
 (117)  GTI_bil0_uni50 = 0
 (118)  GTI_bil0_uni51 = 0
 (119)  GTI_bil0_uni52 = 0
 (120)  GTI_bil0_uni53 = 0
 (121)  GTI_bil0_uni54 = 0
 (122)  GTI_bil0_uni55 = 0
 (123)  GTI_bil0_uni56 = 0
 (124)  GTI_bil0_uni57 = 0
 (125)  GTI_bil0_uni58 = 0
 (126)  GTI_bil0_uni59 = 0
 (127)  GTI_bil0_uni60 = 0
 (128)  GTI_bil0_uni61 = 0
 (129)  GTI_bil0_uni62 = 0
 (130)  GTI_bil0_uni63 = 0
 (131)  GTI_bil0_uni64 = 0
 (132)  GTI_bil0_uni65 = 0
 (133)  GTI_bil0_uni66 = 0
 (134)  GTI_bil0_uni67 = 0

       F(134, 18123) =    2.55
            Prob > F =    0.0000

. 
. //originXyear, destinationXyear und pair FE  
. regxfe fwd_log_mig d_log_gdp d_log_pop  if $sample1, fe(pair_id iso3n_oXyear  iso3n_dXyear) cluster(pair_id)  
Transforming the data
...............
Estimating redundant parameters
....
Number of redundant parameters: 146

                                                 Number of obs      =    21855
                                                 F_xb (    0, 17952)=    0.000
                                                 Prob > F_xb        =        .
                                                 R2-Overall         =   0.9751
                                                 R2-Within          =   0.0000
                                                 # redundant FE     =      146
                           (Std. Err. adjusted for 2,611 clusters in _pair_id)
------------------------------------------------------------------------------
             |               Robust
 fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   3.210795   3.77e-07  8.5e+06   0.000     3.210794    3.210795
------------------------------------------------------------------------------

. outreg2 using "$export\replication_TableA3.xls", append label excel tex ctitle("Benchmark, all FE")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.xls
dir : seeout

. regxfe fwd_log_mig d_log_gdp d_log_pop $bil_GTI_spec if $sample1, fe(pair_id iso3n_oXyear  iso3n_dXyear) cluster(pair_id)  
Transforming the data
.........................
Estimating redundant parameters
....
Number of redundant parameters: 146

                                                 Number of obs      =    21855
                                                 F_xb (  133, 17819)=    2.118
                                                 Prob > F_xb        =   0.0000
                                                 R2-Overall         =   0.9755
                                                 R2-Within          =   0.0161
                                                 # redundant FE     =      146
                             (Std. Err. adjusted for 2,611 clusters in _pair_id)
--------------------------------------------------------------------------------
               |               Robust
   fwd_log_mig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     GTI_bil_0 |   .0032071   .0024439     1.31   0.189    -.0015831    .0079974
     GTI_bil_1 |   .0042964   .0137584     0.31   0.755    -.0226714    .0312641
     GTI_bil_2 |   .0015635   .0043684     0.36   0.720     -.006999     .010126
     GTI_bil_3 |  -.0003599   .0064255    -0.06   0.955    -.0129545    .0122348
     GTI_bil_4 |    .082923   .0429756     1.93   0.054    -.0013134    .1671594
     GTI_bil_5 |   .0005858   .0041545     0.14   0.888    -.0075575     .008729
     GTI_bil_6 |   .0026602   .0022209     1.20   0.231    -.0016929    .0070134
     GTI_bil_7 |  -.0039966   .0053127    -0.75   0.452      -.01441    .0064169
     GTI_bil_8 |    .001131   .0058657     0.19   0.847    -.0103663    .0126282
     GTI_bil_9 |  -.0273462   .0151041    -1.81   0.070    -.0569517    .0022593
    GTI_bil_10 |   .0007924    .001632     0.49   0.627    -.0024065    .0039913
    GTI_bil_12 |   .0037457   .0050099     0.75   0.455    -.0060741    .0135655
    GTI_bil_13 |   .0111946   .0084652     1.32   0.186    -.0053981    .0277873
    GTI_bil_14 |  -.0000185    .002927    -0.01   0.995    -.0057557    .0057187
    GTI_bil_15 |  -.0040347   .0044678    -0.90   0.366     -.012792    .0047225
    GTI_bil_16 |   .0059211   .0037711     1.57   0.116    -.0014707    .0133129
    GTI_bil_17 |  -.0109772   .0035438    -3.10   0.002    -.0179234    -.004031
    GTI_bil_18 |  -.0018161   .0026642    -0.68   0.495    -.0070382     .003406
    GTI_bil_19 |  -.0106666    .005373    -1.99   0.047    -.0211982    -.000135
    GTI_bil_20 |  -.0038153    .006904    -0.55   0.581    -.0173478    .0097172
    GTI_bil_21 |   .0036584    .005773     0.63   0.526    -.0076572    .0149741
    GTI_bil_22 |   .0010369   .0038182     0.27   0.786    -.0064471    .0085208
    GTI_bil_23 |  -.0013085   .0071266    -0.18   0.854    -.0152772    .0126603
    GTI_bil_24 |  -.0217769   .0083887    -2.60   0.009    -.0382196   -.0053342
    GTI_bil_25 |    .003819   .0038734     0.99   0.324    -.0037732    .0114112
    GTI_bil_26 |  -.0045436    .010155    -0.45   0.655    -.0244483    .0153611
    GTI_bil_27 |   .0024106   .0054558     0.44   0.659    -.0082833    .0131045
    GTI_bil_28 |  -.0083268   .0100666    -0.83   0.408    -.0280582    .0114046
    GTI_bil_29 |   .0064947   .0063802     1.02   0.309    -.0060111    .0190004
    GTI_bil_30 |   .0204424     .01405     1.45   0.146     -.007097    .0479818
    GTI_bil_31 |   .0168148   .0146739     1.15   0.252    -.0119475     .045577
    GTI_bil_32 |   .0059232   .0024075     2.46   0.014     .0012042    .0106423
    GTI_bil_33 |  -.0121233   .0203657    -0.60   0.552    -.0520421    .0277955
    GTI_bil_34 |   .0084491    .012155     0.70   0.487    -.0153759    .0322742
    GTI_bil_35 |   .0207722   .0177527     1.17   0.242    -.0140248    .0555691
    GTI_bil_36 |   .0023773   .0015767     1.51   0.132    -.0007132    .0054679
    GTI_bil_37 |   .0030404   .0068065     0.45   0.655     -.010301    .0163818
    GTI_bil_38 |   .0015119   .0079969     0.19   0.850    -.0141627    .0171866
    GTI_bil_39 |   .0020876   .0026967     0.77   0.439    -.0031981    .0073733
    GTI_bil_40 |  -.0118647    .008958    -1.32   0.185    -.0294232    .0056938
    GTI_bil_41 |   .0039425   .0044632     0.88   0.377    -.0048059    .0126909
    GTI_bil_42 |   .0380974    .035367     1.08   0.281    -.0312254    .1074202
    GTI_bil_43 |   .0033889   .0086048     0.39   0.694    -.0134774    .0202552
    GTI_bil_44 |   .0022605   .0035575     0.64   0.525    -.0047125    .0092334
    GTI_bil_45 |  -.0029051   .0058398    -0.50   0.619    -.0143518    .0085415
    GTI_bil_46 |   .0073513   .0028459     2.58   0.010      .001773    .0129296
    GTI_bil_47 |  -.0074592   .0038702    -1.93   0.054    -.0150451    .0001267
    GTI_bil_48 |   -.004386   .0095821    -0.46   0.647    -.0231678    .0143958
    GTI_bil_49 |   .0063081   .0040476     1.56   0.119    -.0016257    .0142419
    GTI_bil_50 |  -.0063112    .007376    -0.86   0.392    -.0207689    .0081466
    GTI_bil_51 |  -.0044608   .0056079    -0.80   0.426    -.0154529    .0065313
    GTI_bil_52 |   .0048472   .0018996     2.55   0.011     .0011237    .0085707
    GTI_bil_53 |   .0040793    .005142     0.79   0.428    -.0059996    .0141581
    GTI_bil_54 |   .0047501   .0065145     0.73   0.466     -.008019    .0175191
    GTI_bil_55 |   .0034935   .0031671     1.10   0.270    -.0027142    .0097013
    GTI_bil_56 |  -.0083408   .0071726    -1.16   0.245    -.0223999    .0057182
    GTI_bil_57 |   .0083208   .0052698     1.58   0.114    -.0020085    .0186501
    GTI_bil_58 |   .0035394   .0042206     0.84   0.402    -.0047334    .0118122
    GTI_bil_59 |  -.0084326   .0040276    -2.09   0.036    -.0163272   -.0005381
    GTI_bil_60 |    .012768   .0121199     1.05   0.292    -.0109881    .0365241
    GTI_bil_61 |   .0022372   .0022064     1.01   0.311    -.0020875    .0065619
    GTI_bil_62 |  -.0061826   .0038037    -1.63   0.104    -.0136382     .001273
    GTI_bil_63 |   .0081464   .0058339     1.40   0.163    -.0032885    .0195813
    GTI_bil_64 |  -.0084764   .0035911    -2.36   0.018    -.0155154   -.0014375
    GTI_bil_65 |  -.0196684   .0085023    -2.31   0.021    -.0363338   -.0030031
    GTI_bil_66 |  -.0006908   .0028874    -0.24   0.811    -.0063504    .0049688
    GTI_bil_67 |  -.0034066   .0093065    -0.37   0.714    -.0216483    .0148351
 GTI_bil0_uni1 |  -.0000672   .0000575    -1.17   0.242    -.0001798    .0000454
 GTI_bil0_uni2 |   .0000932   .0000598     1.56   0.119     -.000024    .0002103
 GTI_bil0_uni3 |  -.0000668   .0000649    -1.03   0.303     -.000194    .0000603
 GTI_bil0_uni4 |   -.000062   .0001165    -0.53   0.595    -.0002904    .0001664
 GTI_bil0_uni5 |  -3.50e-06   .0000479    -0.07   0.942    -.0000973    .0000903
 GTI_bil0_uni6 |  -.0000299   .0000468    -0.64   0.523    -.0001216    .0000618
 GTI_bil0_uni7 |  -.0000894   .0000567    -1.58   0.115    -.0002005    .0000217
 GTI_bil0_uni8 |  -.0000743   .0000802    -0.93   0.354    -.0002315    .0000829
 GTI_bil0_uni9 |   -.000014    .000066    -0.21   0.832    -.0001434    .0001155
GTI_bil0_uni10 |  -4.86e-06   .0000487    -0.10   0.920    -.0001003    .0000906
GTI_bil0_uni11 |  -.0000696   .0000686    -1.01   0.310    -.0002041    .0000649
GTI_bil0_uni12 |   .0001045   .0000683     1.53   0.126    -.0000295    .0002385
GTI_bil0_uni13 |     .00007   .0000727     0.96   0.336    -.0000726    .0002126
GTI_bil0_uni14 |  -.0000393    .000056    -0.70   0.483     -.000149    .0000705
GTI_bil0_uni15 |   .0000595   .0000517     1.15   0.250     -.000042    .0001609
GTI_bil0_uni16 |   .0000169   .0000593     0.28   0.776    -.0000994    .0001331
GTI_bil0_uni17 |   .0000794   .0000577     1.38   0.168    -.0000336    .0001925
GTI_bil0_uni18 |  -.0000976   .0000593    -1.65   0.100    -.0002138    .0000186
GTI_bil0_uni19 |   .0000432   .0000719     0.60   0.547    -.0000976    .0001841
GTI_bil0_uni20 |  -.0000848    .000071    -1.19   0.232     -.000224    .0000544
GTI_bil0_uni21 |  -.0000263   .0000644    -0.41   0.683    -.0001526       .0001
GTI_bil0_uni22 |   .0000966   .0000506     1.91   0.056    -2.46e-06    .0001957
GTI_bil0_uni23 |  -.0000108   .0000539    -0.20   0.841    -.0001165    .0000948
GTI_bil0_uni24 |   .0000863   .0000616     1.40   0.161    -.0000345    .0002071
GTI_bil0_uni25 |   .0000714   .0000453     1.58   0.115    -.0000174    .0001601
GTI_bil0_uni26 |  -.0000361   .0000659    -0.55   0.583    -.0001652     .000093
GTI_bil0_uni27 |   .0000812   .0000647     1.26   0.209    -.0000455     .000208
GTI_bil0_uni28 |   -.000051   .0001179    -0.43   0.665    -.0002821      .00018
GTI_bil0_uni29 |  -2.87e-06   .0000558    -0.05   0.959    -.0001122    .0001065
GTI_bil0_uni30 |  -.0000289   .0000548    -0.53   0.599    -.0001363    .0000786
GTI_bil0_uni31 |   .0000455   .0000535     0.85   0.395    -.0000594    .0001504
GTI_bil0_uni32 |  -.0000188    .000049    -0.38   0.702    -.0001149    .0000773
GTI_bil0_uni33 |   .0000368    .000073     0.50   0.614    -.0001062    .0001798
GTI_bil0_uni34 |   .0000122   .0000781     0.16   0.876    -.0001408    .0001653
GTI_bil0_uni35 |  -.0000332   .0000874    -0.38   0.704    -.0002046    .0001382
GTI_bil0_uni36 |  -.0000105   .0000467    -0.23   0.821    -.0001021     .000081
GTI_bil0_uni37 |   .0000129   .0000617     0.21   0.835     -.000108    .0001338
GTI_bil0_uni38 |   -.000032   .0000553    -0.58   0.563    -.0001403    .0000764
GTI_bil0_uni39 |  -.0000243   .0000531    -0.46   0.647    -.0001283    .0000797
GTI_bil0_uni40 |  -.0000332   .0000556    -0.60   0.551    -.0001422    .0000758
GTI_bil0_uni41 |   .0000124   .0000566     0.22   0.827    -.0000986    .0001233
GTI_bil0_uni42 |    .000061   .0000753     0.81   0.418    -.0000865    .0002086
GTI_bil0_uni43 |   .0000269   .0000653     0.41   0.680    -.0001011     .000155
GTI_bil0_uni44 |  -.0000388   .0000551    -0.70   0.482    -.0001468    .0000693
GTI_bil0_uni45 |   2.10e-06   .0000584     0.04   0.971    -.0001123    .0001165
GTI_bil0_uni46 |   .0000454   .0000438     1.04   0.299    -.0000403    .0001312
GTI_bil0_uni47 |   .0000532   .0000604     0.88   0.378    -.0000651    .0001716
GTI_bil0_uni48 |  -.0000706   .0000566    -1.25   0.212    -.0001815    .0000403
GTI_bil0_uni49 |  -.0000245   .0000546    -0.45   0.653    -.0001315    .0000825
GTI_bil0_uni50 |   9.02e-06   .0000469     0.19   0.847    -.0000829     .000101
GTI_bil0_uni51 |   .0000225   .0000483     0.47   0.641    -.0000721    .0001171
GTI_bil0_uni52 |   5.53e-06    .000049     0.11   0.910    -.0000904    .0001015
GTI_bil0_uni53 |  -.0000224   .0000531    -0.42   0.673    -.0001265    .0000817
GTI_bil0_uni54 |   -.000032   .0000521    -0.61   0.540    -.0001342    .0000702
GTI_bil0_uni55 |   .0000335   .0000558     0.60   0.549     -.000076    .0001429
GTI_bil0_uni56 |   7.92e-06   .0000527     0.15   0.881    -.0000954    .0001113
GTI_bil0_uni57 |   .0000662     .00005     1.32   0.185    -.0000318    .0001641
GTI_bil0_uni58 |  -5.82e-06   .0000419    -0.14   0.890     -.000088    .0000763
GTI_bil0_uni59 |  -.0000651   .0000399    -1.63   0.103    -.0001434    .0000132
GTI_bil0_uni60 |   6.20e-06   .0000561     0.11   0.912    -.0001037    .0001161
GTI_bil0_uni61 |  -.0000643   .0000611    -1.05   0.293    -.0001841    .0000555
GTI_bil0_uni62 |  -1.99e-06    .000051    -0.04   0.969     -.000102     .000098
GTI_bil0_uni63 |  -.0000287   .0000541    -0.53   0.596    -.0001347    .0000773
GTI_bil0_uni64 |   .0000417   .0000509     0.82   0.412     -.000058    .0001415
GTI_bil0_uni65 |   .0000126   .0000436     0.29   0.773    -.0000729     .000098
GTI_bil0_uni66 |   .0000165   .0000559     0.30   0.768     -.000093     .000126
GTI_bil0_uni67 |   .0000164   .0000519     0.32   0.751    -.0000852    .0001181
         _cons |   3.041624   .0575358    52.86   0.000     2.928848      3.1544
--------------------------------------------------------------------------------

. outreg2 using "$export\replication_TableA3.xls", append label excel tex ctitle("all GTI, all FE")  adds(Within-R2, e(r2w), Overall R2, e(r2o))
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA3.xls
dir : seeout

. test GTI_bil_0 GTI_bil_1 GTI_bil_2 GTI_bil_3 GTI_bil_4 GTI_bil_5 GTI_bil_6 GTI_bil_7 GTI_bil_8 GTI_bil_9 GTI_bil_10 GTI_bil_12 GTI_bil_13 GTI_bil_14 GTI_bil_15 
> GTI_bil_16 GTI_bil_17 GTI_bil_18 GTI_bil_19 GTI_bil_20 GTI_bil_21 GTI_bil_22 GTI_bil_23 GTI_bil_24 GTI_bil_25 GTI_bil_26 GTI_bil_27 GTI_bil_28 GTI_bil_29 GTI_bi
> l_30 GTI_bil_31 GTI_bil_32 GTI_bil_33 GTI_bil_34 GTI_bil_35 GTI_bil_36 GTI_bil_37 GTI_bil_38 GTI_bil_39 GTI_bil_40 GTI_bil_41 GTI_bil_42 GTI_bil_43 GTI_bil_44 G
> TI_bil_45 GTI_bil_46 GTI_bil_47 GTI_bil_48 GTI_bil_49 GTI_bil_50 GTI_bil_51 GTI_bil_52 GTI_bil_53 GTI_bil_54 GTI_bil_55 GTI_bil_56 GTI_bil_57 GTI_bil_58 GTI_bil
> _59 GTI_bil_60 GTI_bil_61 GTI_bil_62 GTI_bil_63 GTI_bil_64 GTI_bil_65 GTI_bil_66 GTI_bil_67 GTI_bil0_uni1 GTI_bil0_uni2 GTI_bil0_uni3 GTI_bil0_uni4 GTI_bil0_uni
> 5 GTI_bil0_uni6 GTI_bil0_uni7 GTI_bil0_uni8 GTI_bil0_uni9 GTI_bil0_uni10 GTI_bil0_uni11 GTI_bil0_uni12 GTI_bil0_uni13 GTI_bil0_uni14 GTI_bil0_uni15 GTI_bil0_uni
> 16 GTI_bil0_uni17 GTI_bil0_uni18 GTI_bil0_uni19 GTI_bil0_uni20 GTI_bil0_uni21 GTI_bil0_uni22 GTI_bil0_uni23 GTI_bil0_uni24 GTI_bil0_uni25 GTI_bil0_uni26 GTI_bil
> 0_uni27 GTI_bil0_uni28 GTI_bil0_uni29 GTI_bil0_uni30 GTI_bil0_uni31 GTI_bil0_uni32 GTI_bil0_uni33 GTI_bil0_uni34 GTI_bil0_uni35 GTI_bil0_uni36 GTI_bil0_uni37 GT
> I_bil0_uni38 GTI_bil0_uni39 GTI_bil0_uni40 GTI_bil0_uni41 GTI_bil0_uni42 GTI_bil0_uni43 GTI_bil0_uni44 GTI_bil0_uni45 GTI_bil0_uni46 GTI_bil0_uni47 GTI_bil0_uni
> 48 GTI_bil0_uni49 GTI_bil0_uni50 GTI_bil0_uni51 GTI_bil0_uni52 GTI_bil0_uni53 GTI_bil0_uni54 GTI_bil0_uni55 GTI_bil0_uni56 GTI_bil0_uni57 GTI_bil0_uni58 GTI_bil
> 0_uni59 GTI_bil0_uni60 GTI_bil0_uni61 GTI_bil0_uni62 GTI_bil0_uni63 GTI_bil0_uni64 GTI_bil0_uni65 GTI_bil0_uni66 GTI_bil0_uni67                                 

 ( 1)  GTI_bil_0 = 0
 ( 2)  GTI_bil_1 = 0
 ( 3)  GTI_bil_2 = 0
 ( 4)  GTI_bil_3 = 0
 ( 5)  GTI_bil_4 = 0
 ( 6)  GTI_bil_5 = 0
 ( 7)  GTI_bil_6 = 0
 ( 8)  GTI_bil_7 = 0
 ( 9)  GTI_bil_8 = 0
 (10)  GTI_bil_9 = 0
 (11)  GTI_bil_10 = 0
 (12)  GTI_bil_12 = 0
 (13)  GTI_bil_13 = 0
 (14)  GTI_bil_14 = 0
 (15)  GTI_bil_15 = 0
 (16)  GTI_bil_16 = 0
 (17)  GTI_bil_17 = 0
 (18)  GTI_bil_18 = 0
 (19)  GTI_bil_19 = 0
 (20)  GTI_bil_20 = 0
 (21)  GTI_bil_21 = 0
 (22)  GTI_bil_22 = 0
 (23)  GTI_bil_23 = 0
 (24)  GTI_bil_24 = 0
 (25)  GTI_bil_25 = 0
 (26)  GTI_bil_26 = 0
 (27)  GTI_bil_27 = 0
 (28)  GTI_bil_28 = 0
 (29)  GTI_bil_29 = 0
 (30)  GTI_bil_30 = 0
 (31)  GTI_bil_31 = 0
 (32)  GTI_bil_32 = 0
 (33)  GTI_bil_33 = 0
 (34)  GTI_bil_34 = 0
 (35)  GTI_bil_35 = 0
 (36)  GTI_bil_36 = 0
 (37)  GTI_bil_37 = 0
 (38)  GTI_bil_38 = 0
 (39)  GTI_bil_39 = 0
 (40)  GTI_bil_40 = 0
 (41)  GTI_bil_41 = 0
 (42)  GTI_bil_42 = 0
 (43)  GTI_bil_43 = 0
 (44)  GTI_bil_44 = 0
 (45)  GTI_bil_45 = 0
 (46)  GTI_bil_46 = 0
 (47)  GTI_bil_47 = 0
 (48)  GTI_bil_48 = 0
 (49)  GTI_bil_49 = 0
 (50)  GTI_bil_50 = 0
 (51)  GTI_bil_51 = 0
 (52)  GTI_bil_52 = 0
 (53)  GTI_bil_53 = 0
 (54)  GTI_bil_54 = 0
 (55)  GTI_bil_55 = 0
 (56)  GTI_bil_56 = 0
 (57)  GTI_bil_57 = 0
 (58)  GTI_bil_58 = 0
 (59)  GTI_bil_59 = 0
 (60)  GTI_bil_60 = 0
 (61)  GTI_bil_61 = 0
 (62)  GTI_bil_62 = 0
 (63)  GTI_bil_63 = 0
 (64)  GTI_bil_64 = 0
 (65)  GTI_bil_65 = 0
 (66)  GTI_bil_66 = 0
 (67)  GTI_bil_67 = 0
 (68)  GTI_bil0_uni1 = 0
 (69)  GTI_bil0_uni2 = 0
 (70)  GTI_bil0_uni3 = 0
 (71)  GTI_bil0_uni4 = 0
 (72)  GTI_bil0_uni5 = 0
 (73)  GTI_bil0_uni6 = 0
 (74)  GTI_bil0_uni7 = 0
 (75)  GTI_bil0_uni8 = 0
 (76)  GTI_bil0_uni9 = 0
 (77)  GTI_bil0_uni10 = 0
 (78)  GTI_bil0_uni11 = 0
 (79)  GTI_bil0_uni12 = 0
 (80)  GTI_bil0_uni13 = 0
 (81)  GTI_bil0_uni14 = 0
 (82)  GTI_bil0_uni15 = 0
 (83)  GTI_bil0_uni16 = 0
 (84)  GTI_bil0_uni17 = 0
 (85)  GTI_bil0_uni18 = 0
 (86)  GTI_bil0_uni19 = 0
 (87)  GTI_bil0_uni20 = 0
 (88)  GTI_bil0_uni21 = 0
 (89)  GTI_bil0_uni22 = 0
 (90)  GTI_bil0_uni23 = 0
 (91)  GTI_bil0_uni24 = 0
 (92)  GTI_bil0_uni25 = 0
 (93)  GTI_bil0_uni26 = 0
 (94)  GTI_bil0_uni27 = 0
 (95)  GTI_bil0_uni28 = 0
 (96)  GTI_bil0_uni29 = 0
 (97)  GTI_bil0_uni30 = 0
 (98)  GTI_bil0_uni31 = 0
 (99)  GTI_bil0_uni32 = 0
 (100)  GTI_bil0_uni33 = 0
 (101)  GTI_bil0_uni34 = 0
 (102)  GTI_bil0_uni35 = 0
 (103)  GTI_bil0_uni36 = 0
 (104)  GTI_bil0_uni37 = 0
 (105)  GTI_bil0_uni38 = 0
 (106)  GTI_bil0_uni39 = 0
 (107)  GTI_bil0_uni40 = 0
 (108)  GTI_bil0_uni41 = 0
 (109)  GTI_bil0_uni42 = 0
 (110)  GTI_bil0_uni43 = 0
 (111)  GTI_bil0_uni44 = 0
 (112)  GTI_bil0_uni45 = 0
 (113)  GTI_bil0_uni46 = 0
 (114)  GTI_bil0_uni47 = 0
 (115)  GTI_bil0_uni48 = 0
 (116)  GTI_bil0_uni49 = 0
 (117)  GTI_bil0_uni50 = 0
 (118)  GTI_bil0_uni51 = 0
 (119)  GTI_bil0_uni52 = 0
 (120)  GTI_bil0_uni53 = 0
 (121)  GTI_bil0_uni54 = 0
 (122)  GTI_bil0_uni55 = 0
 (123)  GTI_bil0_uni56 = 0
 (124)  GTI_bil0_uni57 = 0
 (125)  GTI_bil0_uni58 = 0
 (126)  GTI_bil0_uni59 = 0
 (127)  GTI_bil0_uni60 = 0
 (128)  GTI_bil0_uni61 = 0
 (129)  GTI_bil0_uni62 = 0
 (130)  GTI_bil0_uni63 = 0
 (131)  GTI_bil0_uni64 = 0
 (132)  GTI_bil0_uni65 = 0
 (133)  GTI_bil0_uni66 = 0
 (134)  GTI_bil0_uni67 = 0

       F(134, 17819) =    2.12
            Prob > F =    0.0000

. 
. * Table A4: Bilateral regression predicting Gallup World Poll variables from Google Trends Indices
. reg log_wmigdemand GTI_bil_0-GTI_bil_67  if $sample1
note: GTI_bil_11 omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =    21,855
-------------+----------------------------------   F(67, 21787)    =     64.79
       Model |  76080.6352        67  1135.53187   Prob > F        =    0.0000
    Residual |  381841.431    21,787  17.5261133   R-squared       =    0.1661
-------------+----------------------------------   Adj R-squared   =    0.1636
       Total |  457922.066    21,854  20.9536957   Root MSE        =    4.1864

------------------------------------------------------------------------------
log_wmigde~d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   GTI_bil_0 |   .0202056    .002363     8.55   0.000      .015574    .0248372
   GTI_bil_1 |  -.3335124   .1466386    -2.27   0.023    -.6209347   -.0460902
   GTI_bil_2 |   .0320132   .0156774     2.04   0.041     .0012844     .062742
   GTI_bil_3 |   .0163083   .0262854     0.62   0.535    -.0352131    .0678297
   GTI_bil_4 |  -.1489965    .027968    -5.33   0.000    -.2038159   -.0941771
   GTI_bil_5 |  -.0280155   .0177947    -1.57   0.115    -.0628944    .0068633
   GTI_bil_6 |  -.0207867   .0076019    -2.73   0.006    -.0356871   -.0058864
   GTI_bil_7 |  -.0037238   .0164927    -0.23   0.821    -.0360508    .0286031
   GTI_bil_8 |  -.0014401   .0165393    -0.09   0.931    -.0338583    .0309782
   GTI_bil_9 |   .2371958   .0816243     2.91   0.004     .0772062    .3971853
  GTI_bil_10 |   .0143945   .0053226     2.70   0.007     .0039618    .0248272
  GTI_bil_11 |          0  (omitted)
  GTI_bil_12 |  -.0306864   .0185307    -1.66   0.098    -.0670079    .0056351
  GTI_bil_13 |  -.0612229   .0297278    -2.06   0.039    -.1194915   -.0029543
  GTI_bil_14 |  -.0540678   .0094482    -5.72   0.000     -.072587   -.0355486
  GTI_bil_15 |  -.0595877   .0209776    -2.84   0.005    -.1007054     -.01847
  GTI_bil_16 |  -.0960921   .0131443    -7.31   0.000     -.121856   -.0703283
  GTI_bil_17 |   .0107808   .0216114     0.50   0.618    -.0315791    .0531407
  GTI_bil_18 |  -.0882204   .0084791   -10.40   0.000    -.1048401   -.0716008
  GTI_bil_19 |   .0384197   .0472254     0.81   0.416    -.0541456     .130985
  GTI_bil_20 |     .08497   .0175112     4.85   0.000     .0506467    .1192932
  GTI_bil_21 |   .0755636   .0269198     2.81   0.005     .0227989    .1283283
  GTI_bil_22 |  -.0412075   .0139749    -2.95   0.003    -.0685992   -.0138157
  GTI_bil_23 |   .1035994   .0180391     5.74   0.000     .0682416    .1389573
  GTI_bil_24 |    .084336   .0194743     4.33   0.000      .046165     .122507
  GTI_bil_25 |   .1277715   .0111246    11.49   0.000     .1059664    .1495766
  GTI_bil_26 |   .0146351   .0193201     0.76   0.449    -.0232338     .052504
  GTI_bil_27 |   -.054171   .0209733    -2.58   0.010    -.0952801   -.0130618
  GTI_bil_28 |   .1630798    .058877     2.77   0.006     .0476767     .278483
  GTI_bil_29 |   .0219955   .0119941     1.83   0.067    -.0015138    .0455048
  GTI_bil_30 |   -.063138   .0212422    -2.97   0.003    -.1047744   -.0215017
  GTI_bil_31 |   .0222347   .0452155     0.49   0.623    -.0663909    .1108604
  GTI_bil_32 |  -.0452197   .0102696    -4.40   0.000    -.0653489   -.0250905
  GTI_bil_33 |   .3035098   .1730458     1.75   0.079    -.0356726    .6426922
  GTI_bil_34 |  -.3796952   .1003609    -3.78   0.000    -.5764099   -.1829806
  GTI_bil_35 |   -.081447   .1826042    -0.45   0.656    -.4393646    .2764707
  GTI_bil_36 |   .1173028   .0058502    20.05   0.000      .105836    .1287696
  GTI_bil_37 |   .0516358   .0157673     3.27   0.001     .0207308    .0825409
  GTI_bil_38 |   -.005817   .0127885    -0.45   0.649    -.0308834    .0192493
  GTI_bil_39 |  -.1008782   .0116057    -8.69   0.000    -.1236262   -.0781302
  GTI_bil_40 |  -.0947587   .0354516    -2.67   0.008    -.1642464   -.0252709
  GTI_bil_41 |  -.0597146   .0135567    -4.40   0.000    -.0862867   -.0331426
  GTI_bil_42 |  -1.146384   .3613939    -3.17   0.002    -1.854743   -.4380259
  GTI_bil_43 |  -.0417214   .0232695    -1.79   0.073    -.0873314    .0038885
  GTI_bil_44 |   .0178118   .0110635     1.61   0.107    -.0038734    .0394971
  GTI_bil_45 |   .0595057   .0151885     3.92   0.000     .0297352    .0892763
  GTI_bil_46 |  -.0519106   .0119877    -4.33   0.000    -.0754073   -.0284139
  GTI_bil_47 |   .0088781   .0145654     0.61   0.542    -.0196711    .0374274
  GTI_bil_48 |   .0619807    .021071     2.94   0.003       .02068    .1032814
  GTI_bil_49 |  -.0724323   .0153866    -4.71   0.000    -.1025912   -.0422734
  GTI_bil_50 |   .0494535   .0213455     2.32   0.021     .0076148    .0912923
  GTI_bil_51 |   .0069245   .0135197     0.51   0.609    -.0195751    .0334241
  GTI_bil_52 |   .0038643   .0060589     0.64   0.524    -.0080117    .0157402
  GTI_bil_53 |  -.0515201   .0178721    -2.88   0.004    -.0865508   -.0164894
  GTI_bil_54 |   .1235068   .0140694     8.78   0.000     .0959297    .1510839
  GTI_bil_55 |   .1072503    .013451     7.97   0.000     .0808854    .1336151
  GTI_bil_56 |  -.0079965   .0313184    -0.26   0.798    -.0693829    .0533899
  GTI_bil_57 |   .0079041   .0110629     0.71   0.475    -.0137799    .0295881
  GTI_bil_58 |   .1190984     .01961     6.07   0.000     .0806613    .1575355
  GTI_bil_59 |   .0408601   .0160833     2.54   0.011     .0093357    .0723846
  GTI_bil_60 |    -.07127   .0857363    -0.83   0.406    -.2393194    .0967794
  GTI_bil_61 |   .1022313   .0097779    10.46   0.000     .0830658    .1213968
  GTI_bil_62 |  -.0318105    .010725    -2.97   0.003    -.0528323   -.0107887
  GTI_bil_63 |   .0161907   .0160643     1.01   0.314    -.0152965     .047678
  GTI_bil_64 |  -.0074267   .0109817    -0.68   0.499    -.0289516    .0140983
  GTI_bil_65 |  -.0581637   .0359653    -1.62   0.106    -.1286583    .0123308
  GTI_bil_66 |   .0482305   .0112207     4.30   0.000      .026237     .070224
  GTI_bil_67 |   .0911593   .0299591     3.04   0.002     .0324373    .1498812
       _cons |   1.798609    .039148    45.94   0.000     1.721877    1.875342
------------------------------------------------------------------------------

. outreg2 using "$export\replication_TableA4.xls", replace label excel tex ctitle("Demand")  
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA4.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA4.xls
dir : seeout

. reg log_wmigplan GTI_bil_0-GTI_bil_67   if $sample1
note: GTI_bil_11 omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =    21,855
-------------+----------------------------------   F(67, 21787)    =     24.07
       Model |   10313.606        67  153.934418   Prob > F        =    0.0000
    Residual |   139329.02    21,787  6.39505301   R-squared       =    0.0689
-------------+----------------------------------   Adj R-squared   =    0.0661
       Total |  149642.626    21,854  6.84737924   Root MSE        =    2.5288

------------------------------------------------------------------------------
log_wmigplan |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   GTI_bil_0 |   .0037247   .0014274     2.61   0.009     .0009269    .0065224
   GTI_bil_1 |   .1420547   .0885783     1.60   0.109    -.0315653    .3156746
   GTI_bil_2 |   .0180318   .0094701     1.90   0.057    -.0005302    .0365938
   GTI_bil_3 |   .0188322    .015878     1.19   0.236    -.0122897    .0499542
   GTI_bil_4 |   .0213359   .0168943     1.26   0.207    -.0117783      .05445
   GTI_bil_5 |  -.0319916    .010749    -2.98   0.003    -.0530605   -.0109227
   GTI_bil_6 |  -.0160573    .004592    -3.50   0.000     -.025058   -.0070566
   GTI_bil_7 |  -.0001585   .0099626    -0.02   0.987    -.0196859    .0193689
   GTI_bil_8 |  -.0333452   .0099907    -3.34   0.001    -.0529278   -.0137627
   GTI_bil_9 |   .1219845   .0493059     2.47   0.013     .0253414    .2186276
  GTI_bil_10 |   -.012159   .0032152    -3.78   0.000    -.0184609    -.005857
  GTI_bil_11 |          0  (omitted)
  GTI_bil_12 |  -.0092676   .0111936    -0.83   0.408     -.031208    .0126727
  GTI_bil_13 |  -.0247454   .0179573    -1.38   0.168     -.059943    .0104523
  GTI_bil_14 |  -.0001848   .0057073    -0.03   0.974    -.0113715    .0110019
  GTI_bil_15 |  -.0302163   .0126717    -2.38   0.017    -.0550538   -.0053788
  GTI_bil_16 |  -.0363299   .0079399    -4.58   0.000    -.0518927    -.020767
  GTI_bil_17 |  -.0122565   .0130546    -0.94   0.348    -.0378444    .0133314
  GTI_bil_18 |  -.0157407   .0051219    -3.07   0.002      -.02578   -.0057014
  GTI_bil_19 |   .0550488   .0285269     1.93   0.054    -.0008661    .1109637
  GTI_bil_20 |   .0219769   .0105778     2.08   0.038     .0012436    .0427102
  GTI_bil_21 |   .0088095   .0162611     0.54   0.588    -.0230635    .0406825
  GTI_bil_22 |  -.0403365   .0084416    -4.78   0.000    -.0568827   -.0237902
  GTI_bil_23 |    .044548   .0108967     4.09   0.000     .0231897    .0659062
  GTI_bil_24 |  -.0127827   .0117636    -1.09   0.277    -.0358402    .0102749
  GTI_bil_25 |    .050164   .0067199     7.46   0.000     .0369924    .0633355
  GTI_bil_26 |   .1049208   .0116705     8.99   0.000     .0820458    .1277958
  GTI_bil_27 |   .0294924   .0126691     2.33   0.020     .0046601    .0543248
  GTI_bil_28 |  -.0497352   .0355652    -1.40   0.162    -.1194455    .0199751
  GTI_bil_29 |  -.0017644   .0072451    -0.24   0.808    -.0159654    .0124366
  GTI_bil_30 |  -.0344434   .0128316    -2.68   0.007    -.0595942   -.0092926
  GTI_bil_31 |   .0196831   .0273128     0.72   0.471     -.033852    .0732181
  GTI_bil_32 |   -.007486   .0062035    -1.21   0.228    -.0196452    .0046733
  GTI_bil_33 |   .1854857   .1045299     1.77   0.076    -.0194005    .3903718
  GTI_bil_34 |  -.0449802   .0606239    -0.74   0.458    -.1638074    .0738471
  GTI_bil_35 |   .1666839   .1103037     1.51   0.131    -.0495194    .3828872
  GTI_bil_36 |   .0660701   .0035339    18.70   0.000     .0591435    .0729968
  GTI_bil_37 |  -.0062041   .0095244    -0.65   0.515    -.0248726    .0124643
  GTI_bil_38 |  -.0179005    .007725    -2.32   0.021    -.0330421    -.002759
  GTI_bil_39 |  -.0359946   .0070105    -5.13   0.000    -.0497357   -.0222535
  GTI_bil_40 |  -.0376502   .0214149    -1.76   0.079    -.0796249    .0043245
  GTI_bil_41 |  -.0118891    .008189    -1.45   0.147    -.0279402     .004162
  GTI_bil_42 |  -.5238814   .2183032    -2.40   0.016    -.9517716   -.0959913
  GTI_bil_43 |  -.0518072   .0140562    -3.69   0.000    -.0793583   -.0242561
  GTI_bil_44 |  -.0251937    .006683    -3.77   0.000    -.0382929   -.0120945
  GTI_bil_45 |   .0062156   .0091747     0.68   0.498    -.0117676    .0241987
  GTI_bil_46 |   .0028524   .0072412     0.39   0.694     -.011341    .0170457
  GTI_bil_47 |   .0022093   .0087984     0.25   0.802    -.0150362    .0194547
  GTI_bil_48 |   .0510954   .0127281     4.01   0.000     .0261474    .0760435
  GTI_bil_49 |  -.0374363   .0092944    -4.03   0.000     -.055654   -.0192185
  GTI_bil_50 |  -.0107422   .0128939    -0.83   0.405    -.0360152    .0145309
  GTI_bil_51 |   .0225273   .0081667     2.76   0.006       .00652    .0385346
  GTI_bil_52 |  -.0223646   .0036599    -6.11   0.000    -.0295384   -.0151908
  GTI_bil_53 |  -.0309818   .0107958    -2.87   0.004    -.0521424   -.0098212
  GTI_bil_54 |    -.00583   .0084988    -0.69   0.493    -.0224883    .0108282
  GTI_bil_55 |   .0837302   .0081252    10.31   0.000     .0678043    .0996561
  GTI_bil_56 |   .0134575   .0189182     0.71   0.477    -.0236235    .0505385
  GTI_bil_57 |   .0054318   .0066826     0.81   0.416    -.0076667    .0185302
  GTI_bil_58 |  -.0384711   .0118456    -3.25   0.001    -.0616894   -.0152528
  GTI_bil_59 |   .0372448   .0097153     3.83   0.000     .0182022    .0562875
  GTI_bil_60 |  -.1081196   .0517898    -2.09   0.037    -.2096313   -.0066079
  GTI_bil_61 |   .0355808   .0059065     6.02   0.000     .0240037    .0471579
  GTI_bil_62 |    .000411   .0064785     0.06   0.949    -.0122874    .0131094
  GTI_bil_63 |   .0139768   .0097038     1.44   0.150    -.0050434     .032997
  GTI_bil_64 |  -.0105578   .0066336    -1.59   0.111    -.0235602    .0024445
  GTI_bil_65 |  -.0372499   .0217251    -1.71   0.086    -.0798327     .005333
  GTI_bil_66 |   .0271426    .006778     4.00   0.000     .0138572    .0404279
  GTI_bil_67 |    .004508   .0180971     0.25   0.803    -.0309635    .0399795
       _cons |   .6177014   .0236477    26.12   0.000     .5713502    .6640526
------------------------------------------------------------------------------

. outreg2 using "$export\replication_TableA4.xls", append label excel tex ctitle("Plan")
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA4.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA4.xls
dir : seeout

. reg log_wmigprep GTI_bil_0-GTI_bil_67  if $sample1
note: GTI_bil_11 omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =    21,855
-------------+----------------------------------   F(67, 21787)    =     21.37
       Model |    6030.515        67  90.0076866   Prob > F        =    0.0000
    Residual |  91774.0516    21,787  4.21233082   R-squared       =    0.0617
-------------+----------------------------------   Adj R-squared   =    0.0588
       Total |  97804.5666    21,854  4.47536225   Root MSE        =    2.0524

------------------------------------------------------------------------------
log_wmigprep |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   GTI_bil_0 |   .0063565   .0011585     5.49   0.000     .0040858    .0086271
   GTI_bil_1 |   .0703874   .0718897     0.98   0.328    -.0705217    .2112964
   GTI_bil_2 |   .0173077   .0076858     2.25   0.024     .0022429    .0323725
   GTI_bil_3 |   .0352039   .0128865     2.73   0.006     .0099455    .0604623
   GTI_bil_4 |   .0267998   .0137114     1.95   0.051    -.0000755    .0536751
   GTI_bil_5 |  -.0155622   .0087239    -1.78   0.074    -.0326616    .0015372
   GTI_bil_6 |  -.0058071   .0037269    -1.56   0.119     -.013112    .0014978
   GTI_bil_7 |    .003009   .0080856     0.37   0.710    -.0128393    .0188573
   GTI_bil_8 |   -.010997   .0081084    -1.36   0.175    -.0268901    .0048961
   GTI_bil_9 |   .1180536   .0400164     2.95   0.003     .0396186    .1964887
  GTI_bil_10 |   -.005569   .0026094    -2.13   0.033    -.0106837   -.0004544
  GTI_bil_11 |          0  (omitted)
  GTI_bil_12 |  -.0004869   .0090847    -0.05   0.957    -.0182935    .0173197
  GTI_bil_13 |  -.0290383   .0145741    -1.99   0.046    -.0576046   -.0004721
  GTI_bil_14 |  -.0004773    .004632    -0.10   0.918    -.0095564    .0086017
  GTI_bil_15 |  -.0300431   .0102843    -2.92   0.003     -.050201   -.0098851
  GTI_bil_16 |  -.0286149    .006444    -4.44   0.000    -.0412457   -.0159842
  GTI_bil_17 |   .0078046    .010595     0.74   0.461    -.0129624    .0285715
  GTI_bil_18 |  -.0198933   .0041569    -4.79   0.000    -.0280411   -.0117455
  GTI_bil_19 |   .0691012   .0231523     2.98   0.003      .023721    .1144815
  GTI_bil_20 |   .0261649   .0085849     3.05   0.002     .0093379     .042992
  GTI_bil_21 |  -.0124036   .0131975    -0.94   0.347    -.0382715    .0134644
  GTI_bil_22 |  -.0131702   .0068512    -1.92   0.055     -.026599    .0002587
  GTI_bil_23 |   .0413288   .0088437     4.67   0.000     .0239946     .058663
  GTI_bil_24 |  -.0055775   .0095473    -0.58   0.559    -.0242909    .0131358
  GTI_bil_25 |   .0342059   .0054539     6.27   0.000      .023516    .0448959
  GTI_bil_26 |   .0597529   .0094717     6.31   0.000     .0411877    .0783182
  GTI_bil_27 |   .0067161   .0102822     0.65   0.514    -.0134377    .0268698
  GTI_bil_28 |  -.0223688   .0288645    -0.77   0.438    -.0789453    .0342077
  GTI_bil_29 |  -.0084829   .0058801    -1.44   0.149    -.0200083    .0030426
  GTI_bil_30 |  -.0537492    .010414    -5.16   0.000    -.0741614   -.0333369
  GTI_bil_31 |  -.0294436   .0221669    -1.33   0.184    -.0728924    .0140052
  GTI_bil_32 |  -.0116156   .0050347    -2.31   0.021     -.021484   -.0017473
  GTI_bil_33 |    .112669   .0848359     1.33   0.184    -.0536155    .2789535
  GTI_bil_34 |  -.0075371    .049202    -0.15   0.878    -.1039766    .0889025
  GTI_bil_35 |    .058481   .0895219     0.65   0.514    -.1169884    .2339505
  GTI_bil_36 |   .0487071   .0028681    16.98   0.000     .0430855    .0543287
  GTI_bil_37 |    .003233   .0077299     0.42   0.676    -.0119183    .0183842
  GTI_bil_38 |  -.0208701   .0062696    -3.33   0.001    -.0331589   -.0085813
  GTI_bil_39 |  -.0273296   .0056897    -4.80   0.000    -.0384818   -.0161774
  GTI_bil_40 |  -.0375362   .0173802    -2.16   0.031    -.0716026   -.0034697
  GTI_bil_41 |  -.0071831   .0066462    -1.08   0.280      -.02021    .0058439
  GTI_bil_42 |  -.4328336   .1771737    -2.44   0.015     -.780107   -.0855603
  GTI_bil_43 |  -.0332146   .0114079    -2.91   0.004    -.0555749   -.0108543
  GTI_bil_44 |  -.0122133   .0054239    -2.25   0.024    -.0228445   -.0015821
  GTI_bil_45 |   .0062873   .0074462     0.84   0.398    -.0083078    .0208823
  GTI_bil_46 |  -.0099592    .005877    -1.69   0.090    -.0214785    .0015601
  GTI_bil_47 |  -.0094903   .0071407    -1.33   0.184    -.0234866     .004506
  GTI_bil_48 |   .0559622   .0103301     5.42   0.000     .0357145    .0762099
  GTI_bil_49 |  -.0307517   .0075433    -4.08   0.000    -.0455371   -.0159663
  GTI_bil_50 |  -.0076006   .0104647    -0.73   0.468     -.028112    .0129109
  GTI_bil_51 |   .0076477    .006628     1.15   0.249    -.0053438    .0206391
  GTI_bil_52 |  -.0184261   .0029704    -6.20   0.000    -.0242483    -.012604
  GTI_bil_53 |  -.0198928   .0087618    -2.27   0.023    -.0370666   -.0027189
  GTI_bil_54 |  -.0093011   .0068976    -1.35   0.178    -.0228208    .0042186
  GTI_bil_55 |    .067247   .0065943    10.20   0.000     .0543216    .0801724
  GTI_bil_56 |   .0294418   .0153539     1.92   0.055    -.0006529    .0595366
  GTI_bil_57 |   .0048352   .0054236     0.89   0.373    -.0057954    .0154658
  GTI_bil_58 |  -.0436537   .0096138    -4.54   0.000    -.0624975   -.0248098
  GTI_bil_59 |   .0351418   .0078849     4.46   0.000     .0196869    .0505967
  GTI_bil_60 |  -.0759588   .0420323    -1.81   0.071    -.1583451    .0064276
  GTI_bil_61 |   .0225452   .0047936     4.70   0.000     .0131493    .0319411
  GTI_bil_62 |   .0027976    .005258     0.53   0.595    -.0075083    .0131036
  GTI_bil_63 |   .0079915   .0078756     1.01   0.310    -.0074452    .0234281
  GTI_bil_64 |  -.0041467   .0053838    -0.77   0.441    -.0146993    .0064059
  GTI_bil_65 |  -.0298324    .017632    -1.69   0.091    -.0643924    .0047276
  GTI_bil_66 |   .0163344    .005501     2.97   0.003     .0055521    .0271167
  GTI_bil_67 |  -.0145799   .0146875    -0.99   0.321    -.0433684    .0142087
       _cons |   .3623984   .0191923    18.88   0.000       .32478    .4000168
------------------------------------------------------------------------------

. outreg2 using "$export\replication_TableA4.xls", append label excel tex ctitle("Prepare")
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA4.tex
C:\Users\stoehr\Dropbox\Paper - Searching for a better life\R&R JDE\grafiken tabellen\replication_TableA4.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  C:\Users\stoehr\Dropbox\Data\Gallup\JDE Revision\replication_GWP_part.log
  log type:  text
 closed on:  16 Nov 2018, 15:17:32
------------------------------------------------------------------------------------------------------------------------------------------------------------------
